[Killed] GuardTypeTest
lib/ecto/association.ex:461:53
   @doc """
   Applies default values into the struct.
   """
-  def apply_defaults(struct, defaults, _owner) when is_list(defaults) do
+  def apply_defaults(struct, defaults, _owner) when is_tuple(defaults) do
     struct(struct, defaults)
   end

[Killed] GuardTypeTest
lib/ecto/association.ex:479:57
   def validate_defaults!(module, _name, fun) when is_atom(fun),
     do: {module, fun, []}
 
-  def validate_defaults!(_module, _name, defaults) when is_list(defaults),
+  def validate_defaults!(_module, _name, defaults) when is_tuple(defaults),
     do: defaults
 
