[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1077:48
     do: {:pos, var, ix}
 
   defp escape_bind({{name, {var, _, context}}, _ix})
-       when is_atom(name) and is_atom(var) and is_atom(context),
+       when is_atom(name) and is_atom(var) and is_nil(context),
        do: {:named, var, name}
 
