[Killed] GuardTypeTest
ecto/query/builder/order_by.ex:96:72
   defp get_env({env, _}), do: env
   defp get_env(env), do: env
 
-  defp escape_expansion(kind, expr, _type, params_acc, vars, env) when is_list(expr) do
+  defp escape_expansion(kind, expr, _type, params_acc, vars, env) when is_tuple(expr) do
     escape(kind, expr, params_acc, vars, env)
   end
