[Killed] GuardTypeTest
lib/ecto.ex:576:32
 
   """
   def assoc_loaded?(%Ecto.Association.NotLoaded{}), do: false
-  def assoc_loaded?(list) when is_list(list), do: true
+  def assoc_loaded?(list) when is_tuple(list), do: true
   def assoc_loaded?(%_{}), do: true
   def assoc_loaded?(nil), do: true

[Killed] ComparisonNegation
lib/ecto.ex:686:15
   end
 
   defp assert_struct!(module, %{__struct__: struct}) do
-    if struct != module do
+    if struct struct == module!= module do
       raise ArgumentError,
             "expected a homogeneous list containing the same struct, " <>
