[Survived] GuardComparisonNegation
lib/ecto/query/planner.ex:1774:71
     {take, from_tag} =
       case source do
         {source, schema, _}
-        when tag == :map and preloads != [] and is_binary(source) and schema != nil ->
+        when tag == :map and preloads != [] and is_binary(source) and schema == nil ->
           {Map.put(take, 0, {:struct, from_take}), :map}
 
