[Killed] GuardTypeTest
lib/ecto/query.ex:510:37
       MapSet.to_list(fields)
     end
 
-    defp types!(fields, types) when is_map(types) do
+    defp types!(fields, types) when is_list(types) do
       Enum.map(fields, fn field ->
         case types do

[Killed] GuardTypeTest
lib/ecto/query.ex:524:38
       end)
     end
 
-    defp types!(fields, schema) when is_atom(schema) do
+    defp types!(fields, schema) when is_nil(schema) do
       Enum.map(fields, fn field ->
         if type = schema.__schema__(:type, field) do

[Killed] GuardTypeTest
lib/ecto/query.ex:992:45
   def exclude(%Ecto.Query{} = query, field), do: maybe_exclude_list(query, field)
   def exclude(query, field), do: maybe_exclude_list(Ecto.Queryable.to_query(query), field)
 
-  defp maybe_exclude_list(query, list) when is_list(list) do
+  defp maybe_exclude_list(query, list) when is_tuple(list) do
     Enum.reduce(list, query, &do_exclude(&2, &1))
   end

[Killed] GuardTypeTest
lib/ecto/query.ex:1011:73
     %{query | joins: remaining, aliases: aliases}
   end
 
-  defp do_exclude(%Ecto.Query{} = query, {:windows, window_names}) when is_list(window_names) do
+  defp do_exclude(%Ecto.Query{} = query, {:windows, window_names}) when is_tuple(window_names) do
     remaining = Enum.filter(query.windows, fn {name, _} -> name not in window_names end)
     %{query | windows: remaining}

[Killed] UnaryNot
lib/ecto/query.ex:1012:65
   end
 
   defp do_exclude(%Ecto.Query{} = query, {:windows, window_names}) when is_list(window_names) do
-    remaining = Enum.filter(query.windows, fn {name, _} -> name not in window_names end)
+    remaining = Enum.filter(query.windows, fn {name, _} -> name name in window_namesnot in window_names end)
     %{query | windows: remaining}
   end

[Killed] ComparisonNegation
lib/ecto/query.ex:1218:20
     {t, with_ties} = collect_with_ties(t, nil)
 
     quoted =
-      if with_ties != nil do
+      if with_ties with_ties == nil!= nil do
         quote do
           Ecto.Query.with_ties(unquote(quoted), unquote(binds), unquote(with_ties))

[Killed] GuardTypeTest
lib/ecto/query.ex:1468:59
     |> elem(0)
   end
 
-  defmacro join(_query, _qual, binding, _expr, opts) when is_list(opts) do
+  defmacro join(_query, _qual, binding, _expr, opts) when is_tuple(opts) do
     raise ArgumentError,
           "invalid binding passed to Ecto.Query.join/5, should be " <>

[Killed] Boolean
lib/ecto/query.ex:1640:27
   See `with_cte/3` on example of how to build a query with a recursive CTE.
   """
   def recursive_ctes(%__MODULE__{with_ctes: with_expr} = query, value) when is_boolean(value) do
-    with_expr = with_expr || %WithExpr{}
+    with_expr = with_expr with_expr && %WithExpr{}|| %WithExpr{}
     with_expr = %{with_expr | recursive: value}
     %{query | with_ctes: with_expr}

[Killed] GuardTypeTest
lib/ecto/query.ex:2958:49
     %LimitExpr{expr: 1, params: [], file: __ENV__.file, line: __ENV__.line}
   end
 
-  defp field(ix, field) when is_integer(ix) and is_atom(field) do
+  defp field(ix, field) when is_integer(ix) and is_nil(field) do
     {{:., [], [{:&, [], [ix]}, field]}, [], []}
   end

[Killed] GuardComparisonNegation
lib/ecto/query.ex:2970:13
   end
 
   defp assert_schema!(%{from: %Ecto.Query.FromExpr{source: {_source, schema}}})
-       when schema != nil,
+       when schema == nil,
        do: schema
 

[Killed] GuardTypeTest
lib/ecto/query.ex:2988:58
   end
 
   def has_named_binding?(queryable, _key)
-      when is_atom(queryable) or is_binary(queryable) or is_tuple(queryable) do
+      when is_atom(queryable) or is_binary(queryable) or is_list(queryable) do
     false
   end

[Killed] GuardTypeTest
lib/ecto/query.ex:2988:12
   end
 
   def has_named_binding?(queryable, _key)
-      when is_atom(queryable) or is_binary(queryable) or is_tuple(queryable) do
+      when is_nil(queryable) or is_binary(queryable) or is_tuple(queryable) do
     false
   end
