[Killed] ComparisonNegation
lib/ecto/adapter/queryable.ex:109:53
     {_meta, prepared, _cast_params, dump_params} =
       queryable
       |> Ecto.Queryable.to_query()
-      |> Ecto.Query.Planner.ensure_select(operation == :all)
+      |> Ecto.Query.Planner.ensure_select(operation operation != :all== :all)
       |> Ecto.Query.Planner.query(operation, cache, adapter, 0)
 
