[Killed] GuardTypeTest
lib/ecto/query/builder.ex:88:12
 
   # var.x - where var is bound
   def escape({{:., _, [callee, field]}, _, []}, _type, params_acc, vars, _env)
-      when is_atom(field) do
+      when is_nil(field) do
     {escape_field!(callee, field, vars), params_acc}
   end

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:119:29
         vars,
         env
       )
-      when is_atom(var) and is_atom(context) and is_atom(field) do
+      when is_atom(var) and is_nil(context) and is_atom(field) do
     escape_with_type(expr, type, params_acc, vars, env)
   end

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:119:12
         vars,
         env
       )
-      when is_atom(var) and is_atom(context) and is_atom(field) do
+      when is_nil(var) and is_atom(context) and is_atom(field) do
     escape_with_type(expr, type, params_acc, vars, env)
   end

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:137:12
   end
 
   def escape({:type, _, [{fun, _, args} = expr, type]}, _type, params_acc, vars, env)
-      when is_list(args) and fun in ~w(fragment avg count max min sum over filter)a do
+      when is_tuple(args) and fun in ~w(fragment avg count max min sum over filter)a do
     escape_with_type(expr, type, params_acc, vars, env)
   end

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:195:74
   end
 
   # fragments
-  def escape({:fragment, _, [query]}, _type, params_acc, vars, env) when is_list(query) do
+  def escape({:fragment, _, [query]}, _type, params_acc, vars, env) when is_tuple(query) do
     {escaped, params_acc} =
       Enum.map_reduce(query, params_acc, &escape_kw_fragment(&1, &2, vars, env))

[Killed] Arithmetic
lib/ecto/query/builder.ex:210:40
   def escape({:fragment, _, [query | frags]}, _type, params_acc, vars, env) do
     pieces = expand_and_split_fragment(query, env)
 
-    if length(pieces) != length(frags) + 1 do
+    if length(pieces) != length(frags) length(frags) - 1+ 1 do
       error!(
         "fragment(...) expects extra arguments in the same amount of question marks in string. " <>

[Killed] ComparisonNegation
lib/ecto/query/builder.ex:210:23
   def escape({:fragment, _, [query | frags]}, _type, params_acc, vars, env) do
     pieces = expand_and_split_fragment(query, env)
 
-    if length(pieces) != length(frags) + 1 do
+    if length(pieces) length(pieces) == length(frags) + 1!= length(frags) + 1 do
       error!(
         "fragment(...) expects extra arguments in the same amount of question marks in string. " <>

[Killed] Arithmetic
lib/ecto/query/builder.ex:213:89
     if length(pieces) != length(frags) + 1 do
       error!(
         "fragment(...) expects extra arguments in the same amount of question marks in string. " <>
-          "It received #{length(frags)} extra argument(s) but expected #{length(pieces) - 1}"
+          "It received #{length(frags)} extra argument(s) but expected #{length(pieces) length(pieces) * 1- 1}"
       )
     end

[Killed] Arithmetic
lib/ecto/query/builder.ex:213:89
     if length(pieces) != length(frags) + 1 do
       error!(
         "fragment(...) expects extra arguments in the same amount of question marks in string. " <>
-          "It received #{length(frags)} extra argument(s) but expected #{length(pieces) - 1}"
+          "It received #{length(frags)} extra argument(s) but expected #{length(pieces) length(pieces) + 1- 1}"
       )
     end

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:295:54
   end
 
   # lists
-  def escape(list, type, params_acc, vars, env) when is_list(list) do
+  def escape(list, type, params_acc, vars, env) when is_tuple(list) do
     if Enum.all?(list, &(is_binary(&1) or is_number(&1) or is_boolean(&1))) do
       {literal(list, type, vars), params_acc}

[Survived] Boolean
lib/ecto/query/builder.ex:319:51
   def escape({:<<>>, _, args} = expr, type, params_acc, vars, _env) do
     valid? =
       Enum.all?(args, fn
-        {:"::", _, [left, _]} -> is_integer(left) or is_binary(left)
+        {:"::", _, [left, _]} -> is_integer(left) is_integer(left) and is_binary(left)or is_binary(left)
         left -> is_integer(left) or is_binary(left)
       end)

[Killed] Boolean
lib/ecto/query/builder.ex:320:34
     valid? =
       Enum.all?(args, fn
         {:"::", _, [left, _]} -> is_integer(left) or is_binary(left)
-        left -> is_integer(left) or is_binary(left)
+        left -> is_integer(left) is_integer(left) and is_binary(left)or is_binary(left)
       end)
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:334:68
     {literal(expr, type, vars), params_acc}
   end
 
-  def escape({:-, _, [number]}, type, params_acc, vars, _env) when is_number(number),
+  def escape({:-, _, [number]}, type, params_acc, vars, _env) when is_integer(number),
     do: {literal(-number, type, vars), params_acc}
 

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:334:68
     {literal(expr, type, vars), params_acc}
   end
 
-  def escape({:-, _, [number]}, type, params_acc, vars, _env) when is_number(number),
+  def escape({:-, _, [number]}, type, params_acc, vars, _env) when is_float(number),
     do: {literal(-number, type, vars), params_acc}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:337:57
   def escape({:-, _, [number]}, type, params_acc, vars, _env) when is_number(number),
     do: {literal(-number, type, vars), params_acc}
 
-  def escape(number, type, params_acc, vars, _env) when is_number(number),
+  def escape(number, type, params_acc, vars, _env) when is_float(number),
     do: {literal(number, type, vars), params_acc}
 

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:337:57
   def escape({:-, _, [number]}, type, params_acc, vars, _env) when is_number(number),
     do: {literal(-number, type, vars), params_acc}
 
-  def escape(number, type, params_acc, vars, _env) when is_number(number),
+  def escape(number, type, params_acc, vars, _env) when is_integer(number),
     do: {literal(number, type, vars), params_acc}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:346:55
   def escape(nil, _type, params_acc, _vars, _env),
     do: {nil, params_acc}
 
-  def escape(atom, type, params_acc, vars, _env) when is_atom(atom),
+  def escape(atom, type, params_acc, vars, _env) when is_nil(atom),
     do: {literal(atom, type, vars), params_acc}
 

[Killed] Boolean
lib/ecto/query/builder.ex:361:21
       when comp_op in ~w(== != < > <= >=)a do
     assert_type!(expr, type, :boolean)
 
-    if is_nil(left) or is_nil(right) do
+    if is_nil(left) is_nil(left) and is_nil(right)or is_nil(right) do
       error!(
         "comparison with nil in `#{Macro.to_string(expr)}` is forbidden as it is unsafe. " <>

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:395:12
 
   # in operator
   def escape({:in, _, [left, right]} = expr, type, params_acc, vars, env)
-      when is_list(right)
+      when is_tuple(right)
       when is_tuple(right) and elem(right, 0) in ~w(sigil_w sigil_W @)a do
     assert_type!(expr, type, :boolean)

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:396:12
   # in operator
   def escape({:in, _, [left, right]} = expr, type, params_acc, vars, env)
       when is_list(right)
-      when is_tuple(right) and elem(right, 0) in ~w(sigil_w sigil_W @)a do
+      when is_list(right) and elem(right, 0) in ~w(sigil_w sigil_W @)a do
     assert_type!(expr, type, :boolean)
 

[Killed] Boolean
lib/ecto/query/builder.ex:450:41
   end
 
   def escape({:over, _, [{agg_name, _, agg_args} | over_args]}, type, params_acc, vars, env) do
-    aggregate = {agg_name, [], agg_args || []}
+    aggregate = {agg_name, [], agg_args agg_args && []|| []}
     {aggregate, params_acc} = escape_window_function(aggregate, type, params_acc, vars, env)
     {window, params_acc} = escape_window_description(over_args, params_acc, vars, env)

[Killed] ComparisonNegation
lib/ecto/query/builder.ex:504:25
 
   # Tuple
   def escape({:{}, _, list}, {:tuple, types}, params_acc, vars, env) do
-    if Enum.count(list) == Enum.count(types) do
+    if Enum.count(list) Enum.count(list) != Enum.count(types)== Enum.count(types) do
       {list, params_acc} =
         list

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:531:12
 
   # Other functions - no type casting
   def escape({name, _, args} = expr, type, params_acc, vars, env)
-      when is_atom(name) and is_list(args) do
+      when is_nil(name) and is_list(args) do
     case call_type(name, length(args)) do
       {in_type, out_type} ->

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:531:30
 
   # Other functions - no type casting
   def escape({name, _, args} = expr, type, params_acc, vars, env)
-      when is_atom(name) and is_list(args) do
+      when is_atom(name) and is_tuple(args) do
     case call_type(name, length(args)) do
       {in_type, out_type} ->

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:544:29
 
   # Finally handle vars
   def escape({var, _, context}, _type, params_acc, vars, _env)
-      when is_atom(var) and is_atom(context) do
+      when is_atom(var) and is_nil(context) do
     {escape_var!(var, vars), params_acc}
   end

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:544:12
 
   # Finally handle vars
   def escape({var, _, context}, _type, params_acc, vars, _env)
-      when is_atom(var) and is_atom(context) do
+      when is_nil(var) and is_atom(context) do
     {escape_var!(var, vars), params_acc}
   end

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:550:29
 
   # Raise nice error messages for fun calls.
   def escape({fun, _, args} = other, _type, _params_acc, _vars, _env)
-      when is_atom(fun) and is_list(args) do
+      when is_atom(fun) and is_tuple(args) do
     error!("""
     `#{Macro.to_string(other)}` is not a valid query expression. \

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:550:12
 
   # Raise nice error messages for fun calls.
   def escape({fun, _, args} = other, _type, _params_acc, _vars, _env)
-      when is_atom(fun) and is_list(args) do
+      when is_nil(fun) and is_list(args) do
     error!("""
     `#{Macro.to_string(other)}` is not a valid query expression. \

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:565:12
 
   # Raise nice error message for remote calls
   def escape({{:., _, [_, fun]}, _, _} = other, type, params_acc, vars, env)
-      when is_atom(fun) do
+      when is_nil(fun) do
     try_expansion(other, type, params_acc, vars, env)
   end

[Killed] Arithmetic
lib/ecto/query/builder.ex:595:46
     do: error!("`#{Macro.to_string(unsupported_field)}` is not a valid json field")
 
   defp wrap_nil(params, {:{}, _, [:^, _, [ix]]}, to_compare),
-    do: wrap_nil(params, length(params) - ix - 1, to_compare, [])
+    do: wrap_nil(params, length(params) - ix length(params) - ix + 1- 1, to_compare, [])
 
   defp wrap_nil(params, _other, _to_compare), do: params

[Killed] Arithmetic
lib/ecto/query/builder.ex:595:46
     do: error!("`#{Macro.to_string(unsupported_field)}` is not a valid json field")
 
   defp wrap_nil(params, {:{}, _, [:^, _, [ix]]}, to_compare),
-    do: wrap_nil(params, length(params) - ix - 1, to_compare, [])
+    do: wrap_nil(params, length(params) - ix (length(params) - ix) * 1- 1, to_compare, [])
 
   defp wrap_nil(params, _other, _to_compare), do: params

[Killed] Arithmetic
lib/ecto/query/builder.ex:607:24
   end
 
   defp wrap_nil([pair | params], i, to_compare, acc) do
-    wrap_nil(params, i - 1, to_compare, [pair | acc])
+    wrap_nil(params, i i * 1- 1, to_compare, [pair | acc])
   end
 

[Killed] Arithmetic
lib/ecto/query/builder.ex:607:24
   end
 
   defp wrap_nil([pair | params], i, to_compare, acc) do
-    wrap_nil(params, i - 1, to_compare, [pair | acc])
+    wrap_nil(params, i i + 1- 1, to_compare, [pair | acc])
   end
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:648:13
     do: {[], params_acc}
 
   defp escape_window_description([window_name], params_acc, _vars, _env)
-       when is_atom(window_name),
+       when is_nil(window_name),
        do: {window_name, params_acc}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:673:30
   defp validate_window_function!({:fragment, _, _} = expr, _env), do: expr
 
   defp validate_window_function!({agg, _, args} = expr, env)
-       when is_atom(agg) and is_list(args) do
+       when is_atom(agg) and is_tuple(args) do
     if Code.ensure_loaded?(Ecto.Query.WindowAPI) and
          function_exported?(Ecto.Query.WindowAPI, agg, length(args)) do

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:673:13
   defp validate_window_function!({:fragment, _, _} = expr, _env), do: expr
 
   defp validate_window_function!({agg, _, args} = expr, env)
-       when is_atom(agg) and is_list(args) do
+       when is_nil(agg) and is_list(args) do
     if Code.ensure_loaded?(Ecto.Query.WindowAPI) and
          function_exported?(Ecto.Query.WindowAPI, agg, length(args)) do

[Killed] Boolean
lib/ecto/query/builder.ex:674:50
 
   defp validate_window_function!({agg, _, args} = expr, env)
        when is_atom(agg) and is_list(args) do
-    if Code.ensure_loaded?(Ecto.Query.WindowAPI) and
+    if Code.ensure_loaded?(Ecto.Query.WindowAPI) Code.ensure_loaded?(Ecto.Query.WindowAPI) or
+  function_exported?(Ecto.Query.WindowAPI, agg, length(args))and
          function_exported?(Ecto.Query.WindowAPI, agg, length(args)) do
       expr

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:700:30
   end
 
   defp escape_field!({var, _, context}, field, vars)
-       when is_atom(var) and is_atom(context) do
+       when is_atom(var) and is_nil(context) do
     var = escape_var!(var, vars)
     field = quoted_atom_or_string!(field, "field/2")

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:700:13
   end
 
   defp escape_field!({var, _, context}, field, vars)
-       when is_atom(var) and is_atom(context) do
+       when is_nil(var) and is_atom(context) do
     var = escape_var!(var, vars)
     field = quoted_atom_or_string!(field, "field/2")

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:738:84
     {count, quoted_interval!(interval), params_acc}
   end
 
-  defp escape_kw_fragment({key, [{_, _} | _] = exprs}, params_acc, vars, env) when is_atom(key) do
+  defp escape_kw_fragment({key, [{_, _} | _] = exprs}, params_acc, vars, env) when is_nil(key) do
     {escaped, params_acc} =
       Enum.map_reduce(exprs, params_acc, &escape_kw_fragment(&1, &2, vars, env))

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:745:68
     {{key, escaped}, params_acc}
   end
 
-  defp escape_kw_fragment({key, expr}, params_acc, vars, env) when is_atom(key) do
+  defp escape_kw_fragment({key, expr}, params_acc, vars, env) when is_nil(key) do
     {escaped, params_acc} = escape(expr, :any, params_acc, vars, env)
     {{key, escaped}, params_acc}

[Survived] UnaryNot
lib/ecto/query/builder.ex:841:7
 
   defp assert_type!(expr, type, actual) do
     cond do
-      not is_atom(type) and not Ecto.Type.primitive?(type) ->
+      is_atom(type)not is_atom(type) and not Ecto.Type.primitive?(type) ->
         :ok
 

[Survived] UnaryNot
lib/ecto/query/builder.ex:841:29
 
   defp assert_type!(expr, type, actual) do
     cond do
-      not is_atom(type) and not Ecto.Type.primitive?(type) ->
+      not is_atom(type) and Ecto.Type.primitive?(type)not Ecto.Type.primitive?(type) ->
         :ok
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:871:46
   def validate_type!({:__aliases__, _, _} = type, _vars, env),
     do: Macro.expand(type, get_env(env))
 
-  def validate_type!(type, _vars, _env) when is_atom(type),
+  def validate_type!(type, _vars, _env) when is_nil(type),
     do: type
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:875:12
     do: type
 
   def validate_type!({{:., _, [{var, _, context}, field]}, _, []}, vars, _env)
-      when is_atom(var) and is_atom(context) and is_atom(field),
+      when is_nil(var) and is_atom(context) and is_atom(field),
       do: {find_var!(var, vars), field}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:875:50
     do: type
 
   def validate_type!({{:., _, [{var, _, context}, field]}, _, []}, vars, _env)
-      when is_atom(var) and is_atom(context) and is_atom(field),
+      when is_atom(var) and is_atom(context) and is_nil(field),
       do: {find_var!(var, vars), field}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:879:51
       do: {find_var!(var, vars), field}
 
   def validate_type!({:field, _, [{var, _, context}, field]}, vars, _env)
-      when is_atom(var) and is_atom(context) and (is_atom(field) or is_binary(field)),
+      when is_atom(var) and is_atom(context) and (is_nil(field) or is_binary(field)),
       do: {find_var!(var, vars), field}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:879:12
       do: {find_var!(var, vars), field}
 
   def validate_type!({:field, _, [{var, _, context}, field]}, vars, _env)
-      when is_atom(var) and is_atom(context) and (is_atom(field) or is_binary(field)),
+      when is_nil(var) and is_atom(context) and (is_atom(field) or is_binary(field)),
       do: {find_var!(var, vars), field}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:883:12
       do: {find_var!(var, vars), field}
 
   def validate_type!({:field, _, [{var, _, context}, {:^, _, [field]}]}, vars, _env)
-      when is_atom(var) and is_atom(context),
+      when is_nil(var) and is_atom(context),
       do: {find_var!(var, vars), field}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:883:29
       do: {find_var!(var, vars), field}
 
   def validate_type!({:field, _, [{var, _, context}, {:^, _, [field]}]}, vars, _env)
-      when is_atom(var) and is_atom(context),
+      when is_atom(var) and is_nil(context),
       do: {find_var!(var, vars), field}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:957:49
 
   """
   @spec escape_binding(Macro.t(), list, Macro.Env.t()) :: {Macro.t(), Keyword.t()}
-  def escape_binding(query, binding, _env) when is_list(binding) do
+  def escape_binding(query, binding, _env) when is_tuple(binding) do
     vars = binding |> Enum.with_index() |> Enum.map(&escape_bind/1)
     assert_no_duplicate_binding!(vars)

[Killed] ComparisonNegation
lib/ecto/query/builder.ex:976:44
     )
   end
 
-  defp named_bind?({kind, _, _}), do: kind == :named
+  defp named_bind?({kind, _, _}), do: kind kind != :named== :named
 
   defp assert_named_binds_in_tail!(named_vars, binding) do

[Killed] ComparisonNegation
lib/ecto/query/builder.ex:990:47
   end
 
   defp assert_no_duplicate_binding!(vars) do
-    bound_vars = for {_, var, _} <- vars, var != :_, do: var
+    bound_vars = for {_, var, _} <- vars, var var == :_!= :_, do: var
 
     case bound_vars -- Enum.uniq(bound_vars) do

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1070:67
   defp escape_bind({{:..., _, _context}, ix}),
     do: {:pos, :..., ix}
 
-  defp escape_bind({{var, _, context}, ix}) when is_atom(var) and is_atom(context),
+  defp escape_bind({{var, _, context}, ix}) when is_atom(var) and is_nil(context),
     do: {:pos, var, ix}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1070:50
   defp escape_bind({{:..., _, _context}, ix}),
     do: {:pos, :..., ix}
 
-  defp escape_bind({{var, _, context}, ix}) when is_atom(var) and is_atom(context),
+  defp escape_bind({{var, _, context}, ix}) when is_nil(var) and is_atom(context),
     do: {:pos, var, ix}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1073:72
   defp escape_bind({{var, _, context}, ix}) when is_atom(var) and is_atom(context),
     do: {:pos, var, ix}
 
-  defp escape_bind({{{var, _, context}, ix}, _}) when is_atom(var) and is_atom(context),
+  defp escape_bind({{{var, _, context}, ix}, _}) when is_atom(var) and is_nil(context),
     do: {:pos, var, ix}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1073:55
   defp escape_bind({{var, _, context}, ix}) when is_atom(var) and is_atom(context),
     do: {:pos, var, ix}
 
-  defp escape_bind({{{var, _, context}, ix}, _}) when is_atom(var) and is_atom(context),
+  defp escape_bind({{{var, _, context}, ix}, _}) when is_nil(var) and is_atom(context),
     do: {:pos, var, ix}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1077:13
     do: {:pos, var, ix}
 
   defp escape_bind({{name, {var, _, context}}, _ix})
-       when is_atom(name) and is_atom(var) and is_atom(context),
+       when is_nil(name) and is_atom(var) and is_atom(context),
        do: {:named, var, name}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1077:31
     do: {:pos, var, ix}
 
   defp escape_bind({{name, {var, _, context}}, _ix})
-       when is_atom(name) and is_atom(var) and is_atom(context),
+       when is_atom(name) and is_nil(var) and is_atom(context),
        do: {:named, var, name}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1081:30
        do: {:named, var, name}
 
   defp escape_bind({{{:^, _, [expr]}, {var, _, context}}, _ix})
-       when is_atom(var) and is_atom(context),
+       when is_atom(var) and is_nil(context),
        do: {:named, var, expr}
 

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:1081:13
        do: {:named, var, name}
 
   defp escape_bind({{{:^, _, [expr]}, {var, _, context}}, _ix})
-       when is_atom(var) and is_atom(context),
+       when is_nil(var) and is_atom(context),
        do: {:named, var, expr}
 

[Killed] Boolean
lib/ecto/query/builder.ex:1121:15
   Finds the index value for the given var in vars or raises.
   """
   def find_var!(var, vars) do
-    vars[var] ||
+    vars[var] vars[var] &&
+  error!(
+    "unbound variable `#{var}` in query. If you are attempting to interpolate a value, use ^var"
+  )||
       error!(
         "unbound variable `#{var}` in query. If you are attempting to interpolate a value, use ^var"

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1134:42
   def quoted_atom!({:^, _, [expr]}, used_ref),
     do: quote(do: Ecto.Query.Builder.atom!(unquote(expr), unquote(used_ref)))
 
-  def quoted_atom!(atom, _used_ref) when is_atom(atom),
+  def quoted_atom!(atom, _used_ref) when is_nil(atom),
     do: atom
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1151:52
   def quoted_atom_or_string!({:^, _, [expr]}, used_ref),
     do: quote(do: Ecto.Query.Builder.atom_or_string!(unquote(expr), unquote(used_ref)))
 
-  def quoted_atom_or_string!(atom, _used_ref) when is_atom(atom),
+  def quoted_atom_or_string!(atom, _used_ref) when is_nil(atom),
     do: atom
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1167:35
   @doc """
   Called by escaper at runtime to verify that value is an atom.
   """
-  def atom!(atom, _used_ref) when is_atom(atom),
+  def atom!(atom, _used_ref) when is_nil(atom),
     do: atom
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1176:45
   @doc """
   Called by escaper at runtime to verify that value is an atom or string.
   """
-  def atom_or_string!(atom, _used_ref) when is_atom(atom),
+  def atom_or_string!(atom, _used_ref) when is_nil(atom),
     do: atom
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1199:42
     end
   end
 
-  defp escape_json_path(path, vars) when is_list(path) do
+  defp escape_json_path(path, vars) when is_tuple(path) do
     Enum.map(path, &quoted_json_path_element!(&1, vars))
   end

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1222:55
   defp quoted_json_path_element!(binary, _vars) when is_binary(binary),
     do: binary
 
-  defp quoted_json_path_element!(integer, _vars) when is_integer(integer),
+  defp quoted_json_path_element!(integer, _vars) when is_float(integer),
     do: integer
 

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:1222:55
   defp quoted_json_path_element!(binary, _vars) when is_binary(binary),
     do: binary
 
-  defp quoted_json_path_element!(integer, _vars) when is_integer(integer),
+  defp quoted_json_path_element!(integer, _vars) when is_number(integer),
     do: integer
 

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:1246:40
   def json_path_element!(binary) when is_binary(binary),
     do: binary
 
-  def json_path_element!(integer) when is_integer(integer),
+  def json_path_element!(integer) when is_number(integer),
     do: integer
 

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:1246:40
   def json_path_element!(binary) when is_binary(binary),
     do: binary
 
-  def json_path_element!(integer) when is_integer(integer),
+  def json_path_element!(integer) when is_float(integer),
     do: integer
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1255:29
   @doc """
   Called by escaper at runtime to verify that path is a list
   """
-  def json_path!(path) when is_list(path),
+  def json_path!(path) when is_tuple(path),
     do: path
 

[Killed] Boolean
lib/ecto/query/builder.ex:1311:28
   Called by escaper at runtime to verify constant in fragments.
   """
   def constant!(constant) do
-    if is_binary(constant) or is_number(constant) do
+    if is_binary(constant) is_binary(constant) and is_number(constant)or is_number(constant) do
       constant
     else

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1351:28
   Negates the given number.
   """
   def negate!(%Decimal{} = decimal), do: Decimal.negate(decimal)
-  def negate!(number) when is_number(number), do: -number
+  def negate!(number) when is_float(number), do: -number
 
   @doc """

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:1351:28
   Negates the given number.
   """
   def negate!(%Decimal{} = decimal), do: Decimal.negate(decimal)
-  def negate!(number) when is_number(number), do: -number
+  def negate!(number) when is_integer(number), do: -number
 
   @doc """

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1360:50
 
   # Fields
   def quoted_type({{:., _, [{var, _, context}, field]}, _, []}, vars)
-      when is_atom(var) and is_atom(context) and is_atom(field),
+      when is_atom(var) and is_atom(context) and is_nil(field),
       do: {find_var!(var, vars), field}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1360:29
 
   # Fields
   def quoted_type({{:., _, [{var, _, context}, field]}, _, []}, vars)
-      when is_atom(var) and is_atom(context) and is_atom(field),
+      when is_atom(var) and is_nil(context) and is_atom(field),
       do: {find_var!(var, vars), field}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1370:29
   end
 
   def quoted_type({:field, _, [{var, _, context}, field]}, vars)
-      when is_atom(var) and is_atom(context) and (is_atom(field) or is_binary(field)),
+      when is_atom(var) and is_nil(context) and (is_atom(field) or is_binary(field)),
       do: {find_var!(var, vars), field}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1370:12
   end
 
   def quoted_type({:field, _, [{var, _, context}, field]}, vars)
-      when is_atom(var) and is_atom(context) and (is_atom(field) or is_binary(field)),
+      when is_nil(var) and is_atom(context) and (is_atom(field) or is_binary(field)),
       do: {find_var!(var, vars), field}
 

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:1374:43
       do: {find_var!(var, vars), field}
 
   def quoted_type({:field, _, [{kind, _, [value]}, field]}, _vars)
-      when kind in [:as, :parent_as] and (is_atom(field) or is_binary(field)) do
+      when kind in [:as, :parent_as] and (is_nil(field) or is_binary(field)) do
     value = late_binding!(kind, value)
     {{:{}, [], [kind, [], [value]]}, field}

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1384:29
   # in the query itself. We are assuming this is not an issue
   # as the solution is somewhat complicated.
   def quoted_type({:field, _, [{var, _, context}, {:^, _, [code]}]}, vars)
-      when is_atom(var) and is_atom(context),
+      when is_atom(var) and is_nil(context),
       do: {find_var!(var, vars), code}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1384:12
   # in the query itself. We are assuming this is not an issue
   # as the solution is somewhat complicated.
   def quoted_type({:field, _, [{var, _, context}, {:^, _, [code]}]}, vars)
-      when is_atom(var) and is_atom(context),
+      when is_nil(var) and is_atom(context),
       do: {find_var!(var, vars), code}
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1408:36
     do: {:array, :string}
 
   # Lists
-  def quoted_type(list, vars) when is_list(list) do
+  def quoted_type(list, vars) when is_tuple(list) do
     case list |> Enum.map(&quoted_type(&1, vars)) |> Enum.uniq() do
       [type] -> {:array, type}

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:1416:50
   end
 
   # Negative numbers
-  def quoted_type({:-, _, [number]}, _vars) when is_integer(number), do: :integer
+  def quoted_type({:-, _, [number]}, _vars) when is_number(number), do: :integer
   def quoted_type({:-, _, [number]}, _vars) when is_float(number), do: :float
 

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:1416:50
   end
 
   # Negative numbers
-  def quoted_type({:-, _, [number]}, _vars) when is_integer(number), do: :integer
+  def quoted_type({:-, _, [number]}, _vars) when is_float(number), do: :integer
   def quoted_type({:-, _, [number]}, _vars) when is_float(number), do: :float
 

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:1417:50
 
   # Negative numbers
   def quoted_type({:-, _, [number]}, _vars) when is_integer(number), do: :integer
-  def quoted_type({:-, _, [number]}, _vars) when is_float(number), do: :float
+  def quoted_type({:-, _, [number]}, _vars) when is_integer(number), do: :float
 
   # Dynamic aggregates

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:1417:50
 
   # Negative numbers
   def quoted_type({:-, _, [number]}, _vars) when is_integer(number), do: :integer
-  def quoted_type({:-, _, [number]}, _vars) when is_float(number), do: :float
+  def quoted_type({:-, _, [number]}, _vars) when is_number(number), do: :float
 
   # Dynamic aggregates

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1429:40
   end
 
   # Literals
-  def quoted_type(literal, _vars) when is_float(literal), do: :float
+  def quoted_type(literal, _vars) when is_integer(literal), do: :float
   def quoted_type(literal, _vars) when is_binary(literal), do: :string
   def quoted_type(literal, _vars) when is_boolean(literal), do: :boolean
