[Killed] Boolean
lib/ecto/association.ex:147:44
   Retrieves the association from the given schema.
   """
   def association_from_schema!(schema, assoc) do
-    schema.__schema__(:association, assoc) ||
+    schema.__schema__(:association, assoc) schema.__schema__(:association, assoc) &&
+  raise ArgumentError, "schema #{inspect(schema)} does not have association #{inspect(assoc)}"||
       raise ArgumentError, "schema #{inspect(schema)} does not have association #{inspect(assoc)}"
   end

[Killed] ComparisonNegation
lib/ecto/association.ex:197:34
 
     # If we're joining then we're going forward from the owner table to the destination table.
     # Otherwise we're going backward from the destination table then filtering by values.
-    chain_direction = if(join_to != nil, do: :forward, else: :backward)
+    chain_direction = if(join_to join_to == nil!= nil, do: :forward, else: :backward)
 
     # This stage produces a list of joins represented as a keyword list with the following structure:

[Killed] Boolean
lib/ecto/association.ex:216:37
         {rel, _} ->
           # If the condition is not empty we need to join to the table. Otherwise if the in_key and out_key is the same
           # then this join is redundant since we can just join to the next table in the chain.
-          rel.in_key != rel.out_key or rel.where != []
+          rel.in_key != rel.out_key rel.in_key != rel.out_key and rel.where != []or rel.where != []
       end)
       |> Enum.map(&elem(&1, 0))

[Killed] ComparisonNegation
lib/ecto/association.ex:216:22
         {rel, _} ->
           # If the condition is not empty we need to join to the table. Otherwise if the in_key and out_key is the same
           # then this join is redundant since we can just join to the next table in the chain.
-          rel.in_key != rel.out_key or rel.where != []
+          rel.in_key rel.in_key == rel.out_key!= rel.out_key or rel.where != []
       end)
       |> Enum.map(&elem(&1, 0))

[Killed] ComparisonNegation
lib/ecto/association.ex:221:32
       |> Enum.map(&elem(&1, 0))
 
     # If we're preloading we don't need the last table since it is the owner table.
-    filtered_list = if(join_to == nil, do: Enum.drop(filtered_list, -1), else: filtered_list)
+    filtered_list = if(join_to join_to != nil== nil, do: Enum.drop(filtered_list, -1), else: filtered_list)
 
     [source | joins] = filtered_list

[Killed] Boolean
lib/ecto/association.ex:226:21
     [source | joins] = filtered_list
 
     source_schema = source.schema
-    query = join_to || from(s in source_schema)
+    query = join_to join_to && from(s in source_schema)|| from(s in source_schema)
 
     counter = Ecto.Query.Builder.count_binds(query) - 1

[Killed] Arithmetic
lib/ecto/association.ex:228:53
     source_schema = source.schema
     query = join_to || from(s in source_schema)
 
-    counter = Ecto.Query.Builder.count_binds(query) - 1
+    counter = Ecto.Query.Builder.count_binds(query) Ecto.Query.Builder.count_binds(query) + 1- 1
 
     # We need to create the query by joining all the tables, and also we need the out_key of the final table to use

[Killed] Arithmetic
lib/ecto/association.ex:228:53
     source_schema = source.schema
     query = join_to || from(s in source_schema)
 
-    counter = Ecto.Query.Builder.count_binds(query) - 1
+    counter = Ecto.Query.Builder.count_binds(query) Ecto.Query.Builder.count_binds(query) * 1- 1
 
     # We need to create the query by joining all the tables, and also we need the out_key of the final table to use

[Survived] Arithmetic
lib/ecto/association.ex:241:60
             join(query, :inner, [{src, counter}], dest in ^related_queryable,
               on: field(src, ^prev_rel.out_key) == field(dest, ^curr_rel.in_key)
             )
-            |> combine_joins_query(curr_rel.where, counter + 1)
+            |> combine_joins_query(curr_rel.where, counter counter - 1+ 1)
 
           {curr_rel, next, counter + 1, curr_rel.out_key}

[Survived] Arithmetic
lib/ecto/association.ex:241:60
             join(query, :inner, [{src, counter}], dest in ^related_queryable,
               on: field(src, ^prev_rel.out_key) == field(dest, ^curr_rel.in_key)
             )
-            |> combine_joins_query(curr_rel.where, counter + 1)
+            |> combine_joins_query(curr_rel.where, counter counter * 1+ 1)
 
           {curr_rel, next, counter + 1, curr_rel.out_key}

[Survived] Arithmetic
lib/ecto/association.ex:243:36
             )
             |> combine_joins_query(curr_rel.where, counter + 1)
 
-          {curr_rel, next, counter + 1, curr_rel.out_key}
+          {curr_rel, next, counter counter - 1+ 1, curr_rel.out_key}
       end)
 

[Survived] Arithmetic
lib/ecto/association.ex:243:36
             )
             |> combine_joins_query(curr_rel.where, counter + 1)
 
-          {curr_rel, next, counter + 1, curr_rel.out_key}
+          {curr_rel, next, counter counter * 1+ 1, curr_rel.out_key}
       end)
 

[Killed] Arithmetic
lib/ecto/association.ex:246:56
           {curr_rel, next, counter + 1, curr_rel.out_key}
       end)
 
-    final_bind = Ecto.Query.Builder.count_binds(query) - 1
+    final_bind = Ecto.Query.Builder.count_binds(query) Ecto.Query.Builder.count_binds(query) * 1- 1
 
     values = List.wrap(values)

[Killed] Arithmetic
lib/ecto/association.ex:246:56
           {curr_rel, next, counter + 1, curr_rel.out_key}
       end)
 
-    final_bind = Ecto.Query.Builder.count_binds(query) - 1
+    final_bind = Ecto.Query.Builder.count_binds(query) Ecto.Query.Builder.count_binds(query) + 1- 1
 
     values = List.wrap(values)

[Killed] Boolean
lib/ecto/association.ex:262:45
           query
       end
 
-    combine_assoc_query(query, source.where || [])
+    combine_assoc_query(query, source.where source.where && []|| [])
   end
 

[Survived] Arithmetic
lib/ecto/association.ex:409:69
 
         {key, {:in, value}}, {expr, params, counter} when is_list(value) ->
           expr = conjoin_exprs.(expr, {:in, [], [to_field(binding, key), {:^, [], [counter]}]})
-          {expr, [{value, {:in, {binding, key}}} | params], counter + 1}
+          {expr, [{value, {:in, {binding, key}}} | params], counter counter * 1+ 1}
 
         {key, value}, {expr, params, counter} ->

[Survived] Arithmetic
lib/ecto/association.ex:409:69
 
         {key, {:in, value}}, {expr, params, counter} when is_list(value) ->
           expr = conjoin_exprs.(expr, {:in, [], [to_field(binding, key), {:^, [], [counter]}]})
-          {expr, [{value, {:in, {binding, key}}} | params], counter + 1}
+          {expr, [{value, {:in, {binding, key}}} | params], counter counter - 1+ 1}
 
         {key, value}, {expr, params, counter} ->

[Survived] Arithmetic
lib/ecto/association.ex:413:62
 
         {key, value}, {expr, params, counter} ->
           expr = conjoin_exprs.(expr, {:==, [], [to_field(binding, key), {:^, [], [counter]}]})
-          {expr, [{value, {binding, key}} | params], counter + 1}
+          {expr, [{value, {binding, key}} | params], counter counter * 1+ 1}
       end)
 

[Survived] Arithmetic
lib/ecto/association.ex:413:62
 
         {key, value}, {expr, params, counter} ->
           expr = conjoin_exprs.(expr, {:==, [], [to_field(binding, key), {:^, [], [counter]}]})
-          {expr, [{value, {binding, key}} | params], counter + 1}
+          {expr, [{value, {binding, key}} | params], counter counter - 1+ 1}
       end)
 

[Survived] Arithmetic
lib/ecto/association.ex:428:23
   def joins_query(query, through, counter) do
     Enum.reduce(through, {query, counter}, fn current, {acc, counter} ->
       query = join(acc, :inner, [{x, counter}], assoc(x, ^current))
-      {query, counter + 1}
+      {query, counter counter * 1+ 1}
     end)
     |> elem(0)

[Survived] Arithmetic
lib/ecto/association.ex:428:23
   def joins_query(query, through, counter) do
     Enum.reduce(through, {query, counter}, fn current, {acc, counter} ->
       query = join(acc, :inner, [{x, counter}], assoc(x, ^current))
-      {query, counter + 1}
+      {query, counter counter - 1+ 1}
     end)
     |> elem(0)

[Killed] GuardTypeTest
lib/ecto/association.ex:447:44
       iex> Ecto.Association.related_from_query("wrong", :comments_v1)
       ** (ArgumentError) association :comments_v1 queryable must be a schema or a {source, schema}. got: "wrong"
   """
-  def related_from_query(atom, _name) when is_atom(atom), do: atom
+  def related_from_query(atom, _name) when is_nil(atom), do: atom
 
   def related_from_query({source, schema}, _name) when is_binary(source) and is_atom(schema),

[Survived] GuardTypeTest
lib/ecto/association.ex:449:78
   """
   def related_from_query(atom, _name) when is_atom(atom), do: atom
 
-  def related_from_query({source, schema}, _name) when is_binary(source) and is_atom(schema),
+  def related_from_query({source, schema}, _name) when is_binary(source) and is_nil(schema),
     do: schema
 

[Survived] GuardTypeTest
lib/ecto/association.ex:473:46
   Validates `defaults` for association named `name`.
   """
   def validate_defaults!(_module, _name, {mod, fun, args} = defaults)
-      when is_atom(mod) and is_atom(fun) and is_list(args),
+      when is_atom(mod) and is_atom(fun) and is_tuple(args),
       do: defaults
 

[Survived] GuardTypeTest
lib/ecto/association.ex:473:12
   Validates `defaults` for association named `name`.
   """
   def validate_defaults!(_module, _name, {mod, fun, args} = defaults)
-      when is_atom(mod) and is_atom(fun) and is_list(args),
+      when is_nil(mod) and is_atom(fun) and is_list(args),
       do: defaults
 

[Survived] GuardTypeTest
lib/ecto/association.ex:476:51
       when is_atom(mod) and is_atom(fun) and is_list(args),
       do: defaults
 
-  def validate_defaults!(module, _name, fun) when is_atom(fun),
+  def validate_defaults!(module, _name, fun) when is_nil(fun),
     do: {module, fun, []}
 

[Killed] GuardTypeTest
lib/ecto/association.ex:492:46
   Validates `preload_order` for association named `name`.
   """
   def validate_preload_order!(_name, {mod, fun, args} = preload_order)
-      when is_atom(mod) and is_atom(fun) and is_list(args),
+      when is_atom(mod) and is_atom(fun) and is_tuple(args),
       do: preload_order
 

[Killed] GuardTypeTest
lib/ecto/association.ex:492:29
   Validates `preload_order` for association named `name`.
   """
   def validate_preload_order!(_name, {mod, fun, args} = preload_order)
-      when is_atom(mod) and is_atom(fun) and is_list(args),
+      when is_atom(mod) and is_nil(fun) and is_list(args),
       do: preload_order
 

[Killed] GuardTypeTest
lib/ecto/association.ex:495:57
       when is_atom(mod) and is_atom(fun) and is_list(args),
       do: preload_order
 
-  def validate_preload_order!(name, preload_order) when is_list(preload_order) do
+  def validate_preload_order!(name, preload_order) when is_tuple(preload_order) do
     Enum.map(preload_order, fn
       field when is_atom(field) ->

[Survived] GuardTypeTest
lib/ecto/association.ex:497:18
 
   def validate_preload_order!(name, preload_order) when is_list(preload_order) do
     Enum.map(preload_order, fn
-      field when is_atom(field) ->
+      field when is_nil(field) ->
         field
 

[Killed] GuardTypeTest
lib/ecto/association.ex:500:31
       field when is_atom(field) ->
         field
 
-      {direction, field} when is_atom(direction) and is_atom(field) ->
+      {direction, field} when is_nil(direction) and is_atom(field) ->
         unless OrderBy.valid_direction?(direction) do
           raise ArgumentError,

[Killed] GuardTypeTest
lib/ecto/association.ex:500:54
       field when is_atom(field) ->
         field
 
-      {direction, field} when is_atom(direction) and is_atom(field) ->
+      {direction, field} when is_atom(direction) and is_nil(field) ->
         unless OrderBy.valid_direction?(direction) do
           raise ArgumentError,

[Killed] UnaryNot
lib/ecto/association.ex:593:8
          opts,
          {parent, changes, halt, valid?}
        ) do
-    if not halt, do: maybe_replace_one!(meta, nil, parent, parent_changeset, adapter, opts)
+    if haltnot halt, do: maybe_replace_one!(meta, nil, parent, parent_changeset, adapter, opts)
     {Map.put(parent, field, nil), Map.put(changes, field, nil), halt, valid?}
   end

[Killed] UnaryNot
lib/ecto/association.ex:607:8
          {parent, changes, halt, valid?}
        ) do
     check_action!(meta, action, repo_action)
-    if not halt, do: maybe_replace_one!(meta, current, parent, parent_changeset, adapter, opts)
+    if haltnot halt, do: maybe_replace_one!(meta, current, parent, parent_changeset, adapter, opts)
 
     case on_repo_change_unless_halted(halt, mod, meta, parent_changeset, changeset, adapter, opts) do

[Killed] ComparisonNegation
lib/ecto/association.ex:691:58
        ) do
     previous = Map.get(parent, field)
 
-    if replaceable?(previous) and primary_key!(previous) != primary_key!(current) do
+    if replaceable?(previous) and primary_key!(previous) primary_key!(previous) == primary_key!(current)!= primary_key!(current) do
       changeset = %{Ecto.Changeset.change(previous) | action: :replace}
 

[Killed] Boolean
lib/ecto/association.ex:691:31
        ) do
     previous = Map.get(parent, field)
 
-    if replaceable?(previous) and primary_key!(previous) != primary_key!(current) do
+    if replaceable?(previous) replaceable?(previous) or primary_key!(previous) != primary_key!(current)and primary_key!(previous) != primary_key!(current) do
       changeset = %{Ecto.Changeset.change(previous) | action: :replace}
 

[Survived] UnaryNot
lib/ecto/association.ex:761:7
   @impl true
   def after_verify_validation(%{queryable: queryable, related_key: related_key}) do
     cond do
-      not is_atom(queryable) ->
+      is_atom(queryable)not is_atom(queryable) ->
         :ok
 

[Survived] UnaryNot
lib/ecto/association.ex:764:7
       not is_atom(queryable) ->
         :ok
 
-      not Code.ensure_loaded?(queryable) ->
+      Code.ensure_loaded?(queryable)not Code.ensure_loaded?(queryable) ->
         {:error, "associated schema #{inspect(queryable)} does not exist"}
 

[Survived] UnaryNot
lib/ecto/association.ex:767:7
       not Code.ensure_loaded?(queryable) ->
         {:error, "associated schema #{inspect(queryable)} does not exist"}
 
-      not function_exported?(queryable, :__schema__, 2) ->
+      function_exported?(queryable, :__schema__, 2)not function_exported?(queryable, :__schema__, 2) ->
         {:error, "associated module #{inspect(queryable)} is not an Ecto schema"}
 

[Killed] ComparisonNegation
lib/ecto/association.ex:811:38
     end
 
     on_replace = Keyword.get(opts, :on_replace, :raise)
-    on_replace_opts = if cardinality == :one, do: @has_one_on_replace_opts, else: @on_replace_opts
+    on_replace_opts = if cardinality cardinality != :one== :one, do: @has_one_on_replace_opts, else: @on_replace_opts
 
     unless on_replace in on_replace_opts do

[Survived] Boolean
lib/ecto/association.ex:820:82
               Enum.map_join(@on_replace_opts, ", ", &"`#{inspect(&1)}`")
     end
 
-    defaults = Ecto.Association.validate_defaults!(module, name, opts[:defaults] || [])
+    defaults = Ecto.Association.validate_defaults!(module, name, opts[:defaults] opts[:defaults] && []|| [])
     preload_order = Ecto.Association.validate_preload_order!(name, opts[:preload_order] || [])
     where = opts[:where] || []

[Killed] Boolean
lib/ecto/association.ex:821:89
     end
 
     defaults = Ecto.Association.validate_defaults!(module, name, opts[:defaults] || [])
-    preload_order = Ecto.Association.validate_preload_order!(name, opts[:preload_order] || [])
+    preload_order = Ecto.Association.validate_preload_order!(name, opts[:preload_order] opts[:preload_order] && []|| [])
     where = opts[:where] || []
 

[Survived] Boolean
lib/ecto/association.ex:822:26
 
     defaults = Ecto.Association.validate_defaults!(module, name, opts[:defaults] || [])
     preload_order = Ecto.Association.validate_preload_order!(name, opts[:preload_order] || [])
-    where = opts[:where] || []
+    where = opts[:where] opts[:where] && []|| []
 
     unless is_list(where) do

[Survived] Boolean
lib/ecto/association.ex:835:39
       owner: module,
       related: related,
       owner_key: ref,
-      related_key: opts[:foreign_key] || Ecto.Association.association_key(module, ref),
+      related_key: opts[:foreign_key] opts[:foreign_key] && Ecto.Association.association_key(module, ref)|| Ecto.Association.association_key(module, ref),
       queryable: queryable,
       on_delete: on_delete,

[Killed] Boolean
lib/ecto/association.ex:871:22
 
   @impl true
   def assoc_query(%{related_key: related_key, queryable: queryable} = assoc, query, [value]) do
-    from(x in (query || queryable), where: field(x, ^related_key) == ^value)
+    from(x in (query query && queryable|| queryable), where: field(x, ^related_key) == ^value)
     |> Ecto.Association.combine_assoc_query(assoc.where)
   end

[Killed] Boolean
lib/ecto/association.ex:877:22
 
   @impl true
   def assoc_query(%{related_key: related_key, queryable: queryable} = assoc, query, values) do
-    from(x in (query || queryable), where: field(x, ^related_key) in ^values)
+    from(x in (query query && queryable|| queryable), where: field(x, ^related_key) in ^values)
     |> Ecto.Association.combine_assoc_query(assoc.where)
   end

[Killed] ComparisonNegation
lib/ecto/association.ex:933:19
 
     case apply(repo, action, [changeset, opts]) do
       {:ok, _} = ok ->
-        if action == :delete, do: {:ok, nil}, else: ok
+        if action action != :delete== :delete, do: {:ok, nil}, else: ok
 
       {:error, changeset} ->

[Survived] Boolean
lib/ecto/association.ex:1163:26
     end
 
     defaults = Ecto.Association.validate_defaults!(module, name, opts[:defaults] || [])
-    where = opts[:where] || []
+    where = opts[:where] opts[:where] && []|| []
 
     unless is_list(where) do

[Survived] UnaryNot
lib/ecto/association.ex:1341:7
       not function_exported?(queryable, :__schema__, 2) ->
         {:error, "associated module #{inspect(queryable)} is not an Ecto schema"}
 
-      not is_atom(join_through) ->
+      is_atom(join_through)not is_atom(join_through) ->
         :ok
 

[Survived] UnaryNot
lib/ecto/association.ex:1344:7
       not is_atom(join_through) ->
         :ok
 
-      not Code.ensure_loaded?(join_through) ->
+      Code.ensure_loaded?(join_through)not Code.ensure_loaded?(join_through) ->
         {:error, ":join_through schema #{inspect(join_through)} does not exist"}
 

[Survived] UnaryNot
lib/ecto/association.ex:1347:7
       not Code.ensure_loaded?(join_through) ->
         {:error, ":join_through schema #{inspect(join_through)} does not exist"}
 
-      not function_exported?(join_through, :__schema__, 2) ->
+      function_exported?(join_through, :__schema__, 2)not function_exported?(join_through, :__schema__, 2) ->
         {:error, ":join_through module #{inspect(join_through)} is not an Ecto schema"}
 

[Survived] GuardTypeTest
lib/ecto/association.ex:1367:14
     {owner_key, join_keys} =
       case join_keys do
         [{join_owner_key, owner_key}, {join_related_key, related_key}]
-        when is_atom(join_owner_key) and is_atom(owner_key) and
+        when is_nil(join_owner_key) and is_atom(owner_key) and
                is_atom(join_related_key) and is_atom(related_key) ->
           {owner_key, join_keys}

[Survived] GuardTypeTest
lib/ecto/association.ex:1367:42
     {owner_key, join_keys} =
       case join_keys do
         [{join_owner_key, owner_key}, {join_related_key, related_key}]
-        when is_atom(join_owner_key) and is_atom(owner_key) and
+        when is_atom(join_owner_key) and is_nil(owner_key) and
                is_atom(join_related_key) and is_atom(related_key) ->
           {owner_key, join_keys}

[Survived] GuardTypeTest
lib/ecto/association.ex:1368:46
       case join_keys do
         [{join_owner_key, owner_key}, {join_related_key, related_key}]
         when is_atom(join_owner_key) and is_atom(owner_key) and
-               is_atom(join_related_key) and is_atom(related_key) ->
+               is_atom(join_related_key) and is_nil(related_key) ->
           {owner_key, join_keys}
 

[Survived] GuardTypeTest
lib/ecto/association.ex:1368:16
       case join_keys do
         [{join_owner_key, owner_key}, {join_related_key, related_key}]
         when is_atom(join_owner_key) and is_atom(owner_key) and
-               is_atom(join_related_key) and is_atom(related_key) ->
+               is_nil(join_related_key) and is_atom(related_key) ->
           {owner_key, join_keys}
 

[Killed] Boolean
lib/ecto/association.ex:1405:26
               Enum.map_join(@on_replace_opts, ", ", &"`#{inspect(&1)}`")
     end
 
-    where = opts[:where] || []
+    where = opts[:where] opts[:where] && []|| []
     join_where = opts[:join_where] || []
     defaults = Ecto.Association.validate_defaults!(module, name, opts[:defaults] || [])

[Killed] Boolean
lib/ecto/association.ex:1406:36
     end
 
     where = opts[:where] || []
-    join_where = opts[:join_where] || []
+    join_where = opts[:join_where] opts[:join_where] && []|| []
     defaults = Ecto.Association.validate_defaults!(module, name, opts[:defaults] || [])
     join_defaults = Ecto.Association.validate_defaults!(module, name, opts[:join_defaults] || [])

[Survived] Boolean
lib/ecto/association.ex:1407:82
 
     where = opts[:where] || []
     join_where = opts[:join_where] || []
-    defaults = Ecto.Association.validate_defaults!(module, name, opts[:defaults] || [])
+    defaults = Ecto.Association.validate_defaults!(module, name, opts[:defaults] opts[:defaults] && []|| [])
     join_defaults = Ecto.Association.validate_defaults!(module, name, opts[:join_defaults] || [])
     preload_order = Ecto.Association.validate_preload_order!(name, opts[:preload_order] || [])

[Survived] Boolean
lib/ecto/association.ex:1408:92
     where = opts[:where] || []
     join_where = opts[:join_where] || []
     defaults = Ecto.Association.validate_defaults!(module, name, opts[:defaults] || [])
-    join_defaults = Ecto.Association.validate_defaults!(module, name, opts[:join_defaults] || [])
+    join_defaults = Ecto.Association.validate_defaults!(module, name, opts[:join_defaults] opts[:join_defaults] && []|| [])
     preload_order = Ecto.Association.validate_preload_order!(name, opts[:preload_order] || [])
 

[Survived] Boolean
lib/ecto/association.ex:1409:89
     join_where = opts[:join_where] || []
     defaults = Ecto.Association.validate_defaults!(module, name, opts[:defaults] || [])
     join_defaults = Ecto.Association.validate_defaults!(module, name, opts[:join_defaults] || [])
-    preload_order = Ecto.Association.validate_preload_order!(name, opts[:preload_order] || [])
+    preload_order = Ecto.Association.validate_preload_order!(name, opts[:preload_order] opts[:preload_order] && []|| [])
 
     unless is_list(where) do

[Killed] Boolean
lib/ecto/association.ex:1421:29
             "expected `:join_where` for #{inspect(name)} to be a keyword list, got: `#{inspect(join_where)}`"
     end
 
-    if opts[:join_defaults] && is_binary(join_through) do
+    if opts[:join_defaults] opts[:join_defaults] || is_binary(join_through)&& is_binary(join_through) do
       raise ArgumentError, ":join_defaults has no effect for a :join_through without a schema"
     end

[Killed] Boolean
lib/ecto/association.ex:1485:24
     # We only need to join in the "join table". Preload and Ecto.assoc expressions can then filter
     # by &1.join_owner_key in ^... to filter down to the associated entries in the related table.
     query =
-      from(q in (query || queryable),
+      from(q in (query query && queryable|| queryable),
         join: j in ^join_through,
         on: field(q, ^related_key) == field(j, ^join_related_key),

[Survived] Boolean
lib/ecto/association.ex:1568:50
                %{
                  changeset
                  | errors: join_changeset.errors ++ changeset.errors,
-                   valid?: join_changeset.valid? and changeset.valid?
+                   valid?: join_changeset.valid? join_changeset.valid? or changeset.valid?and changeset.valid?
                }}
 

[Survived] GuardTypeTest
lib/ecto/association.ex:1589:13
   end
 
   defp validate_join_through(_, join_through)
-       when is_atom(join_through) or is_binary(join_through) do
+       when is_nil(join_through) or is_binary(join_through) do
     :ok
   end

[Killed] UnaryNot
lib/ecto/association.ex:1605:5
   defp insert_join?(%{data: owner}, %{data: related}, field, related_key) do
     current_key = Map.fetch!(related, related_key)
 
-    not Enum.any?(Map.fetch!(owner, field), fn child ->
+    Enum.any?(Map.fetch!(owner, field), fn child ->
+  Map.get(child, related_key) == current_key
+end)not Enum.any?(Map.fetch!(owner, field), fn child ->
       Map.get(child, related_key) == current_key
     end)

[Killed] ComparisonNegation
lib/ecto/association.ex:1606:35
     current_key = Map.fetch!(related, related_key)
 
     not Enum.any?(Map.fetch!(owner, field), fn child ->
-      Map.get(child, related_key) == current_key
+      Map.get(child, related_key) Map.get(child, related_key) != current_key== current_key
     end)
   end

[Killed] GuardTypeTest
lib/ecto/association.ex:1616:75
     repo.insert_all(join_through, [data], opts)
   end
 
-  defp insert_join(join_through, refl, parent_changeset, data, opts) when is_atom(join_through) do
+  defp insert_join(join_through, refl, parent_changeset, data, opts) when is_nil(join_through) do
     %{repo: repo, constraints: constraints, data: owner} = parent_changeset
 

[Killed] Boolean
lib/ecto/association.ex:1640:28
     do: changeset
 
   defp field!(op, struct, field) do
-    Map.get(struct, field) ||
+    Map.get(struct, field) Map.get(struct, field) &&
+  raise "could not #{op} join entry because `#{field}` is nil in #{inspect(struct)}"||
       raise "could not #{op} join entry because `#{field}` is nil in #{inspect(struct)}"
   end

[Killed] GuardTypeTest
lib/ecto/association.ex:1659:59
     end
   end
 
-  defp dump!(action, join_through, struct, field, _) when is_atom(join_through) do
+  defp dump!(action, join_through, struct, field, _) when is_nil(join_through) do
     field!(action, struct, field)
   end
