[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1429:40
   end
 
   # Literals
-  def quoted_type(literal, _vars) when is_float(literal), do: :float
+  def quoted_type(literal, _vars) when is_number(literal), do: :float
   def quoted_type(literal, _vars) when is_binary(literal), do: :string
   def quoted_type(literal, _vars) when is_boolean(literal), do: :boolean

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1432:65
   def quoted_type(literal, _vars) when is_float(literal), do: :float
   def quoted_type(literal, _vars) when is_binary(literal), do: :string
   def quoted_type(literal, _vars) when is_boolean(literal), do: :boolean
-  def quoted_type(literal, _vars) when is_atom(literal) and not is_nil(literal), do: :atom
+  def quoted_type(literal, _vars) when is_atom(literal) and not is_atom(literal), do: :atom
   def quoted_type(literal, _vars) when is_integer(literal), do: :integer
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1432:40
   def quoted_type(literal, _vars) when is_float(literal), do: :float
   def quoted_type(literal, _vars) when is_binary(literal), do: :string
   def quoted_type(literal, _vars) when is_boolean(literal), do: :boolean
-  def quoted_type(literal, _vars) when is_atom(literal) and not is_nil(literal), do: :atom
+  def quoted_type(literal, _vars) when is_nil(literal) and not is_nil(literal), do: :atom
   def quoted_type(literal, _vars) when is_integer(literal), do: :integer
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1433:40
   def quoted_type(literal, _vars) when is_binary(literal), do: :string
   def quoted_type(literal, _vars) when is_boolean(literal), do: :boolean
   def quoted_type(literal, _vars) when is_atom(literal) and not is_nil(literal), do: :atom
-  def quoted_type(literal, _vars) when is_integer(literal), do: :integer
+  def quoted_type(literal, _vars) when is_float(literal), do: :integer
 
   # Tuples

[Survived] GuardTypeTest
lib/ecto/query/builder.ex:1433:40
   def quoted_type(literal, _vars) when is_binary(literal), do: :string
   def quoted_type(literal, _vars) when is_boolean(literal), do: :boolean
   def quoted_type(literal, _vars) when is_atom(literal) and not is_nil(literal), do: :atom
-  def quoted_type(literal, _vars) when is_integer(literal), do: :integer
+  def quoted_type(literal, _vars) when is_number(literal), do: :integer
 
   # Tuples

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1439:66
   def quoted_type({left, right}, vars), do: quoted_type({:{}, [], [left, right]}, vars)
   def quoted_type({:{}, _, elems}, vars), do: {:tuple, Enum.map(elems, &quoted_type(&1, vars))}
 
-  def quoted_type({name, _, args}, _vars) when is_atom(name) and is_list(args) do
+  def quoted_type({name, _, args}, _vars) when is_atom(name) and is_tuple(args) do
     case call_type(name, length(args)) do
       {_in, out} -> out

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1439:48
   def quoted_type({left, right}, vars), do: quoted_type({:{}, [], [left, right]}, vars)
   def quoted_type({:{}, _, elems}, vars), do: {:tuple, Enum.map(elems, &quoted_type(&1, vars))}
 
-  def quoted_type({name, _, args}, _vars) when is_atom(name) and is_list(args) do
+  def quoted_type({name, _, args}, _vars) when is_nil(name) and is_list(args) do
     case call_type(name, length(args)) do
       {_in, out} -> out

[Killed] Arithmetic
lib/ecto/query/builder.ex:1483:7
   """
   @spec count_binds(Ecto.Query.t()) :: non_neg_integer
   def count_binds(%Query{joins: joins}) do
-    1 + length(joins)
+    1 1 * length(joins)+ length(joins)
   end
 

[Killed] Arithmetic
lib/ecto/query/builder.ex:1483:7
   """
   @spec count_binds(Ecto.Query.t()) :: non_neg_integer
   def count_binds(%Query{joins: joins}) do
-    1 + length(joins)
+    1 1 - length(joins)+ length(joins)
   end
 

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1495:34
     len = length(params)
 
     Macro.prewalk(expr, fn
-      {:^, meta, [counter]} when is_integer(counter) -> {:^, meta, [len + counter]}
+      {:^, meta, [counter]} when is_float(counter) -> {:^, meta, [len + counter]}
       other -> other
     end)

[Killed] Arithmetic
lib/ecto/query/builder.ex:1495:73
     len = length(params)
 
     Macro.prewalk(expr, fn
-      {:^, meta, [counter]} when is_integer(counter) -> {:^, meta, [len + counter]}
+      {:^, meta, [counter]} when is_integer(counter) -> {:^, meta, [len len * counter+ counter]}
       other -> other
     end)

[Killed] Arithmetic
lib/ecto/query/builder.ex:1509:47
     len = length(subqueries)
 
     Macro.prewalk(expr, fn
-      {:subquery, counter} -> {:subquery, len + counter}
+      {:subquery, counter} -> {:subquery, len len * counter+ counter}
       other -> other
     end)

[Survived] Arithmetic
lib/ecto/query/builder.ex:1509:47
     len = length(subqueries)
 
     Macro.prewalk(expr, fn
-      {:subquery, counter} -> {:subquery, len + counter}
+      {:subquery, counter} -> {:subquery, len len - counter+ counter}
       other -> other
     end)

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1517:64
   @doc """
   Called by the select escaper at compile time and dynamic builder at runtime to track select aliases
   """
-  def add_select_alias(aliases, name) when is_map(aliases) and is_atom(name) do
+  def add_select_alias(aliases, name) when is_map(aliases) and is_nil(name) do
     case aliases do
       %{^name => _} ->

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1517:44
   @doc """
   Called by the select escaper at compile time and dynamic builder at runtime to track select aliases
   """
-  def add_select_alias(aliases, name) when is_map(aliases) and is_atom(name) do
+  def add_select_alias(aliases, name) when is_list(aliases) and is_atom(name) do
     case aliases do
       %{^name => _} ->

[Killed] ComparisonNegation
lib/ecto/query/builder.ex:1603:43
   end
 
   defp unescape_query({:%{}, _, list} = ast) do
-    if List.keyfind(list, :__struct__, 0) == {:__struct__, Query} do
+    if List.keyfind(list, :__struct__, 0) List.keyfind(list, :__struct__, 0) != {:__struct__, Query}== {:__struct__, Query} do
       Map.new(list)
     else

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1623:30
   end
 
   defp parse_access_get({{:., _, [{var, _, context}, field]}, _, []} = expr, acc)
-       when is_atom(var) and is_atom(context) and is_atom(field) do
+       when is_atom(var) and is_nil(context) and is_atom(field) do
     {expr, acc}
   end

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1623:51
   end
 
   defp parse_access_get({{:., _, [{var, _, context}, field]}, _, []} = expr, acc)
-       when is_atom(var) and is_atom(context) and is_atom(field) do
+       when is_atom(var) and is_atom(context) and is_nil(field) do
     {expr, acc}
   end

[Killed] GuardTypeTest
lib/ecto/query/builder.ex:1628:43
   end
 
   defp parse_access_get({{:., _, [{kind, _, [_]}, field]}, _, []} = expr, acc)
-       when kind in [:as, :parent_as] and is_atom(field) do
+       when kind in [:as, :parent_as] and is_nil(field) do
     {expr, acc}
   end
