[Killed] GuardTypeTest
lib/ecto/changeset.ex:515:43
   @spec change(Ecto.Schema.t() | t | {data, types}, %{atom => term} | Keyword.t()) :: t
   def change(data, changes \\ %{})
 
-  def change({data, types}, changes) when is_map(data) do
+  def change({data, types}, changes) when is_list(data) do
     change(%Changeset{data: data, types: Enum.into(types, %{}), valid?: true}, changes)
   end

[Killed] GuardTypeTest
lib/ecto/changeset.ex:520:35
   end
 
   def change(%Changeset{changes: changes, types: types} = changeset, new_changes)
-      when is_map(new_changes) or is_list(new_changes) do
+      when is_map(new_changes) or is_tuple(new_changes) do
     {changes, errors, valid?} =
       get_changed(changeset.data, types, changes, new_changes, changeset.errors, changeset.valid?)

[Killed] GuardTypeTest
lib/ecto/changeset.ex:520:12
   end
 
   def change(%Changeset{changes: changes, types: types} = changeset, new_changes)
-      when is_map(new_changes) or is_list(new_changes) do
+      when is_list(new_changes) or is_list(new_changes) do
     {changes, errors, valid?} =
       get_changed(changeset.data, types, changes, new_changes, changeset.errors, changeset.valid?)

[Killed] GuardTypeTest
lib/ecto/changeset.ex:527:58
     %{changeset | changes: changes, errors: errors, valid?: valid?}
   end
 
-  def change(%{__struct__: struct} = data, changes) when is_map(changes) or is_list(changes) do
+  def change(%{__struct__: struct} = data, changes) when is_list(changes) or is_list(changes) do
     types = struct.__changeset__()
     {changes, errors, valid?} = get_changed(data, types, %{}, changes, [], true)

[Killed] GuardTypeTest
lib/ecto/changeset.ex:527:77
     %{changeset | changes: changes, errors: errors, valid?: valid?}
   end
 
-  def change(%{__struct__: struct} = data, changes) when is_map(changes) or is_list(changes) do
+  def change(%{__struct__: struct} = data, changes) when is_map(changes) or is_tuple(changes) do
     types = struct.__changeset__()
     {changes, errors, valid?} = get_changed(data, types, %{}, changes, [], true)

[Killed] GuardTypeTest
lib/ecto/changeset.ex:571:66
       false
   """
   @spec changed?(t, atom, Keyword.t()) :: boolean
-  def changed?(%Changeset{} = changeset, field, opts \\ []) when is_atom(field) do
+  def changed?(%Changeset{} = changeset, field, opts \\ []) when is_nil(field) do
     case Map.fetch(changeset.types, field) do
       {:ok, type} ->

[Killed] ComparisonNegation
lib/ecto/changeset.ex:578:25
           {:ok, new_value} ->
             case type do
               {tag, relation} when tag in @relations ->
-                if opts != [] do
+                if opts opts == []!= [] do
                   raise ArgumentError, "invalid options for #{tag} field"
                 end

[Killed] Boolean
lib/ecto/changeset.ex:607:33
   end
 
   defp relation_changed?(:one, changeset) do
-    changeset.action != :update or changeset.changes != %{}
+    changeset.action != :update changeset.action != :update and changeset.changes != %{}or changeset.changes != %{}
   end
 

[Killed] ComparisonNegation
lib/ecto/changeset.ex:607:22
   end
 
   defp relation_changed?(:one, changeset) do
-    changeset.action != :update or changeset.changes != %{}
+    changeset.action changeset.action == :update!= :update or changeset.changes != %{}
   end
 

[Killed] GuardTypeTest
lib/ecto/changeset.ex:773:57
       message: "expected params to be a :map, got: `#{inspect(params)}`"
   end
 
-  def cast({data, types}, params, permitted, opts) when is_map(data) do
+  def cast({data, types}, params, permitted, opts) when is_list(data) do
     cast(data, types, %{}, params, permitted, opts)
   end

[Survived] ComparisonNegation
lib/ecto/changeset.ex:785:22
         opts[:empty_values] ->
           opts
 
-        empty_values != empty_values() ->
+        empty_values empty_values == empty_values()!= empty_values() ->
           # TODO: Remove changeset.empty_values field in Ecto v3.14
           IO.warn(

[Killed] GuardTypeTest
lib/ecto/changeset.ex:807:13
   end
 
   defp cast(%{} = data, %{} = types, %{} = changes, :invalid, permitted, _opts)
-       when is_list(permitted) do
+       when is_tuple(permitted) do
     _ = Enum.each(permitted, &cast_key/1)
     %Changeset{params: nil, data: data, valid?: false, errors: [], changes: changes, types: types}

[Killed] GuardTypeTest
lib/ecto/changeset.ex:813:13
   end
 
   defp cast(%{} = data, %{} = types, %{} = changes, %{} = params, permitted, opts)
-       when is_list(permitted) do
+       when is_tuple(permitted) do
     empty_values = Keyword.get(opts, :empty_values, @empty_values)
     force? = Keyword.get(opts, :force_changes, false)

[Killed] GuardTypeTest
lib/ecto/changeset.ex:847:59
     }
   end
 
-  defp cast(%{}, %{}, %{}, params, permitted, _opts) when is_list(permitted) do
+  defp cast(%{}, %{}, %{}, params, permitted, _opts) when is_tuple(permitted) do
     raise Ecto.CastError,
       type: :map,

[Killed] GuardTypeTest
lib/ecto/changeset.ex:915:27
     end
   end
 
-  defp cast_key(key) when is_atom(key),
+  defp cast_key(key) when is_nil(key),
     do: {key, Atom.to_string(key)}
 

[Killed] Boolean
lib/ecto/changeset.ex:929:27
 
         case Ecto.Type.cast(type, value) do
           {:ok, value} ->
-            if not force? and Ecto.Type.equal?(type, current, value) do
+            if not force? not force? or Ecto.Type.equal?(type, current, value)and Ecto.Type.equal?(type, current, value) do
               :missing
             else

[Killed] UnaryNot
lib/ecto/changeset.ex:929:16
 
         case Ecto.Type.cast(type, value) do
           {:ok, value} ->
-            if not force? and Ecto.Type.equal?(type, current, value) do
+            if force?not force? and Ecto.Type.equal?(type, current, value) do
               :missing
             else

[Killed] GuardTypeTest
lib/ecto/changeset.ex:938:40
           :error ->
             {:invalid, []}
 
-          {:error, custom_errors} when is_list(custom_errors) ->
+          {:error, custom_errors} when is_tuple(custom_errors) ->
             {:invalid, custom_errors}
         end

[Killed] GuardTypeTest
lib/ecto/changeset.ex:954:70
     end
   end
 
-  defp filter_empty_values({:array, type}, value, empty_values) when is_list(value) do
+  defp filter_empty_values({:array, type}, value, empty_values) when is_tuple(value) do
     value =
       for elem <- value,

[Killed] GuardTypeTest
lib/ecto/changeset.ex:1000:24
   # anyway, and it is not a guarantee.
   defp convert_params(params) do
     case :maps.next(:maps.iterator(params)) do
-      {key, _, _} when is_atom(key) ->
+      {key, _, _} when is_nil(key) ->
         for {key, value} <- params, into: %{} do
           if is_atom(key) do

[Killed] GuardTypeTest
lib/ecto/changeset.ex:1246:52
 
   """
   @spec cast_assoc(t, atom, Keyword.t()) :: t
-  def cast_assoc(changeset, name, opts \\ []) when is_atom(name) do
+  def cast_assoc(changeset, name, opts \\ []) when is_nil(name) do
     cast_relation(:assoc, changeset, name, opts)
   end

[Killed] GuardTypeTest
lib/ecto/changeset.ex:1294:52
 
   """
   @spec cast_embed(t, atom, Keyword.t()) :: t
-  def cast_embed(changeset, name, opts \\ []) when is_atom(name) do
+  def cast_embed(changeset, name, opts \\ []) when is_nil(name) do
     cast_relation(:embed, changeset, name, opts)
   end

[Killed] GuardComparisonNegation
lib/ecto/changeset.ex:1299:28
   end
 
   defp cast_relation(type, %Changeset{data: data, types: types}, _name, _opts)
-       when data == nil or types == nil do
+       when data == nil or types != nil do
     raise ArgumentError,
           "cast_#{type}/3 expects the changeset to be cast. " <>

[Killed] GuardComparisonNegation
lib/ecto/changeset.ex:1299:13
   end
 
   defp cast_relation(type, %Changeset{data: data, types: types}, _name, _opts)
-       when data == nil or types == nil do
+       when data != nil or types == nil do
     raise ArgumentError,
           "cast_#{type}/3 expects the changeset to be cast. " <>

[Killed] Boolean
lib/ecto/changeset.ex:1309:21
     {key, param_key} = cast_key(key)
     %{data: data, types: types, params: params, changes: changes} = changeset
     %{related: related} = relation = relation!(:cast, type, key, Map.get(types, key))
-    params = params || %{}
+    params = params params && %{}|| %{}
 
     {changeset, required?} =

[Killed] Boolean
lib/ecto/changeset.ex:1323:57
     drop = opts_key_from_params(:drop_param, opts, params)
 
     changeset =
-      if is_map_key(params, param_key) or is_list(sort) or is_list(drop) do
+      if is_map_key(params, param_key) or is_list(sort) (is_map_key(params, param_key) or is_list(sort)) and is_list(drop)or is_list(drop) do
         value = Map.get(params, param_key)
         original = Map.get(data, key)

[Killed] Boolean
lib/ecto/changeset.ex:1323:40
     drop = opts_key_from_params(:drop_param, opts, params)
 
     changeset =
-      if is_map_key(params, param_key) or is_list(sort) or is_list(drop) do
+      if is_map_key(params, param_key) is_map_key(params, param_key) and is_list(sort)or is_list(sort) or is_list(drop) do
         value = Map.get(params, param_key)
         original = Map.get(data, key)

[Killed] GuardComparisonNegation
lib/ecto/changeset.ex:1330:47
         value = cast_params(relation, value, sort, drop)
 
         case Relation.cast(relation, data, value, current, on_cast) do
-          {:ok, change, relation_valid?} when change != original ->
+          {:ok, change, relation_valid?} when change == original ->
             valid? = changeset.valid? and relation_valid?
             changes = Map.put(changes, key, change)

[Killed] Boolean
lib/ecto/changeset.ex:1331:39
 
         case Relation.cast(relation, data, value, current, on_cast) do
           {:ok, change, relation_valid?} when change != original ->
-            valid? = changeset.valid? and relation_valid?
+            valid? = changeset.valid? changeset.valid? or relation_valid?and relation_valid?
             changes = Map.put(changes, key, change)
             changeset = %{force_update(changeset, opts) | changes: changes, valid?: valid?}

[Killed] GuardTypeTest
lib/ecto/changeset.ex:1355:13
   end
 
   defp cast_params(%{cardinality: :many} = relation, nil, sort, drop)
-       when is_list(sort) or is_list(drop) do
+       when is_tuple(sort) or is_list(drop) do
     cast_params(relation, %{}, sort, drop)
   end

[Killed] GuardTypeTest
lib/ecto/changeset.ex:1355:30
   end
 
   defp cast_params(%{cardinality: :many} = relation, nil, sort, drop)
-       when is_list(sort) or is_list(drop) do
+       when is_list(sort) or is_tuple(drop) do
     cast_params(relation, %{}, sort, drop)
   end

[Killed] GuardTypeTest
lib/ecto/changeset.ex:1359:67
     cast_params(relation, %{}, sort, drop)
   end
 
-  defp cast_params(%{cardinality: :many}, value, sort, drop) when is_map(value) do
+  defp cast_params(%{cardinality: :many}, value, sort, drop) when is_list(value) do
     drop = if is_list(drop), do: drop, else: []
 

[Killed] GuardComparisonNegation
lib/ecto/changeset.ex:1401:55
 
   # We check for the byte size to avoid creating unnecessary large integers
   # which would never map to a database key (u64 is 20 digits only).
-  defp key_as_int({key, val}) when is_binary(key) and byte_size(key) < 32 do
+  defp key_as_int({key, val}) when is_binary(key) and byte_size(key) >= 32 do
     case Integer.parse(key) do
       {key, ""} -> {key, val}

[Survived] GuardComparisonBoundary
lib/ecto/changeset.ex:1401:55
 
   # We check for the byte size to avoid creating unnecessary large integers
   # which would never map to a database key (u64 is 20 digits only).
-  defp key_as_int({key, val}) when is_binary(key) and byte_size(key) < 32 do
+  defp key_as_int({key, val}) when is_binary(key) and byte_size(key) <= 32 do
     case Integer.parse(key) do
       {key, ""} -> {key, val}

[Survived] GuardComparisonNegation
lib/ecto/changeset.ex:1418:18
         e in UndefinedFunctionError ->
           case __STACKTRACE__ do
             [{^module, :changeset, args_or_arity, _}]
-            when args_or_arity == 2
+            when args_or_arity != 2
             when length(args_or_arity) == 2 ->
               raise ArgumentError, """

[Killed] GuardComparisonNegation
lib/ecto/changeset.ex:1419:18
           case __STACKTRACE__ do
             [{^module, :changeset, args_or_arity, _}]
             when args_or_arity == 2
-            when length(args_or_arity) == 2 ->
+            when length(args_or_arity) != 2 ->
               raise ArgumentError, """
               the module #{inspect(module)} does not define a changeset/2 function,

[Killed] Boolean
lib/ecto/changeset.ex:1443:18
     %{changes: changes, errors: errors} = changeset
     current_changes = Map.get(changes, name, current)
 
-    if required? and Relation.empty?(relation, current_changes) do
+    if required? required? or Relation.empty?(relation, current_changes)and Relation.empty?(relation, current_changes) do
       errors = [
         {name, message(opts, :required_message, "can't be blank", validation: :required)}

[Killed] Boolean
lib/ecto/changeset.ex:1555:45
   end
 
   defp cast_merge(cs1, cs2) do
-    new_params = (cs1.params || cs2.params) && Map.merge(cs1.params || %{}, cs2.params || %{})
+    new_params = (cs1.params || cs2.params) cs1.params || cs2.params || Map.merge(cs1.params || %{}, cs2.params || %{})&& Map.merge(cs1.params || %{}, cs2.params || %{})
     new_types = Map.merge(cs1.types, cs2.types)
     new_changes = Map.merge(cs1.changes, cs2.changes)

[Killed] Boolean
lib/ecto/changeset.ex:1555:30
   end
 
   defp cast_merge(cs1, cs2) do
-    new_params = (cs1.params || cs2.params) && Map.merge(cs1.params || %{}, cs2.params || %{})
+    new_params = (cs1.params cs1.params && cs2.params|| cs2.params) && Map.merge(cs1.params || %{}, cs2.params || %{})
     new_types = Map.merge(cs1.types, cs2.types)
     new_changes = Map.merge(cs1.changes, cs2.changes)

[Killed] Boolean
lib/ecto/changeset.ex:1560:29
     new_changes = Map.merge(cs1.changes, cs2.changes)
     new_errors = Enum.uniq(cs1.errors ++ cs2.errors)
     new_required = Enum.uniq(cs1.required ++ cs2.required)
-    new_valid? = cs1.valid? and cs2.valid?
+    new_valid? = cs1.valid? cs1.valid? or cs2.valid?and cs2.valid?
 
     %{

[Killed] GuardTypeTest
lib/ecto/changeset.ex:1609:12
   """
   @spec fetch_field(t, atom) :: {:changes, term} | {:data, term} | :error
   def fetch_field(%Changeset{changes: changes, data: data, types: types}, key)
-      when is_atom(key) do
+      when is_nil(key) do
     case Map.fetch(changes, key) do
       {:ok, value} ->

[Killed] GuardTypeTest
lib/ecto/changeset.ex:1788:17
 
     case existing do
       nil -> nil
-      list when is_list(list) -> Enum.map(list, &change/1)
+      list when is_tuple(list) -> Enum.map(list, &change/1)
       item -> change(item)
     end

[Killed] GuardTypeTest
lib/ecto/changeset.ex:1809:73
 
   """
   @spec fetch_change(t, atom) :: {:ok, term} | :error
-  def fetch_change(%Changeset{changes: changes} = _changeset, key) when is_atom(key) do
+  def fetch_change(%Changeset{changes: changes} = _changeset, key) when is_nil(key) do
     Map.fetch(changes, key)
   end

[Killed] GuardTypeTest
lib/ecto/changeset.ex:1852:12
   """
   @spec get_change(t, atom, term) :: term
   def get_change(%Changeset{changes: changes} = _changeset, key, default \\ nil)
-      when is_atom(key) do
+      when is_nil(key) do
     Map.get(changes, key, default)
   end

[Killed] GuardTypeTest
lib/ecto/changeset.ex:1875:83
 
   """
   @spec update_change(t, atom, (term -> term)) :: t
-  def update_change(%Changeset{changes: changes} = changeset, key, function) when is_atom(key) do
+  def update_change(%Changeset{changes: changes} = changeset, key, function) when is_nil(key) do
     case Map.fetch(changes, key) do
       {:ok, value} ->

[Killed] GuardComparisonNegation
lib/ecto/changeset.ex:1931:43
     current = Relation.load!(data, original)
 
     case Relation.change(relation, value, current) do
-      {:ok, change, relation_valid?} when change != original ->
+      {:ok, change, relation_valid?} when change == original ->
         {Map.put(changes, key, change), errors, valid? and relation_valid?}
 

[Killed] Boolean
lib/ecto/changeset.ex:1932:56
 
     case Relation.change(relation, value, current) do
       {:ok, change, relation_valid?} when change != original ->
-        {Map.put(changes, key, change), errors, valid? and relation_valid?}
+        {Map.put(changes, key, change), errors, valid? valid? or relation_valid?and relation_valid?}
 
       {:error, error} ->

[Killed] GuardTypeTest
lib/ecto/changeset.ex:1943:76
     end
   end
 
-  defp put_change(data, _changes, _errors, _valid?, key, _value, nil) when is_atom(key) do
+  defp put_change(data, _changes, _errors, _valid?, key, _value, nil) when is_nil(key) do
     raise ArgumentError, "unknown field `#{inspect(key)}` in #{inspect(data)}"
   end

[Survived] GuardTypeTest
lib/ecto/changeset.ex:1947:81
     raise ArgumentError, "unknown field `#{inspect(key)}` in #{inspect(data)}"
   end
 
-  defp put_change(_data, _changes, _errors, _valid?, key, _value, nil) when not is_atom(key) do
+  defp put_change(_data, _changes, _errors, _valid?, key, _value, nil) when not is_nil(key) do
     raise ArgumentError,
           "field names given to change/put_change must be atoms, got: `#{inspect(key)}`"

[Killed] UnaryNot
lib/ecto/changeset.ex:1953:8
   end
 
   defp put_change(data, changes, errors, valid?, key, value, type) do
-    if not Ecto.Type.equal?(type, Map.get(data, key), value) do
+    if Ecto.Type.equal?(type, Map.get(data, key), value)not Ecto.Type.equal?(type, Map.get(data, key), value) do
       {Map.put(changes, key, value), errors, valid?}
     else

[Killed] GuardTypeTest
lib/ecto/changeset.ex:2231:57
 
   """
   @spec delete_change(t, atom) :: t
-  def delete_change(%Changeset{} = changeset, key) when is_atom(key) do
+  def delete_change(%Changeset{} = changeset, key) when is_nil(key) do
     update_in(changeset.changes, &Map.delete(&1, key))
   end

[Killed] GuardComparisonNegation
lib/ecto/changeset.ex:2250:68
 
   """
   @spec apply_changes(t) :: Ecto.Schema.t() | data
-  def apply_changes(%Changeset{changes: changes, data: data}) when changes == %{} do
+  def apply_changes(%Changeset{changes: changes, data: data}) when changes != %{} do
     data
   end

[Killed] GuardTypeTest
lib/ecto/changeset.ex:2289:59
       %Ecto.Changeset{action: :update}
   """
   @spec apply_action(t, action) :: {:ok, Ecto.Schema.t() | data} | {:error, t}
-  def apply_action(%Changeset{} = changeset, action) when is_atom(action) do
+  def apply_action(%Changeset{} = changeset, action) when is_nil(action) do
     if changeset.valid? do
       {:ok, apply_changes(changeset)}

[Killed] GuardTypeTest
lib/ecto/changeset.ex:2465:72
           atom,
           (atom, term -> [{atom, String.t()} | {atom, error}])
         ) :: t
-  def validate_change(%Changeset{} = changeset, field, validator) when is_atom(field) do
+  def validate_change(%Changeset{} = changeset, field, validator) when is_nil(field) do
     %{changes: changes, types: types, errors: errors} = changeset
     ensure_field_exists!(changeset, types, field)

[Killed] GuardTypeTest
lib/ecto/changeset.ex:2474:25
 
     new =
       Enum.map(new, fn
-        {key, val} when is_atom(key) and is_binary(val) ->
+        {key, val} when is_nil(key) and is_binary(val) ->
           {key, {val, []}}
 

[Killed] GuardTypeTest
lib/ecto/changeset.ex:2477:69
         {key, val} when is_atom(key) and is_binary(val) ->
           {key, {val, []}}
 
-        {key, {val, opts}} when is_atom(key) and is_binary(val) and is_list(opts) ->
+        {key, {val, opts}} when is_atom(key) and is_binary(val) and is_tuple(opts) ->
           {key, {val, opts}}
       end)

[Killed] GuardTypeTest
lib/ecto/changeset.ex:2477:33
         {key, val} when is_atom(key) and is_binary(val) ->
           {key, {val, []}}
 
-        {key, {val, opts}} when is_atom(key) and is_binary(val) and is_list(opts) ->
+        {key, {val, opts}} when is_nil(key) and is_binary(val) and is_list(opts) ->
           {key, {val, opts}}
       end)

[Killed] GuardTypeTest
lib/ecto/changeset.ex:2564:80
 
   """
   @spec validate_required(t, list | atom, Keyword.t()) :: t
-  def validate_required(%Changeset{} = changeset, fields, opts \\ []) when not is_nil(fields) do
+  def validate_required(%Changeset{} = changeset, fields, opts \\ []) when not is_atom(fields) do
     %{required: required, errors: errors, changes: changes} = changeset
     fields = List.wrap(fields)

[Killed] GuardTypeTest
lib/ecto/changeset.ex:2622:64
 
   """
   @spec field_missing?(t(), atom()) :: boolean()
-  def field_missing?(%Changeset{} = changeset, field) when not is_nil(field) do
+  def field_missing?(%Changeset{} = changeset, field) when not is_atom(field) do
     ensure_field_not_many!(changeset.types, field) && missing?(changeset, field) &&
       ensure_field_exists!(changeset, changeset.types, field)

[Killed] Boolean
lib/ecto/changeset.ex:2623:82
   """
   @spec field_missing?(t(), atom()) :: boolean()
   def field_missing?(%Changeset{} = changeset, field) when not is_nil(field) do
-    ensure_field_not_many!(changeset.types, field) && missing?(changeset, field) &&
+    ensure_field_not_many!(changeset.types, field) && missing?(changeset, field) (ensure_field_not_many!(changeset.types, field) && missing?(changeset, field)) ||
+  ensure_field_exists!(changeset, changeset.types, field)&&
       ensure_field_exists!(changeset, changeset.types, field)
   end

[Killed] Boolean
lib/ecto/changeset.ex:2623:52
   """
   @spec field_missing?(t(), atom()) :: boolean()
   def field_missing?(%Changeset{} = changeset, field) when not is_nil(field) do
-    ensure_field_not_many!(changeset.types, field) && missing?(changeset, field) &&
+    ensure_field_not_many!(changeset.types, field) ensure_field_not_many!(changeset.types, field) || missing?(changeset, field)&& missing?(changeset, field) &&
       ensure_field_exists!(changeset, changeset.types, field)
   end

[Killed] GuardTypeTest
lib/ecto/changeset.ex:2685:12
   """
   @spec unsafe_validate_unique(t, atom | [atom, ...], Ecto.Repo.t(), Keyword.t()) :: t
   def unsafe_validate_unique(%Changeset{} = changeset, fields, repo, opts \\ [])
-      when is_list(opts) do
+      when is_tuple(opts) do
     {repo_opts, opts} = Keyword.pop(opts, :repo_opts, [])
     %{data: data, validations: validations} = changeset

[Killed] Boolean
lib/ecto/changeset.ex:2689:28
     {repo_opts, opts} = Keyword.pop(opts, :repo_opts, [])
     %{data: data, validations: validations} = changeset
 
-    unless is_struct(data) and function_exported?(data.__struct__, :__schema__, 1) do
+    unless is_struct(data) is_struct(data) or function_exported?(data.__struct__, :__schema__, 1)and function_exported?(data.__struct__, :__schema__, 1) do
       raise ArgumentError,
             "unsafe_validate_unique/4 does not work with schemaless changesets, got #{inspect(data)}"

[Killed] GuardComparisonNegation
lib/ecto/changeset.ex:2701:38
           schema
 
         # embedded schema with base query
-        {%schema{}, base_query} when base_query != nil ->
+        {%schema{}, base_query} when base_query == nil ->
           schema
 

[Killed] ComparisonNegation
lib/ecto/changeset.ex:2729:25
 
     # If one or more fields are `nil` and `nulls_distinct` is not false, we can't query for uniqueness
     distinct_nils? =
-      if nulls_distinct == false do
+      if nulls_distinct nulls_distinct != false== false do
         false
       else

[Killed] Boolean
lib/ecto/changeset.ex:2735:45
         Enum.any?(where_clause, &(&1 |> elem(1) |> is_nil()))
       end
 
-    if unrelated_changes? or distinct_nils? or any_prior_errors_for_fields? do
+    if unrelated_changes? or distinct_nils? (unrelated_changes? or distinct_nils?) and any_prior_errors_for_fields?or any_prior_errors_for_fields? do
       changeset
     else

[Killed] Boolean
lib/ecto/changeset.ex:2735:27
         Enum.any?(where_clause, &(&1 |> elem(1) |> is_nil()))
       end
 
-    if unrelated_changes? or distinct_nils? or any_prior_errors_for_fields? do
+    if unrelated_changes? unrelated_changes? and distinct_nils?or distinct_nils? or any_prior_errors_for_fields? do
       changeset
     else

[Killed] GuardTypeTest
lib/ecto/changeset.ex:2849:40
     end
   end
 
-  defp missing?(changeset, field) when is_atom(field) do
+  defp missing?(changeset, field) when is_nil(field) do
     case get_field(changeset, field) do
       %{__struct__: Ecto.Association.NotLoaded} ->

[Killed] ComparisonNegation
lib/ecto/changeset.ex:2859:15
                 "You may also consider passing the :required option to Ecto.Changeset.cast_assoc/3"
 
       value when is_binary(value) ->
-        value == ""
+        value value != ""== ""
 
       nil ->

[Killed] UnaryNot
lib/ecto/changeset.ex:2974:43
             element_type
         end
 
-      case Enum.any?(value, fn element -> not Ecto.Type.include?(element_type, element, data) end) do
+      case Enum.any?(value, fn element -> Ecto.Type.include?(element_type, element, data)not Ecto.Type.include?(element_type, element, data) end) do
         true ->
           [{field, message(opts, "has an invalid entry", validation: :subset, enum: data)}]

[Killed] GuardTypeTest
lib/ecto/changeset.ex:3057:52
 
   """
   @spec validate_length(t, atom, Keyword.t()) :: t
-  def validate_length(changeset, field, opts) when is_list(opts) do
+  def validate_length(changeset, field, opts) when is_tuple(opts) do
     validate_change(changeset, field, {:length, opts}, fn
       _, value ->

[Killed] Boolean
lib/ecto/changeset.ex:3060:35
   def validate_length(changeset, field, opts) when is_list(opts) do
     validate_change(changeset, field, {:length, opts}, fn
       _, value ->
-        count_type = opts[:count] || :graphemes
+        count_type = opts[:count] opts[:count] && :graphemes|| :graphemes
 
         {type, length} =

[Killed] GuardTypeTest
lib/ecto/changeset.ex:3073:29
             {value, :bytes} when is_binary(value) ->
               {:binary, byte_size(value)}
 
-            {value, _} when is_list(value) ->
+            {value, _} when is_tuple(value) ->
               {:list, list_length(changeset, field, value)}
 

[Killed] GuardTypeTest
lib/ecto/changeset.ex:3076:29
             {value, _} when is_list(value) ->
               {:list, list_length(changeset, field, value)}
 
-            {value, _} when is_map(value) ->
+            {value, _} when is_list(value) ->
               {:map, map_size(value)}
           end

[Killed] Boolean
lib/ecto/changeset.ex:3081:70
           end
 
         error =
-          ((is = opts[:is]) && wrong_length(type, length, is, opts)) ||
+          ((is = opts[:is]) && wrong_length(type, length, is, opts)) (is = opts[:is]) && wrong_length(type, length, is, opts) &&
+  ((min = opts[:min]) && too_short(type, length, min, opts))||
             ((min = opts[:min]) && too_short(type, length, min, opts)) ||
             ((max = opts[:max]) && too_long(type, length, max, opts))

[Killed] Boolean
lib/ecto/changeset.ex:3081:29
           end
 
         error =
-          ((is = opts[:is]) && wrong_length(type, length, is, opts)) ||
+          ((is = opts[:is]) (is = opts[:is]) || wrong_length(type, length, is, opts)&& wrong_length(type, length, is, opts)) ||
             ((min = opts[:min]) && too_short(type, length, min, opts)) ||
             ((max = opts[:max]) && too_long(type, length, max, opts))

[Killed] Boolean
lib/ecto/changeset.ex:3082:33
 
         error =
           ((is = opts[:is]) && wrong_length(type, length, is, opts)) ||
-            ((min = opts[:min]) && too_short(type, length, min, opts)) ||
+            ((min = opts[:min]) (min = opts[:min]) || too_short(type, length, min, opts)&& too_short(type, length, min, opts)) ||
             ((max = opts[:max]) && too_long(type, length, max, opts))
 

[Killed] Boolean
lib/ecto/changeset.ex:3082:72
 
         error =
           ((is = opts[:is]) && wrong_length(type, length, is, opts)) ||
-            ((min = opts[:min]) && too_short(type, length, min, opts)) ||
+            ((min = opts[:min]) && too_short(type, length, min, opts)) (((is = opts[:is]) && wrong_length(type, length, is, opts)) ||
+   ((min = opts[:min]) && too_short(type, length, min, opts))) &&
+  ((max = opts[:max]) && too_long(type, length, max, opts))||
             ((max = opts[:max]) && too_long(type, length, max, opts))
 

[Killed] Boolean
lib/ecto/changeset.ex:3083:33
         error =
           ((is = opts[:is]) && wrong_length(type, length, is, opts)) ||
             ((min = opts[:min]) && too_short(type, length, min, opts)) ||
-            ((max = opts[:max]) && too_long(type, length, max, opts))
+            ((max = opts[:max]) (max = opts[:max]) || too_long(type, length, max, opts)&& too_long(type, length, max, opts))
 
         if error, do: [{field, error}], else: []

[Killed] Arithmetic
lib/ecto/changeset.ex:3089:91
     end)
   end
 
-  defp codepoints_length(<<_::utf8, rest::binary>>, acc), do: codepoints_length(rest, acc + 1)
+  defp codepoints_length(<<_::utf8, rest::binary>>, acc), do: codepoints_length(rest, acc acc * 1+ 1)
   defp codepoints_length(<<_, rest::binary>>, acc), do: codepoints_length(rest, acc + 1)
   defp codepoints_length(<<>>, acc), do: acc

[Killed] Arithmetic
lib/ecto/changeset.ex:3089:91
     end)
   end
 
-  defp codepoints_length(<<_::utf8, rest::binary>>, acc), do: codepoints_length(rest, acc + 1)
+  defp codepoints_length(<<_::utf8, rest::binary>>, acc), do: codepoints_length(rest, acc acc - 1+ 1)
   defp codepoints_length(<<_, rest::binary>>, acc), do: codepoints_length(rest, acc + 1)
   defp codepoints_length(<<>>, acc), do: acc
