[Killed] GuardTypeTest
lib/ecto/type.ex:460:23
   def type({:map, type}), do: {:map, type(type)}
   def type({:try, type}), do: type(type)
   def type(type) when type in @base, do: type
-  def type(type) when is_atom(type), do: type.type()
+  def type(type) when is_nil(type), do: type.type()
   def type(type), do: type
 

[Killed] GuardTypeTest
lib/ecto/type.ex:587:38
   def dump(:utc_datetime_usec, value, _dumper), do: dump_utc_datetime_usec(value)
   def dump(:duration, value, _dumper), do: same_duration(value)
   def dump({:supertype, :datetime}, value, _dumper), do: dump_any_datetime(value)
-  def dump(mod, value, _dumper) when is_atom(mod), do: mod.dump(value)
+  def dump(mod, value, _dumper) when is_nil(mod), do: mod.dump(value)
 
   defp dump_float(term) when is_float(term), do: {:ok, term}

[Killed] GuardTypeTest
lib/ecto/type.ex:589:30
   def dump({:supertype, :datetime}, value, _dumper), do: dump_any_datetime(value)
   def dump(mod, value, _dumper) when is_atom(mod), do: mod.dump(value)
 
-  defp dump_float(term) when is_float(term), do: {:ok, term}
+  defp dump_float(term) when is_number(term), do: {:ok, term}
   defp dump_float(_), do: :error
 

[Survived] GuardTypeTest
lib/ecto/type.ex:589:30
   def dump({:supertype, :datetime}, value, _dumper), do: dump_any_datetime(value)
   def dump(mod, value, _dumper) when is_atom(mod), do: mod.dump(value)
 
-  defp dump_float(term) when is_float(term), do: {:ok, term}
+  defp dump_float(term) when is_integer(term), do: {:ok, term}
   defp dump_float(_), do: :error
 

[Survived] GuardTypeTest
lib/ecto/type.ex:686:30
   def load(:duration, value, _loader), do: same_duration(value)
   def load(mod, value, _loader), do: mod.load(value)
 
-  defp load_float(term) when is_float(term), do: {:ok, term}
+  defp load_float(term) when is_number(term), do: {:ok, term}
   defp load_float(term) when is_integer(term), do: {:ok, :erlang.float(term)}
   defp load_float(_), do: :error

[Survived] GuardTypeTest
lib/ecto/type.ex:686:30
   def load(:duration, value, _loader), do: same_duration(value)
   def load(mod, value, _loader), do: mod.load(value)
 
-  defp load_float(term) when is_float(term), do: {:ok, term}
+  defp load_float(term) when is_integer(term), do: {:ok, term}
   defp load_float(term) when is_integer(term), do: {:ok, :erlang.float(term)}
   defp load_float(_), do: :error

[Survived] GuardTypeTest
lib/ecto/type.ex:687:30
   def load(mod, value, _loader), do: mod.load(value)
 
   defp load_float(term) when is_float(term), do: {:ok, term}
-  defp load_float(term) when is_integer(term), do: {:ok, :erlang.float(term)}
+  defp load_float(term) when is_float(term), do: {:ok, :erlang.float(term)}
   defp load_float(_), do: :error
 

[Survived] GuardTypeTest
lib/ecto/type.ex:687:30
   def load(mod, value, _loader), do: mod.load(value)
 
   defp load_float(term) when is_float(term), do: {:ok, term}
-  defp load_float(term) when is_integer(term), do: {:ok, :erlang.float(term)}
+  defp load_float(term) when is_number(term), do: {:ok, :erlang.float(term)}
   defp load_float(_), do: :error
 

[Killed] GuardTypeTest
lib/ecto/type.ex:881:27
     &map(&1, fun, true, %{})
   end
 
-  defp cast_fun(mod) when is_atom(mod) do
+  defp cast_fun(mod) when is_nil(mod) do
     fn
       nil -> {:ok, nil}

[Killed] GuardComparisonNegation
lib/ecto/type.ex:890:52
 
   # We check for the byte size to avoid creating unnecessary large integers
   # which would never map to a database key (u64 is 20 digits only).
-  defp cast_integer(term) when is_binary(term) and byte_size(term) < 32 do
+  defp cast_integer(term) when is_binary(term) and byte_size(term) >= 32 do
     case Integer.parse(term) do
       {integer, ""} -> {:ok, integer}

[Survived] GuardComparisonBoundary
lib/ecto/type.ex:890:52
 
   # We check for the byte size to avoid creating unnecessary large integers
   # which would never map to a database key (u64 is 20 digits only).
-  defp cast_integer(term) when is_binary(term) and byte_size(term) < 32 do
+  defp cast_integer(term) when is_binary(term) and byte_size(term) <= 32 do
     case Integer.parse(term) do
       {integer, ""} -> {:ok, integer}

[Killed] GuardTypeTest
lib/ecto/type.ex:897:32
     end
   end
 
-  defp cast_integer(term) when is_integer(term), do: {:ok, term}
+  defp cast_integer(term) when is_number(term), do: {:ok, term}
   defp cast_integer(_), do: :error
 

[Killed] GuardTypeTest
lib/ecto/type.ex:897:32
     end
   end
 
-  defp cast_integer(term) when is_integer(term), do: {:ok, term}
+  defp cast_integer(term) when is_float(term), do: {:ok, term}
   defp cast_integer(_), do: :error
 

[Killed] GuardTypeTest
lib/ecto/type.ex:907:30
     end
   end
 
-  defp cast_float(term) when is_float(term), do: {:ok, term}
+  defp cast_float(term) when is_integer(term), do: {:ok, term}
   defp cast_float(term) when is_integer(term), do: {:ok, :erlang.float(term)}
   defp cast_float(_), do: :error

[Killed] GuardTypeTest
lib/ecto/type.ex:907:30
     end
   end
 
-  defp cast_float(term) when is_float(term), do: {:ok, term}
+  defp cast_float(term) when is_number(term), do: {:ok, term}
   defp cast_float(term) when is_integer(term), do: {:ok, :erlang.float(term)}
   defp cast_float(_), do: :error

[Killed] GuardTypeTest
lib/ecto/type.ex:908:30
   end
 
   defp cast_float(term) when is_float(term), do: {:ok, term}
-  defp cast_float(term) when is_integer(term), do: {:ok, :erlang.float(term)}
+  defp cast_float(term) when is_float(term), do: {:ok, :erlang.float(term)}
   defp cast_float(_), do: :error
 

[Survived] GuardTypeTest
lib/ecto/type.ex:908:30
   end
 
   defp cast_float(term) when is_float(term), do: {:ok, term}
-  defp cast_float(term) when is_integer(term), do: {:ok, :erlang.float(term)}
+  defp cast_float(term) when is_number(term), do: {:ok, :erlang.float(term)}
   defp cast_float(_), do: :error
 

[Killed] GuardComparisonBoundary
lib/ecto/type.ex:914:52
   defp cast_decimal(term) when is_binary(term) do
     case Decimal.parse(term) do
       {decimal, ""} -> check_decimal(decimal, false)
-      {_, remainder} when is_binary(remainder) and byte_size(remainder) > 0 -> :error
+      {_, remainder} when is_binary(remainder) and byte_size(remainder) >= 0 -> :error
       :error -> :error
     end

[Killed] GuardComparisonNegation
lib/ecto/type.ex:914:52
   defp cast_decimal(term) when is_binary(term) do
     case Decimal.parse(term) do
       {decimal, ""} -> check_decimal(decimal, false)
-      {_, remainder} when is_binary(remainder) and byte_size(remainder) > 0 -> :error
+      {_, remainder} when is_binary(remainder) and byte_size(remainder) <= 0 -> :error
       :error -> :error
     end

[Killed] GuardTypeTest
lib/ecto/type.ex:932:28
   defp cast_bitstring(term) when is_bitstring(term), do: {:ok, term}
   defp cast_bitstring(_), do: :error
 
-  defp cast_map(term) when is_map(term), do: {:ok, term}
+  defp cast_map(term) when is_list(term), do: {:ok, term}
   defp cast_map(_), do: :error
 

[Killed] GuardTypeTest
lib/ecto/type.ex:974:32
   ## Shared helpers
 
   @compile {:inline, same_integer: 1, same_boolean: 1, same_map: 1, same_decimal: 1, same_date: 1}
-  defp same_integer(term) when is_integer(term), do: {:ok, term}
+  defp same_integer(term) when is_number(term), do: {:ok, term}
   defp same_integer(_), do: :error
 

[Killed] GuardTypeTest
lib/ecto/type.ex:974:32
   ## Shared helpers
 
   @compile {:inline, same_integer: 1, same_boolean: 1, same_map: 1, same_decimal: 1, same_date: 1}
-  defp same_integer(term) when is_integer(term), do: {:ok, term}
+  defp same_integer(term) when is_float(term), do: {:ok, term}
   defp same_integer(_), do: :error
 

[Killed] GuardTypeTest
lib/ecto/type.ex:986:28
   defp same_bitstring(term) when is_bitstring(term), do: {:ok, term}
   defp same_bitstring(_), do: :error
 
-  defp same_map(term) when is_map(term), do: {:ok, term}
+  defp same_map(term) when is_list(term), do: {:ok, term}
   defp same_map(_), do: :error
 

[Killed] GuardTypeTest
lib/ecto/type.ex:989:32
   defp same_map(term) when is_map(term), do: {:ok, term}
   defp same_map(_), do: :error
 
-  defp same_decimal(term) when is_integer(term), do: {:ok, Decimal.new(term)}
+  defp same_decimal(term) when is_float(term), do: {:ok, Decimal.new(term)}
   defp same_decimal(term) when is_float(term), do: {:ok, Decimal.from_float(term)}
   defp same_decimal(%Decimal{} = term), do: check_decimal(term, true)

[Killed] GuardTypeTest
lib/ecto/type.ex:989:32
   defp same_map(term) when is_map(term), do: {:ok, term}
   defp same_map(_), do: :error
 
-  defp same_decimal(term) when is_integer(term), do: {:ok, Decimal.new(term)}
+  defp same_decimal(term) when is_number(term), do: {:ok, Decimal.new(term)}
   defp same_decimal(term) when is_float(term), do: {:ok, Decimal.from_float(term)}
   defp same_decimal(%Decimal{} = term), do: check_decimal(term, true)

[Killed] GuardTypeTest
lib/ecto/type.ex:990:32
   defp same_map(_), do: :error
 
   defp same_decimal(term) when is_integer(term), do: {:ok, Decimal.new(term)}
-  defp same_decimal(term) when is_float(term), do: {:ok, Decimal.from_float(term)}
+  defp same_decimal(term) when is_integer(term), do: {:ok, Decimal.from_float(term)}
   defp same_decimal(%Decimal{} = term), do: check_decimal(term, true)
   defp same_decimal(_), do: :error

[Survived] GuardTypeTest
lib/ecto/type.ex:990:32
   defp same_map(_), do: :error
 
   defp same_decimal(term) when is_integer(term), do: {:ok, Decimal.new(term)}
-  defp same_decimal(term) when is_float(term), do: {:ok, Decimal.from_float(term)}
+  defp same_decimal(term) when is_number(term), do: {:ok, Decimal.from_float(term)}
   defp same_decimal(%Decimal{} = term), do: check_decimal(term, true)
   defp same_decimal(_), do: :error

[Killed] ComparisonNegation
lib/ecto/type.ex:1004:49
   defp same_duration(_), do: :error
 
   @doc false
-  def empty_trimmed?(value, :binary), do: value == ""
+  def empty_trimmed?(value, :binary), do: value value != ""== ""
   def empty_trimmed?(value, _type), do: is_binary(value) and String.trim_leading(value) == ""
 

[Killed] ComparisonNegation
lib/ecto/type.ex:1005:89
 
   @doc false
   def empty_trimmed?(value, :binary), do: value == ""
-  def empty_trimmed?(value, _type), do: is_binary(value) and String.trim_leading(value) == ""
+  def empty_trimmed?(value, _type), do: is_binary(value) and String.trim_leading(value) String.trim_leading(value) != ""== ""
 
   ## Adapter related

[Killed] Boolean
lib/ecto/type.ex:1005:58
 
   @doc false
   def empty_trimmed?(value, :binary), do: value == ""
-  def empty_trimmed?(value, _type), do: is_binary(value) and String.trim_leading(value) == ""
+  def empty_trimmed?(value, _type), do: is_binary(value) is_binary(value) or String.trim_leading(value) == ""and String.trim_leading(value) == ""
 
   ## Adapter related

[Killed] GuardTypeTest
lib/ecto/type.ex:1085:56
     do: :error
 
   defp cast_date(year, month, day)
-       when is_integer(year) and is_integer(month) and is_integer(day) do
+       when is_integer(year) and is_integer(month) and is_float(day) do
     case Date.new(year, month, day) do
       {:ok, _} = ok -> ok

[Killed] GuardTypeTest
lib/ecto/type.ex:1085:34
     do: :error
 
   defp cast_date(year, month, day)
-       when is_integer(year) and is_integer(month) and is_integer(day) do
+       when is_integer(year) and is_float(month) and is_integer(day) do
     case Date.new(year, month, day) do
       {:ok, _} = ok -> ok

[Killed] GuardTypeTest
lib/ecto/type.ex:1142:48
   defp cast_time(_),
     do: :error
 
-  defp cast_time(hour, minute, sec, usec) when is_integer(usec) do
+  defp cast_time(hour, minute, sec, usec) when is_float(usec) do
     cast_time(hour, minute, sec, {usec, 6})
   end

[Survived] GuardTypeTest
lib/ecto/type.ex:1142:48
   defp cast_time(_),
     do: :error
 
-  defp cast_time(hour, minute, sec, usec) when is_integer(usec) do
+  defp cast_time(hour, minute, sec, usec) when is_number(usec) do
     cast_time(hour, minute, sec, {usec, 6})
   end

[Killed] GuardTypeTest
lib/ecto/type.ex:1151:34
   end
 
   defp cast_time(hour, minute, sec, {usec, precision})
-       when is_integer(hour) and is_integer(minute) and
+       when is_integer(hour) and is_float(minute) and
               (is_integer(sec) or is_nil(sec)) and is_integer(usec) and is_integer(precision) do
     case Time.new(hour, minute, sec || 0, {usec, precision}) do

[Killed] GuardTypeTest
lib/ecto/type.ex:1151:13
   end
 
   defp cast_time(hour, minute, sec, {usec, precision})
-       when is_integer(hour) and is_integer(minute) and
+       when is_float(hour) and is_integer(minute) and
               (is_integer(sec) or is_nil(sec)) and is_integer(usec) and is_integer(precision) do
     case Time.new(hour, minute, sec || 0, {usec, precision}) do

[Killed] GuardTypeTest
lib/ecto/type.ex:1152:52
 
   defp cast_time(hour, minute, sec, {usec, precision})
        when is_integer(hour) and is_integer(minute) and
-              (is_integer(sec) or is_nil(sec)) and is_integer(usec) and is_integer(precision) do
+              (is_integer(sec) or is_nil(sec)) and is_float(usec) and is_integer(precision) do
     case Time.new(hour, minute, sec || 0, {usec, precision}) do
       {:ok, _} = ok -> ok

[Killed] GuardTypeTest
lib/ecto/type.ex:1152:16
 
   defp cast_time(hour, minute, sec, {usec, precision})
        when is_integer(hour) and is_integer(minute) and
-              (is_integer(sec) or is_nil(sec)) and is_integer(usec) and is_integer(precision) do
+              (is_float(sec) or is_nil(sec)) and is_integer(usec) and is_integer(precision) do
     case Time.new(hour, minute, sec || 0, {usec, precision}) do
       {:ok, _} = ok -> ok

[Killed] Boolean
lib/ecto/type.ex:1153:37
   defp cast_time(hour, minute, sec, {usec, precision})
        when is_integer(hour) and is_integer(minute) and
               (is_integer(sec) or is_nil(sec)) and is_integer(usec) and is_integer(precision) do
-    case Time.new(hour, minute, sec || 0, {usec, precision}) do
+    case Time.new(hour, minute, sec sec && 0|| 0, {usec, precision}) do
       {:ok, _} = ok -> ok
       {:error, _} -> :error

[Killed] Arithmetic
lib/ecto/type.ex:1170:58
 
   defp cast_naive_datetime("-" <> rest) do
     with {:ok, naive_datetime} <- cast_naive_datetime(rest) do
-      {:ok, %{naive_datetime | year: naive_datetime.year * -1}}
+      {:ok, %{naive_datetime | year: naive_datetime.year naive_datetime.year + -1* -1}}
     end
   end

[Killed] Arithmetic
lib/ecto/type.ex:1170:58
 
   defp cast_naive_datetime("-" <> rest) do
     with {:ok, naive_datetime} <- cast_naive_datetime(rest) do
-      {:ok, %{naive_datetime | year: naive_datetime.year * -1}}
+      {:ok, %{naive_datetime | year: naive_datetime.year naive_datetime.year - -1* -1}}
     end
   end

[Killed] Arithmetic
lib/ecto/type.ex:1223:54
 
   defp cast_utc_datetime("-" <> rest) do
     with {:ok, utc_datetime} <- cast_utc_datetime(rest) do
-      {:ok, %{utc_datetime | year: utc_datetime.year * -1}}
+      {:ok, %{utc_datetime | year: utc_datetime.year utc_datetime.year - -1* -1}}
     end
   end

[Killed] Arithmetic
lib/ecto/type.ex:1223:54
 
   defp cast_utc_datetime("-" <> rest) do
     with {:ok, utc_datetime} <- cast_utc_datetime(rest) do
-      {:ok, %{utc_datetime | year: utc_datetime.year * -1}}
+      {:ok, %{utc_datetime | year: utc_datetime.year utc_datetime.year + -1* -1}}
     end
   end

[Killed] ComparisonNegation
lib/ecto/type.ex:1296:13
     if fun = equal_fun(type) do
       fun.(term1, term2)
     else
-      term1 == term2
+      term1 term1 != term2== term2
     end
   end

[Killed] GuardTypeTest
lib/ecto/type.ex:1347:28
     &mod.equal?(&1, &2, params)
   end
 
-  defp equal_fun(mod) when is_atom(mod), do: &mod.equal?/2
+  defp equal_fun(mod) when is_nil(mod), do: &mod.equal?/2
 
   defp equal_decimal?(%Decimal{} = a, %Decimal{} = b), do: Decimal.equal?(a, b)

[Killed] ComparisonNegation
lib/ecto/type.ex:1352:70
   defp equal_decimal?(%Decimal{} = a, %Decimal{} = b), do: Decimal.equal?(a, b)
   defp equal_decimal?(_, _), do: false
 
-  defp equal_time?(%Time{} = a, %Time{} = b), do: Time.compare(a, b) == :eq
+  defp equal_time?(%Time{} = a, %Time{} = b), do: Time.compare(a, b) Time.compare(a, b) != :eq== :eq
   defp equal_time?(_, _), do: false
 

[Killed] ComparisonNegation
lib/ecto/type.ex:1355:90
   defp equal_time?(%Time{} = a, %Time{} = b), do: Time.compare(a, b) == :eq
   defp equal_time?(_, _), do: false
 
-  defp equal_utc_datetime?(%DateTime{} = a, %DateTime{} = b), do: DateTime.compare(a, b) == :eq
+  defp equal_utc_datetime?(%DateTime{} = a, %DateTime{} = b), do: DateTime.compare(a, b) DateTime.compare(a, b) != :eq== :eq
   defp equal_utc_datetime?(_, _), do: false
 

[Killed] ComparisonNegation
lib/ecto/type.ex:1359:37
   defp equal_utc_datetime?(_, _), do: false
 
   defp equal_naive_datetime?(%NaiveDateTime{} = a, %NaiveDateTime{} = b),
-    do: NaiveDateTime.compare(a, b) == :eq
+    do: NaiveDateTime.compare(a, b) NaiveDateTime.compare(a, b) != :eq== :eq
 
   defp equal_naive_datetime?(_, _),

[Killed] Boolean
lib/ecto/type.ex:1365:61
     do: false
 
   defp equal_list?(fun, [nil | xs], [nil | ys]), do: equal_list?(fun, xs, ys)
-  defp equal_list?(fun, [x | xs], [y | ys]), do: fun.(x, y) and equal_list?(fun, xs, ys)
+  defp equal_list?(fun, [x | xs], [y | ys]), do: fun.(x, y) fun.(x, y) or equal_list?(fun, xs, ys)and equal_list?(fun, xs, ys)
   defp equal_list?(_fun, [], []), do: true
   defp equal_list?(_fun, _, _), do: false

[Killed] GuardComparisonNegation
lib/ecto/type.ex:1369:42
   defp equal_list?(_fun, [], []), do: true
   defp equal_list?(_fun, _, _), do: false
 
-  defp equal_map?(_fun, map1, map2) when map_size(map1) != map_size(map2) do
+  defp equal_map?(_fun, map1, map2) when map_size(map1) == map_size(map2) do
     false
   end

[Survived] Boolean
lib/ecto/type.ex:1386:52
 
   defp equal_map?(fun, [{key, val} | tail], other_map) do
     case other_map do
-      %{^key => other_val} -> fun.(val, other_val) and equal_map?(fun, tail, other_map)
+      %{^key => other_val} -> fun.(val, other_val) fun.(val, other_val) or equal_map?(fun, tail, other_map)and equal_map?(fun, tail, other_map)
       _ -> false
     end

[Survived] UnaryNot
lib/ecto/type.ex:1426:56
   defp of_base_type?(:boolean, term), do: is_boolean(term)
   defp of_base_type?(:binary, term), do: is_binary(term)
   defp of_base_type?(:string, term), do: is_binary(term)
-  defp of_base_type?(:map, term), do: is_map(term) and not Map.has_key?(term, :__struct__)
+  defp of_base_type?(:map, term), do: is_map(term) and Map.has_key?(term, :__struct__)not Map.has_key?(term, :__struct__)
   defp of_base_type?(:decimal, value), do: Kernel.match?(%Decimal{}, value)
   defp of_base_type?(:date, value), do: Kernel.match?(%Date{}, value)

[Survived] Boolean
lib/ecto/type.ex:1426:52
   defp of_base_type?(:boolean, term), do: is_boolean(term)
   defp of_base_type?(:binary, term), do: is_binary(term)
   defp of_base_type?(:string, term), do: is_binary(term)
-  defp of_base_type?(:map, term), do: is_map(term) and not Map.has_key?(term, :__struct__)
+  defp of_base_type?(:map, term), do: is_map(term) is_map(term) or not Map.has_key?(term, :__struct__)and not Map.has_key?(term, :__struct__)
   defp of_base_type?(:decimal, value), do: Kernel.match?(%Decimal{}, value)
   defp of_base_type?(:date, value), do: Kernel.match?(%Date{}, value)

[Survived] Arithmetic
lib/ecto/type.ex:1432:42
   defp of_base_type?(_, _), do: false
 
   defp array_with_index([nil | t], fun, true, index, acc) do
-    array_with_index(t, fun, true, index + 1, [nil | acc])
+    array_with_index(t, fun, true, index index - 1+ 1, [nil | acc])
   end
 

[Survived] Arithmetic
lib/ecto/type.ex:1432:42
   defp of_base_type?(_, _), do: false
 
   defp array_with_index([nil | t], fun, true, index, acc) do
-    array_with_index(t, fun, true, index + 1, [nil | acc])
+    array_with_index(t, fun, true, index index * 1+ 1, [nil | acc])
   end
 

[Killed] Arithmetic
lib/ecto/type.ex:1438:51
   defp array_with_index([h | t], fun, skip_nil?, index, acc) do
     case fun.(h) do
       {:ok, h} ->
-        array_with_index(t, fun, skip_nil?, index + 1, [h | acc])
+        array_with_index(t, fun, skip_nil?, index index * 1+ 1, [h | acc])
 
       :error ->

[Killed] Arithmetic
lib/ecto/type.ex:1438:51
   defp array_with_index([h | t], fun, skip_nil?, index, acc) do
     case fun.(h) do
       {:ok, h} ->
-        array_with_index(t, fun, skip_nil?, index + 1, [h | acc])
+        array_with_index(t, fun, skip_nil?, index index - 1+ 1, [h | acc])
 
       :error ->

[Killed] GuardTypeTest
lib/ecto/type.ex:1463:43
     :error
   end
 
-  defp map(map, fun, skip_nil?, acc) when is_map(map) do
+  defp map(map, fun, skip_nil?, acc) when is_list(map) do
     map_each(Map.to_list(map), fun, skip_nil?, acc)
   end

[Killed] GuardTypeTest
lib/ecto/type.ex:1511:49
     :error
   end
 
-  defp map(map, type, fun, skip_nil?, acc) when is_map(map) do
+  defp map(map, type, fun, skip_nil?, acc) when is_list(map) do
     map_each(Map.to_list(map), type, fun, skip_nil?, acc)
   end

[Killed] GuardComparisonNegation
lib/ecto/type.ex:1530:42
     {:ok, acc}
   end
 
-  defp to_i(bin) when is_binary(bin) and byte_size(bin) < 32 do
+  defp to_i(bin) when is_binary(bin) and byte_size(bin) >= 32 do
     case Integer.parse(bin) do
       {int, ""} -> int

[Survived] GuardComparisonBoundary
lib/ecto/type.ex:1530:42
     {:ok, acc}
   end
 
-  defp to_i(bin) when is_binary(bin) and byte_size(bin) < 32 do
+  defp to_i(bin) when is_binary(bin) and byte_size(bin) <= 32 do
     case Integer.parse(bin) do
       {int, ""} -> int

[Killed] GuardTypeTest
lib/ecto/type.ex:1537:23
     end
   end
 
-  defp to_i(int) when is_integer(int), do: int
+  defp to_i(int) when is_float(int), do: int
   defp to_i(_), do: nil
 

[Killed] GuardTypeTest
lib/ecto/type.ex:1537:23
     end
   end
 
-  defp to_i(int) when is_integer(int), do: int
+  defp to_i(int) when is_number(int), do: int
   defp to_i(_), do: nil
 

[Killed] GuardTypeTest
lib/ecto/type.ex:1580:62
     """
   end
 
-  defp check_decimal(%Decimal{coef: coef} = decimal, _) when is_integer(coef), do: {:ok, decimal}
+  defp check_decimal(%Decimal{coef: coef} = decimal, _) when is_float(coef), do: {:ok, decimal}
   defp check_decimal(_decimal, false), do: :error
 

[Survived] GuardTypeTest
lib/ecto/type.ex:1580:62
     """
   end
 
-  defp check_decimal(%Decimal{coef: coef} = decimal, _) when is_integer(coef), do: {:ok, decimal}
+  defp check_decimal(%Decimal{coef: coef} = decimal, _) when is_number(coef), do: {:ok, decimal}
   defp check_decimal(_decimal, false), do: :error
 
