[Killed] GuardComparisonNegation
lib/jason.ex:224:56
     end
   end
 
-  defp do_encode(input, %{pretty: pretty} = opts) when pretty !== false do
+  defp do_encode(input, %{pretty: pretty} = opts) when pretty === false do
     case Encode.encode(input, opts) do
       {:ok, encoded} -> {:ok, Formatter.pretty_print_to_iodata(encoded, pretty)}
