[Survived] Arithmetic
lib/ecto/changeset.ex:3090:85
   end
 
   defp codepoints_length(<<_::utf8, rest::binary>>, acc), do: codepoints_length(rest, acc + 1)
-  defp codepoints_length(<<_, rest::binary>>, acc), do: codepoints_length(rest, acc + 1)
+  defp codepoints_length(<<_, rest::binary>>, acc), do: codepoints_length(rest, acc acc * 1+ 1)
   defp codepoints_length(<<>>, acc), do: acc
 

[Survived] Arithmetic
lib/ecto/changeset.ex:3090:85
   end
 
   defp codepoints_length(<<_::utf8, rest::binary>>, acc), do: codepoints_length(rest, acc + 1)
-  defp codepoints_length(<<_, rest::binary>>, acc), do: codepoints_length(rest, acc + 1)
+  defp codepoints_length(<<_, rest::binary>>, acc), do: codepoints_length(rest, acc acc - 1+ 1)
   defp codepoints_length(<<>>, acc), do: acc
 

[Killed] GuardComparisonNegation
lib/ecto/changeset.ex:3141:52
         type: :map
       )
 
-  defp too_short(_type, length, value, _opts) when length >= value, do: nil
+  defp too_short(_type, length, value, _opts) when length < value, do: nil
 
   defp too_short(:string, _length, value, opts) do

[Killed] GuardComparisonBoundary
lib/ecto/changeset.ex:3141:52
         type: :map
       )
 
-  defp too_short(_type, length, value, _opts) when length >= value, do: nil
+  defp too_short(_type, length, value, _opts) when length > value, do: nil
 
   defp too_short(:string, _length, value, opts) do

[Killed] GuardComparisonBoundary
lib/ecto/changeset.ex:3179:51
     )
   end
 
-  defp too_long(_type, length, value, _opts) when length <= value, do: nil
+  defp too_long(_type, length, value, _opts) when length < value, do: nil
 
   defp too_long(:string, _length, value, opts) do

[Killed] GuardComparisonNegation
lib/ecto/changeset.ex:3179:51
     )
   end
 
-  defp too_long(_type, length, value, _opts) when length <= value, do: nil
+  defp too_long(_type, length, value, _opts) when length > value, do: nil
 
   defp too_long(:string, _length, value, opts) do

[Killed] GuardTypeTest
lib/ecto/changeset.ex:3380:31
     end
   end
 
-  defp decimal_new(term) when is_float(term), do: Decimal.from_float(term)
+  defp decimal_new(term) when is_integer(term), do: Decimal.from_float(term)
   defp decimal_new(term), do: Decimal.new(term)
 

[Killed] GuardTypeTest
lib/ecto/changeset.ex:3380:31
     end
   end
 
-  defp decimal_new(term) when is_float(term), do: Decimal.from_float(term)
+  defp decimal_new(term) when is_number(term), do: Decimal.from_float(term)
   defp decimal_new(term), do: Decimal.new(term)
 

[Killed] GuardTypeTest
lib/ecto/changeset.ex:3427:78
   @spec validate_confirmation(t, atom, Keyword.t()) :: t
   def validate_confirmation(changeset, field, opts \\ [])
 
-  def validate_confirmation(%{params: params} = changeset, field, opts) when is_map(params) do
+  def validate_confirmation(%{params: params} = changeset, field, opts) when is_list(params) do
     param = Atom.to_string(field)
     error_param = "#{param}_confirmation"

[Killed] Boolean
lib/ecto/changeset.ex:3451:34
       changeset
       | validations: [{field, {:confirmation, opts}} | changeset.validations],
         errors: errors ++ changeset.errors,
-        valid?: changeset.valid? and errors == []
+        valid?: changeset.valid? changeset.valid? or errors == []and errors == []
     }
   end

[Killed] ComparisonNegation
lib/ecto/changeset.ex:3451:45
       changeset
       | validations: [{field, {:confirmation, opts}} | changeset.validations],
         errors: errors ++ changeset.errors,
-        valid?: changeset.valid? and errors == []
+        valid?: changeset.valid? and errors errors != []== []
     }
   end

[Killed] GuardTypeTest
lib/ecto/changeset.ex:3469:57
 
   defp message(opts, key \\ :message, default, message_opts) do
     case Keyword.get(opts, key, default) do
-      {message, extra_opts} when is_binary(message) and is_list(extra_opts) ->
+      {message, extra_opts} when is_binary(message) and is_tuple(extra_opts) ->
         {message, Keyword.merge(message_opts, extra_opts)}
 

[Killed] GuardComparisonNegation
lib/ecto/changeset.ex:3636:42
 
   # increment_with_rollover expect to be used with lock_version set as :integer in db schema
   # 2_147_483_647 is upper limit for signed integer for both PostgreSQL and MySQL
-  defp increment_with_rollover(val) when val >= 2_147_483_647 do
+  defp increment_with_rollover(val) when val < 2_147_483_647 do
     1
   end

[Killed] GuardComparisonBoundary
lib/ecto/changeset.ex:3636:42
 
   # increment_with_rollover expect to be used with lock_version set as :integer in db schema
   # 2_147_483_647 is upper limit for signed integer for both PostgreSQL and MySQL
-  defp increment_with_rollover(val) when val >= 2_147_483_647 do
+  defp increment_with_rollover(val) when val > 2_147_483_647 do
     1
   end

[Killed] GuardTypeTest
lib/ecto/changeset.ex:3640:42
     1
   end
 
-  defp increment_with_rollover(val) when is_integer(val) do
+  defp increment_with_rollover(val) when is_float(val) do
     val + 1
   end

[Survived] GuardTypeTest
lib/ecto/changeset.ex:3640:42
     1
   end
 
-  defp increment_with_rollover(val) when is_integer(val) do
+  defp increment_with_rollover(val) when is_number(val) do
     val + 1
   end

[Killed] Arithmetic
lib/ecto/changeset.ex:3641:9
   end
 
   defp increment_with_rollover(val) when is_integer(val) do
-    val + 1
+    val val - 1+ 1
   end
 

[Killed] Arithmetic
lib/ecto/changeset.ex:3641:9
   end
 
   defp increment_with_rollover(val) when is_integer(val) do
-    val + 1
+    val val * 1+ 1
   end
 

[Survived] Boolean
lib/ecto/changeset.ex:3752:24
   """
   @spec check_constraint(t, atom, Keyword.t()) :: t
   def check_constraint(changeset, field, opts \\ []) do
-    name = opts[:name] || raise ArgumentError, "must supply the name of the constraint"
+    name = opts[:name] opts[:name] && raise ArgumentError, "must supply the name of the constraint"|| raise ArgumentError, "must supply the name of the constraint"
     message = constraint_message(opts, "is invalid")
     match_type = Keyword.get(opts, :match, :exact)

[Killed] GuardTypeTest
lib/ecto/changeset.ex:3892:54
   @spec unique_constraint(t, atom | [atom, ...], Keyword.t()) :: t
   def unique_constraint(changeset, field_or_fields, opts \\ [])
 
-  def unique_constraint(changeset, field, opts) when is_atom(field) do
+  def unique_constraint(changeset, field, opts) when is_nil(field) do
     unique_constraint(changeset, [field], opts)
   end

[Killed] Boolean
lib/ecto/changeset.ex:3897:24
   end
 
   def unique_constraint(changeset, [first_field | _] = fields, opts) do
-    name = opts[:name] || unique_index_name(changeset, fields)
+    name = opts[:name] opts[:name] && unique_index_name(changeset, fields)|| unique_index_name(changeset, fields)
     message = constraint_message(opts, "has already been taken")
     match_type = Keyword.get(opts, :match, :exact)

[Killed] Boolean
lib/ecto/changeset.ex:3962:24
   """
   @spec foreign_key_constraint(t, atom, Keyword.t()) :: t
   def foreign_key_constraint(changeset, field, opts \\ []) do
-    name = opts[:name] || "#{get_source(changeset)}_#{get_field_source(changeset, field)}_fkey"
+    name = opts[:name] opts[:name] && "#{get_source(changeset)}_#{get_field_source(changeset, field)}_fkey"|| "#{get_source(changeset)}_#{get_field_source(changeset, field)}_fkey"
     match_type = Keyword.get(opts, :match, :exact)
     message = constraint_message(opts, "does not exist")

[Killed] Boolean
lib/ecto/changeset.ex:4011:19
   @spec assoc_constraint(t, atom, Keyword.t()) :: t
   def assoc_constraint(changeset, assoc, opts \\ []) do
     name =
-      opts[:name] ||
+      opts[:name] opts[:name] &&
+  case get_assoc_type(changeset, assoc) do
+    %Ecto.Association.BelongsTo{owner_key: owner_key} ->
+      "#{get_source(changeset)}_#{owner_key}_fkey"
+
+    other ->
+      raise ArgumentError,
+            "assoc_constraint can only be added to belongs to associations, got: #{inspect(other)}"
+  end||
         case get_assoc_type(changeset, assoc) do
           %Ecto.Association.BelongsTo{owner_key: owner_key} ->

[Killed] Boolean
lib/ecto/changeset.ex:4077:24
           related_key: related_key,
           related: related
         } ->
-          {opts[:name] || "#{related.__schema__(:source)}_#{related_key}_fkey",
+          {opts[:name] opts[:name] && "#{related.__schema__(:source)}_#{related_key}_fkey"|| "#{related.__schema__(:source)}_#{related_key}_fkey",
            constraint_message(opts, no_assoc_message(cardinality))}
 

[Survived] Boolean
lib/ecto/changeset.ex:4114:19
   """
   def exclusion_constraint(changeset, field, opts \\ []) do
     name =
-      opts[:name] || "#{get_source(changeset)}_#{get_field_source(changeset, field)}_exclusion"
+      opts[:name] opts[:name] && "#{get_source(changeset)}_#{get_field_source(changeset, field)}_exclusion"|| "#{get_source(changeset)}_#{get_field_source(changeset, field)}_exclusion"
 
     message = constraint_message(opts, "violates an exclusion constraint")

[Killed] GuardTypeTest
lib/ecto/changeset.ex:4134:13
          error_message,
          error_type
        )
-       when is_atom(field) and is_binary(error_message) do
+       when is_nil(field) and is_binary(error_message) do
     constraint = %{
       constraint: normalize_constraint(constraint, match),

[Killed] GuardTypeTest
lib/ecto/changeset.ex:4147:53
     %{changeset | constraints: [constraint | constraints]}
   end
 
-  defp normalize_constraint(constraint, match) when is_atom(constraint) do
+  defp normalize_constraint(constraint, match) when is_nil(constraint) do
     normalize_constraint(Atom.to_string(constraint), match)
   end

[Killed] ComparisonNegation
lib/ecto/changeset.ex:4161:14
   end
 
   defp normalize_constraint(%Regex{} = constraint, match) do
-    if match != :exact do
+    if match match == :exact!= :exact do
       raise ArgumentError,
             "a Regex constraint only allows match type of :exact, got: #{inspect(match)}"

[Killed] GuardTypeTest
lib/ecto/changeset.ex:4198:69
             "Did you mean #{one_of}`#{Enum.join(associations, "`, `")}`?"
   end
 
-  defp get_field_source(%{data: %{__struct__: schema}}, field) when is_atom(schema),
+  defp get_field_source(%{data: %{__struct__: schema}}, field) when is_nil(schema),
     do: schema.__schema__(:field_source, field) || field
 

[Killed] Boolean
lib/ecto/changeset.ex:4199:49
   end
 
   defp get_field_source(%{data: %{__struct__: schema}}, field) when is_atom(schema),
-    do: schema.__schema__(:field_source, field) || field
+    do: schema.__schema__(:field_source, field) schema.__schema__(:field_source, field) && field|| field
 
   defp get_field_source(%{}, field),

[Killed] ComparisonNegation
lib/ecto/changeset.ex:4269:44
           {child, all_empty?} =
             Enum.map_reduce(changesets, true, fn changeset, all_empty? ->
               child = traverse_function.(changeset, msg_func)
-              {child, all_empty? and child == %{}}
+              {child, all_empty? and child child != %{}== %{}}
             end)
 

[Killed] Boolean
lib/ecto/changeset.ex:4269:34
           {child, all_empty?} =
             Enum.map_reduce(changesets, true, fn changeset, all_empty? ->
               child = traverse_function.(changeset, msg_func)
-              {child, all_empty? and child == %{}}
+              {child, all_empty? all_empty? or child == %{}and child == %{}}
             end)
 

[Killed] GuardComparisonNegation
lib/ecto/changeset.ex:4283:24
       {field, {tag, %{cardinality: :one}}}, acc when tag in @relations ->
         if changeset = Map.get(changes, field) do
           case traverse_function.(changeset, msg_func) do
-            child when child == %{} -> acc
+            child when child != %{} -> acc
             child -> Map.put(acc, field, child)
           end
