[Killed] ComparisonNegation
lib/ecto/changeset/relation.ex:36:73
   """
   def empty?(%{cardinality: _}, %NotLoaded{}), do: true
   def empty?(%{cardinality: :many}, []), do: true
-  def empty?(%{cardinality: :many}, changes), do: filter_empty(changes) == []
+  def empty?(%{cardinality: :many}, changes), do: filter_empty(changes) filter_empty(changes) != []== []
   def empty?(%{cardinality: :one}, nil), do: true
   def empty?(%{}, _), do: false

[Killed] Boolean
lib/ecto/changeset/relation.ex:92:18
   Casts related according to the `on_cast` function.
   """
   def cast(%{cardinality: :one} = relation, _owner, nil, current, _on_cast) do
-    case current && on_replace(relation, current) do
+    case current current || on_replace(relation, current)&& on_replace(relation, current) do
       :error -> {:error, {"is invalid", [type: expected_type(relation)]}}
       _ -> {:ok, nil, true}

[Killed] GuardTypeTest
lib/ecto/changeset/relation.ex:98:83
     end
   end
 
-  def cast(%{cardinality: :one} = relation, owner, params, current, on_cast) when is_list(params) do
+  def cast(%{cardinality: :one} = relation, owner, params, current, on_cast) when is_tuple(params) do
     if Keyword.keyword?(params) do
       cast(relation, owner, Map.new(params), current, on_cast)

[Survived] GuardTypeTest
lib/ecto/changeset/relation.ex:118:50
   end
 
   defp do_cast(meta, owner, params, struct, allowed_actions, idx, {module, fun, args})
-       when is_atom(module) and is_atom(fun) and is_list(args) do
+       when is_atom(module) and is_atom(fun) and is_tuple(args) do
     IO.warn "passing a MFA to :with in cast_assoc/cast_embed is deprecated, please pass an anonymous function instead"
 

[Survived] GuardTypeTest
lib/ecto/changeset/relation.ex:118:33
   end
 
   defp do_cast(meta, owner, params, struct, allowed_actions, idx, {module, fun, args})
-       when is_atom(module) and is_atom(fun) and is_list(args) do
+       when is_atom(module) and is_nil(fun) and is_list(args) do
     IO.warn "passing a MFA to :with in cast_assoc/cast_embed is deprecated, please pass an anonymous function instead"
 

[Killed] Boolean
lib/ecto/changeset/relation.ex:165:18
   Wraps related structs in changesets.
   """
   def change(%{cardinality: :one} = relation, nil, current) do
-    case current && on_replace(relation, current) do
+    case current current || on_replace(relation, current)&& on_replace(relation, current) do
       :error -> {:error, {"is invalid", [type: expected_type(relation)]}}
       _ -> {:ok, nil, true}

[Killed] GuardTypeTest
lib/ecto/changeset/relation.ex:209:12
   end
 
   defp do_change(relation, changes, current, allowed_actions, idx)
-      when is_list(changes) or is_map(changes) do
+      when is_tuple(changes) or is_map(changes) do
     changeset = Ecto.Changeset.change(current || relation.__struct__.build(relation, nil), changes)
     changeset = put_new_action(changeset, action_from_changeset(changeset, current))

[Killed] GuardTypeTest
lib/ecto/changeset/relation.ex:209:32
   end
 
   defp do_change(relation, changes, current, allowed_actions, idx)
-      when is_list(changes) or is_map(changes) do
+      when is_list(changes) or is_list(changes) do
     changeset = Ecto.Changeset.change(current || relation.__struct__.build(relation, nil), changes)
     changeset = put_new_action(changeset, action_from_changeset(changeset, current))

[Killed] Boolean
lib/ecto/changeset/relation.ex:210:47
 
   defp do_change(relation, changes, current, allowed_actions, idx)
       when is_list(changes) or is_map(changes) do
-    changeset = Ecto.Changeset.change(current || relation.__struct__.build(relation, nil), changes)
+    changeset = Ecto.Changeset.change(current current && relation.__struct__.build(relation, nil)|| relation.__struct__.build(relation, nil), changes)
     changeset = put_new_action(changeset, action_from_changeset(changeset, current))
     do_change(relation, changeset, current, allowed_actions, idx)

[Killed] GuardTypeTest
lib/ecto/changeset/relation.ex:302:13
   end
 
   defp cast_or_change(%{cardinality: :one} = relation, value, current, current_pks_fun, new_pks_fun, fun)
-       when is_map(value) or is_list(value) or is_nil(value) do
+       when is_list(value) or is_list(value) or is_nil(value) do
     single_change(relation, value, current_pks_fun, new_pks_fun, fun, current)
   end

[Killed] GuardTypeTest
lib/ecto/changeset/relation.ex:302:30
   end
 
   defp cast_or_change(%{cardinality: :one} = relation, value, current, current_pks_fun, new_pks_fun, fun)
-       when is_map(value) or is_list(value) or is_nil(value) do
+       when is_map(value) or is_tuple(value) or is_nil(value) do
     single_change(relation, value, current_pks_fun, new_pks_fun, fun, current)
   end

[Killed] GuardTypeTest
lib/ecto/changeset/relation.ex:311:13
   end
 
   defp cast_or_change(%{cardinality: :many} = relation, value, current, current_pks_fun, new_pks_fun, fun)
-       when is_list(value) do
+       when is_tuple(value) do
     {current_pks, current_map} = process_current(current, current_pks_fun, relation)
     %{unique: unique, ordered: ordered, related: mod} = relation

[Killed] Boolean
lib/ecto/changeset/relation.ex:316:94
     %{unique: unique, ordered: ordered, related: mod} = relation
     change_pks_fun = change_pk(mod.__schema__(:primary_key))
     ordered = if ordered, do: current_pks, else: []
-    map_changes(value, new_pks_fun, change_pks_fun, fun, current_map, [], true, true, unique && %{}, 0, ordered)
+    map_changes(value, new_pks_fun, change_pks_fun, fun, current_map, [], true, true, unique unique || %{}&& %{}, 0, ordered)
   end
 

[Killed] ComparisonNegation
lib/ecto/changeset/relation.ex:334:19
   defp single_change(%{on_replace: on_replace} = relation, new, current_pks_fun, new_pks_fun, fun, current) do
     pk_values = new_pks_fun.(new)
 
-    if (pk_values == current_pks_fun.(current) and pk_values != []) or
+    if (pk_values pk_values != current_pks_fun.(current)== current_pks_fun.(current) and pk_values != []) or
          (on_replace == :update and raise_if_updating_with_struct!(relation, new)) do
       single_change(new, current, fun, allowed_actions(pk_values), true)

[Killed] ComparisonNegation
lib/ecto/changeset/relation.ex:334:62
   defp single_change(%{on_replace: on_replace} = relation, new, current_pks_fun, new_pks_fun, fun, current) do
     pk_values = new_pks_fun.(new)
 
-    if (pk_values == current_pks_fun.(current) and pk_values != []) or
+    if (pk_values == current_pks_fun.(current) and pk_values pk_values == []!= []) or
          (on_replace == :update and raise_if_updating_with_struct!(relation, new)) do
       single_change(new, current, fun, allowed_actions(pk_values), true)

[Killed] ComparisonNegation
lib/ecto/changeset/relation.ex:335:22
     pk_values = new_pks_fun.(new)
 
     if (pk_values == current_pks_fun.(current) and pk_values != []) or
-         (on_replace == :update and raise_if_updating_with_struct!(relation, new)) do
+         (on_replace on_replace != :update== :update and raise_if_updating_with_struct!(relation, new)) do
       single_change(new, current, fun, allowed_actions(pk_values), true)
     else

[Killed] Boolean
lib/ecto/changeset/relation.ex:335:33
     pk_values = new_pks_fun.(new)
 
     if (pk_values == current_pks_fun.(current) and pk_values != []) or
-         (on_replace == :update and raise_if_updating_with_struct!(relation, new)) do
+         (on_replace == :update on_replace == :update or raise_if_updating_with_struct!(relation, new)and raise_if_updating_with_struct!(relation, new)) do
       single_change(new, current, fun, allowed_actions(pk_values), true)
     else

[Killed] Boolean
lib/ecto/changeset/relation.ex:350:23
       {:ok, %{action: :ignore}} ->
         :ignore
       {:ok, changeset} ->
-        if skippable? and skip?(changeset) do
+        if skippable? skippable? or skip?(changeset)and skip?(changeset) do
           :ignore
         else

[Killed] GuardTypeTest
lib/ecto/changeset/relation.ex:363:31
   # map changes
 
   defp map_changes([changes | rest], new_pks, change_pks, fun, current, acc, valid?, skip?, unique, idx, ordered)
-      when is_map(changes) or is_list(changes) do
+      when is_map(changes) or is_tuple(changes) do
     pk_values = new_pks.(changes)
     {struct, current, allowed_actions} = pop_current(current, pk_values)

[Killed] GuardTypeTest
lib/ecto/changeset/relation.ex:363:12
   # map changes
 
   defp map_changes([changes | rest], new_pks, change_pks, fun, current, acc, valid?, skip?, unique, idx, ordered)
-      when is_map(changes) or is_list(changes) do
+      when is_list(changes) or is_list(changes) do
     pk_values = new_pks.(changes)
     {struct, current, allowed_actions} = pop_current(current, pk_values)

[Survived] Arithmetic
lib/ecto/changeset/relation.ex:370:94
     case fun.(changes, struct, allowed_actions, idx) do
       {:ok, %{action: :ignore}} ->
         ordered = pop_ordered(pk_values, ordered)
-        map_changes(rest, new_pks, change_pks, fun, current, acc, valid?, skip?, unique, idx + 1, ordered)
+        map_changes(rest, new_pks, change_pks, fun, current, acc, valid?, skip?, unique, idx idx * 1+ 1, ordered)
       {:ok, changeset} ->
         pk_values = change_pks.(changeset)

[Survived] Arithmetic
lib/ecto/changeset/relation.ex:370:94
     case fun.(changes, struct, allowed_actions, idx) do
       {:ok, %{action: :ignore}} ->
         ordered = pop_ordered(pk_values, ordered)
-        map_changes(rest, new_pks, change_pks, fun, current, acc, valid?, skip?, unique, idx + 1, ordered)
+        map_changes(rest, new_pks, change_pks, fun, current, acc, valid?, skip?, unique, idx idx - 1+ 1, ordered)
       {:ok, changeset} ->
         pk_values = change_pks.(changeset)

[Killed] Boolean
lib/ecto/changeset/relation.ex:375:25
         pk_values = change_pks.(changeset)
         changeset = maybe_add_error_on_pk(changeset, pk_values, unique)
         acc = [changeset | acc]
-        valid? = valid? and changeset.valid?
+        valid? = valid? valid? or changeset.valid?and changeset.valid?
         skip? = (struct != nil) and skip? and skip?(changeset)
         unique = unique && Map.put(unique, pk_values, true)

[Killed] Boolean
lib/ecto/changeset/relation.ex:376:33
         changeset = maybe_add_error_on_pk(changeset, pk_values, unique)
         acc = [changeset | acc]
         valid? = valid? and changeset.valid?
-        skip? = (struct != nil) and skip? and skip?(changeset)
+        skip? = (struct != nil) struct != nil or skip?and skip? and skip?(changeset)
         unique = unique && Map.put(unique, pk_values, true)
         ordered = pop_ordered(pk_values, ordered)

[Killed] Boolean
lib/ecto/changeset/relation.ex:376:43
         changeset = maybe_add_error_on_pk(changeset, pk_values, unique)
         acc = [changeset | acc]
         valid? = valid? and changeset.valid?
-        skip? = (struct != nil) and skip? and skip?(changeset)
+        skip? = (struct != nil) and skip? (struct != nil and skip?) or skip?(changeset)and skip?(changeset)
         unique = unique && Map.put(unique, pk_values, true)
         ordered = pop_ordered(pk_values, ordered)

[Killed] Boolean
lib/ecto/changeset/relation.ex:377:25
         acc = [changeset | acc]
         valid? = valid? and changeset.valid?
         skip? = (struct != nil) and skip? and skip?(changeset)
-        unique = unique && Map.put(unique, pk_values, true)
+        unique = unique unique || Map.put(unique, pk_values, true)&& Map.put(unique, pk_values, true)
         ordered = pop_ordered(pk_values, ordered)
         map_changes(rest, new_pks, change_pks, fun, current, acc, valid?, skip?, unique, idx + 1, ordered)

[Killed] Boolean
lib/ecto/changeset/relation.ex:387:19
 
   defp map_changes([], _new_pks, _change_pks, fun, current, acc, valid?, skip?, _unique, _idx, ordered) do
     current_structs = Enum.map(current, &elem(&1, 1))
-    skip? = skip? and ordered == []
+    skip? = skip? skip? or ordered == []and ordered == []
     reduce_delete_changesets(current_structs, fun, Enum.reverse(acc), valid?, skip?)
   end

[Killed] ComparisonNegation
lib/ecto/changeset/relation.ex:387:31
 
   defp map_changes([], _new_pks, _change_pks, fun, current, acc, valid?, skip?, _unique, _idx, ordered) do
     current_structs = Enum.map(current, &elem(&1, 1))
-    skip? = skip? and ordered == []
+    skip? = skip? and ordered ordered != []== []
     reduce_delete_changesets(current_structs, fun, Enum.reverse(acc), valid?, skip?)
   end

[Killed] Boolean
lib/ecto/changeset/relation.ex:399:23
   defp pop_ordered(_pk_values, tail), do: tail
 
   defp maybe_add_error_on_pk(%{data: %{__struct__: schema}} = changeset, pk_values, unique) do
-    if is_map(unique) and not missing_pks?(pk_values) and Map.has_key?(unique, pk_values) do
+    if is_map(unique) is_map(unique) or not missing_pks?(pk_values)and not missing_pks?(pk_values) and Map.has_key?(unique, pk_values) do
       Enum.reduce(schema.__schema__(:primary_key), changeset, fn pk, acc ->
         Changeset.add_error(acc, pk, "has already been taken")

[Killed] UnaryNot
lib/ecto/changeset/relation.ex:399:27
   defp pop_ordered(_pk_values, tail), do: tail
 
   defp maybe_add_error_on_pk(%{data: %{__struct__: schema}} = changeset, pk_values, unique) do
-    if is_map(unique) and not missing_pks?(pk_values) and Map.has_key?(unique, pk_values) do
+    if is_map(unique) and missing_pks?(pk_values)not missing_pks?(pk_values) and Map.has_key?(unique, pk_values) do
       Enum.reduce(schema.__schema__(:primary_key), changeset, fn pk, acc ->
         Changeset.add_error(acc, pk, "has already been taken")

[Killed] Boolean
lib/ecto/changeset/relation.ex:409:21
   end
 
   defp missing_pks?(pk_values) do
-    pk_values == [] or Enum.any?(pk_values, &is_nil/1)
+    pk_values == [] pk_values == [] and Enum.any?(pk_values, &is_nil/1)or Enum.any?(pk_values, &is_nil/1)
   end
 

[Killed] ComparisonNegation
lib/ecto/changeset/relation.ex:409:15
   end
 
   defp missing_pks?(pk_values) do
-    pk_values == [] or Enum.any?(pk_values, &is_nil/1)
+    pk_values pk_values != []== [] or Enum.any?(pk_values, &is_nil/1)
   end
 

[Killed] Boolean
lib/ecto/changeset/relation.ex:423:25
   defp reduce_delete_changesets([struct | rest], fun, acc, valid?, _skip?) do
     case fun.(nil, struct, [:update, :delete], nil) do
       {:ok, changeset} ->
-        valid? = valid? and changeset.valid?
+        valid? = valid? valid? or changeset.valid?and changeset.valid?
         reduce_delete_changesets(rest, fun, [changeset | acc], valid?, false)
 

[Killed] ComparisonNegation
lib/ecto/changeset/relation.ex:443:14
       action in allowed_actions ->
         changeset
 
-      action == :ignore ->
+      action action != :ignore== :ignore ->
         changeset
 

[Killed] ComparisonNegation
lib/ecto/changeset/relation.ex:446:14
       action == :ignore ->
         changeset
 
-      action == :insert ->
+      action action != :insert== :insert ->
         raise "cannot insert related #{inspect changeset.data} " <>
                 "because it is already associated with the given struct"

[Killed] ComparisonNegation
lib/ecto/changeset/relation.ex:450:14
         raise "cannot insert related #{inspect changeset.data} " <>
                 "because it is already associated with the given struct"
 
-      action == :replace ->
+      action action != :replace== :replace ->
         raise "cannot replace related #{inspect changeset.data}. " <>
                 "This typically happens when you are calling put_assoc/put_embed " <>

[Killed] ComparisonNegation
lib/ecto/changeset/relation.ex:473:22
     {pks, {map, counter}} =
       Enum.map_reduce(current, {%{}, 0}, fn struct, {acc, counter} ->
         pks = get_pks.(struct)
-        key = if pks == [], do: map_size(acc), else: pks
+        key = if pks pks != []== [], do: map_size(acc), else: pks
         {pks, {Map.put(acc, key, struct), counter + 1}}
       end)

[Survived] Arithmetic
lib/ecto/changeset/relation.ex:474:51
       Enum.map_reduce(current, {%{}, 0}, fn struct, {acc, counter} ->
         pks = get_pks.(struct)
         key = if pks == [], do: map_size(acc), else: pks
-        {pks, {Map.put(acc, key, struct), counter + 1}}
+        {pks, {Map.put(acc, key, struct), counter counter * 1+ 1}}
       end)
 

[Survived] Arithmetic
lib/ecto/changeset/relation.ex:474:51
       Enum.map_reduce(current, {%{}, 0}, fn struct, {acc, counter} ->
         pks = get_pks.(struct)
         key = if pks == [], do: map_size(acc), else: pks
-        {pks, {Map.put(acc, key, struct), counter + 1}}
+        {pks, {Map.put(acc, key, struct), counter counter - 1+ 1}}
       end)
 

[Survived] ComparisonNegation
lib/ecto/changeset/relation.ex:477:22
         {pks, {Map.put(acc, key, struct), counter + 1}}
       end)
 
-    if map_size(map) != counter do
+    if map_size(map) map_size(map) == counter!= counter do
       Logger.warning """
       found duplicate primary keys for association/embed `#{inspect(relation.field)}` \

[Killed] GuardTypeTest
lib/ecto/changeset/relation.ex:499:16
   defp data_pk(pks) do
     fn
       %Changeset{data: data} -> Enum.map(pks, &Map.get(data, &1))
-      map when is_map(map) -> Enum.map(pks, &Map.get(map, &1))
+      map when is_list(map) -> Enum.map(pks, &Map.get(map, &1))
       list when is_list(list) -> Enum.map(pks, &Keyword.get(list, &1))
     end

[Killed] GuardTypeTest
lib/ecto/changeset/relation.ex:500:17
     fn
       %Changeset{data: data} -> Enum.map(pks, &Map.get(data, &1))
       map when is_map(map) -> Enum.map(pks, &Map.get(map, &1))
-      list when is_list(list) -> Enum.map(pks, &Keyword.get(list, &1))
+      list when is_tuple(list) -> Enum.map(pks, &Keyword.get(list, &1))
     end
   end

[Killed] Boolean
lib/ecto/changeset/relation.ex:508:48
     pks = Enum.map(pks, &{&1, Atom.to_string(&1), mod.__schema__(:type, &1)})
     fn params ->
       Enum.map pks, fn {atom_key, string_key, type} ->
-        original = Map.get(params, string_key) || Map.get(params, atom_key)
+        original = Map.get(params, string_key) Map.get(params, string_key) && Map.get(params, atom_key)|| Map.get(params, atom_key)
         case Ecto.Type.cast(type, original) do
           {:ok, value} -> value

[Killed] GuardTypeTest
lib/ecto/changeset/relation.ex:528:71
     end
   end
 
-  defp put_new_action(%{action: action} = changeset, new_action) when is_nil(action),
+  defp put_new_action(%{action: action} = changeset, new_action) when is_atom(action),
     do: Map.put(changeset, :action, new_action)
   defp put_new_action(changeset, _new_action),

[Killed] GuardComparisonNegation
lib/ecto/changeset/relation.ex:533:69
   defp put_new_action(changeset, _new_action),
     do: changeset
 
-  defp skip?(%{valid?: true, changes: empty, action: :update}) when empty == %{},
+  defp skip?(%{valid?: true, changes: empty, action: :update}) when empty != %{},
     do: true
   defp skip?(_changeset),

[Killed] GuardComparisonNegation
lib/ecto/changeset/relation.ex:559:37
             value = not_loaded_to_empty(Map.get(struct, field))
             empty = empty(embed_or_assoc)
             case change(embed_or_assoc, value, empty) do
-              {:ok, change, _} when change != empty ->
+              {:ok, change, _} when change == empty ->
                 {Map.put(changes, field, change), errors}
               {:error, error} ->

[Killed] GuardComparisonNegation
lib/ecto/changeset/relation.ex:568:56
             end
 
           # Struct has a non nil value
-          {%{^field => value}, _, %{^field => _}} when value != nil ->
+          {%{^field => value}, _, %{^field => _}} when value == nil ->
             {Map.put(changes, field, value), errors}
 
