[Killed] ComparisonNegation
mint/core/transport/ssl.ex:394:17
          :ok <- setopts(socket, active: false),
          :ok <- forward_messages_to_new_controlling_process(socket, pid),
          :ok <- wrap_err(:ssl.controlling_process(socket, pid)) do
-      if(active == :once, do: setopts(socket, active: :once), else: :ok)
+      if(active active != :once== :once, do: setopts(socket, active: :once), else: :ok)
     end
   end

[Killed] ComparisonNegation
mint/core/transport/ssl.ex:443:15
   defp add_verify_opts(opts, hostname) do
     verify = Keyword.get(opts, :verify)
 
-    if verify == :verify_peer do
+    if verify verify != :verify_peer== :verify_peer do
       opts
       |> add_cacerts()

[Killed] ComparisonBoundary
mint/core/transport/ssl.ex:470:22
   end
 
   defp customize_hostname_check(opts, host_or_ip) do
-    if ssl_version() >= [9, 0] do
+    if ssl_version() ssl_version() > [9, 0]>= [9, 0] do
       # From OTP 20.0 use built-in support for custom hostname checks
       add_customize_hostname_check(opts)

[Survived] ComparisonNegation
mint/core/transport/ssl.ex:470:22
   end
 
   defp customize_hostname_check(opts, host_or_ip) do
-    if ssl_version() >= [9, 0] do
+    if ssl_version() ssl_version() < [9, 0]>= [9, 0] do
       # From OTP 20.0 use built-in support for custom hostname checks
       add_customize_hostname_check(opts)

[Killed] ComparisonNegation
mint/core/transport/ssl.ex:511:42
   defp match_fun({:dns_id, reference}, {:dNSName, [?*, ?. | presented]}) do
     case domain_without_host(reference) do
       ~c"" -> :default
-      domain -> :string.casefold(domain) == :string.casefold(presented)
+      domain -> :string.casefold(domain) :string.casefold(domain) != :string.casefold(presented)== :string.casefold(presented)
     end
   end

[Survived] ComparisonNegation
mint/core/transport/ssl.ex:563:22
     versions = Enum.filter(@default_versions, &(&1 in available_versions))
 
     # Remove buggy TLS 1.3 versions
-    if ssl_version() < [10, 0] do
+    if ssl_version() ssl_version() >= [10, 0]< [10, 0] do
       versions -- [:"tlsv1.3"]
     else

[Survived] ComparisonBoundary
mint/core/transport/ssl.ex:563:22
     versions = Enum.filter(@default_versions, &(&1 in available_versions))
 
     # Remove buggy TLS 1.3 versions
-    if ssl_version() < [10, 0] do
+    if ssl_version() ssl_version() <= [10, 0]< [10, 0] do
       versions -- [:"tlsv1.3"]
     else

[Survived] Boolean
mint/core/transport/ssl.ex:571:44
   end
 
   defp add_cacerts(opts) do
-    if Keyword.has_key?(opts, :cacertfile) or Keyword.has_key?(opts, :cacerts) do
+    if Keyword.has_key?(opts, :cacertfile) Keyword.has_key?(opts, :cacertfile) and Keyword.has_key?(opts, :cacerts)or Keyword.has_key?(opts, :cacerts) do
       opts
     else

[Survived] ComparisonNegation
mint/core/transport/ssl.ex:642:45
       Enum.find_value(certs, fn {der, cert} ->
         trusted? =
           Enum.find(cacerts, fn cacert ->
-            extract_public_key_info(cacert) == extract_public_key_info(cert)
+            extract_public_key_info(cacert) extract_public_key_info(cacert) != extract_public_key_info(cert)== extract_public_key_info(cert)
           end)
 

[Killed] ComparisonNegation
mint/core/transport/ssl.ex:659:39
     now = DateTime.utc_now()
     {not_before, not_after} = extract_validity(cert)
 
-    DateTime.compare(now, not_before) == :lt or
+    DateTime.compare(now, not_before) DateTime.compare(now, not_before) != :lt== :lt or
       DateTime.compare(now, not_after) == :gt
   end

[Survived] Boolean
mint/core/transport/ssl.ex:659:46
     now = DateTime.utc_now()
     {not_before, not_after} = extract_validity(cert)
 
-    DateTime.compare(now, not_before) == :lt or
+    DateTime.compare(now, not_before) == :lt DateTime.compare(now, not_before) == :lt and
+  DateTime.compare(now, not_after) == :gtor
       DateTime.compare(now, not_after) == :gt
   end

[Killed] ComparisonNegation
mint/core/transport/ssl.ex:660:40
     {not_before, not_after} = extract_validity(cert)
 
     DateTime.compare(now, not_before) == :lt or
-      DateTime.compare(now, not_after) == :gt
+      DateTime.compare(now, not_after) DateTime.compare(now, not_after) != :gt== :gt
   end
 

[Killed] ComparisonNegation
mint/core/transport/ssl.ex:740:22
 
   @doc false
   def get_ciphers_for_versions(versions) do
-    if ssl_version() >= [8, 2, 4] do
+    if ssl_version() ssl_version() < [8, 2, 4]>= [8, 2, 4] do
       # :ssl.filter_cipher_suites/2 is available in ssl v8.2.4+
       versions

[Survived] ComparisonBoundary
mint/core/transport/ssl.ex:740:22
 
   @doc false
   def get_ciphers_for_versions(versions) do
-    if ssl_version() >= [8, 2, 4] do
+    if ssl_version() ssl_version() > [8, 2, 4]>= [8, 2, 4] do
       # :ssl.filter_cipher_suites/2 is available in ssl v8.2.4+
       versions
