[Killed] GuardTypeTest
lib/plug/basic_auth.ex:98:59
   """
   @spec basic_auth(Plug.Conn.t(), [auth_option]) :: Plug.Conn.t()
         when auth_option: {:username, String.t()} | {:password, String.t()} | {:realm, String.t()}
-  def basic_auth(%Plug.Conn{} = conn, options \\ []) when is_list(options) do
+  def basic_auth(%Plug.Conn{} = conn, options \\ []) when is_tuple(options) do
     username = Keyword.fetch!(options, :username)
     password = Keyword.fetch!(options, :password)

[Killed] Boolean
lib/plug/basic_auth.ex:105:34
     with {request_username, request_password} <- parse_basic_auth(conn),
          valid_username? = Plug.Crypto.secure_compare(username, request_username),
          valid_password? = Plug.Crypto.secure_compare(password, request_password),
-         true <- valid_username? and valid_password? do
+         true <- valid_username? valid_username? or valid_password?and valid_password? do
       conn
     else

[Killed] GuardTypeTest
lib/plug/basic_auth.ex:162:67
   """
   @spec request_basic_auth(Plug.Conn.t(), [option]) :: Plug.Conn.t()
         when option: {:realm, String.t()}
-  def request_basic_auth(%Plug.Conn{} = conn, options \\ []) when is_list(options) do
+  def request_basic_auth(%Plug.Conn{} = conn, options \\ []) when is_tuple(options) do
     realm = Keyword.get(options, :realm, "Application")
     escaped_realm = String.replace(realm, "\"", "")
