[Killed] ComparisonNegation
lib/ecto/embedded.ex:49:22
     cardinality = Keyword.fetch!(opts, :cardinality)
 
     on_replace_opts =
-      if cardinality == :one, do: @embeds_one_on_replace_opts, else: @on_replace_opts
+      if cardinality cardinality != :one== :one, do: @embeds_one_on_replace_opts, else: @on_replace_opts
 
     unless opts[:on_replace] in on_replace_opts do

[Killed] GuardTypeTest
lib/ecto/embedded.ex:64:82
   @impl Ecto.ParameterizedType
   def load(nil, _fun, %{cardinality: :one}), do: {:ok, nil}
 
-  def load(value, fun, %{cardinality: :one, related: schema, field: field}) when is_map(value) do
+  def load(value, fun, %{cardinality: :one, related: schema, field: field}) when is_list(value) do
     {:ok, load_field(field, schema, value, fun)}
   end

[Killed] GuardTypeTest
lib/ecto/embedded.ex:71:12
   def load(nil, _fun, %{cardinality: :many}), do: {:ok, []}
 
   def load(value, fun, %{cardinality: :many, related: schema, field: field})
-      when is_list(value) do
+      when is_tuple(value) do
     {:ok, Enum.map(value, &load_field(field, schema, &1, fun))}
   end

[Killed] GuardTypeTest
lib/ecto/embedded.ex:79:55
     :error
   end
 
-  defp load_field(_field, schema, value, loader) when is_map(value) do
+  defp load_field(_field, schema, value, loader) when is_list(value) do
     Ecto.Schema.Loader.unsafe_load(schema, value, loader)
   end

[Killed] GuardTypeTest
lib/ecto/embedded.ex:90:82
   @impl Ecto.ParameterizedType
   def dump(nil, _, _), do: {:ok, nil}
 
-  def dump(value, fun, %{cardinality: :one, related: schema, field: field}) when is_map(value) do
+  def dump(value, fun, %{cardinality: :one, related: schema, field: field}) when is_list(value) do
     {:ok, dump_field(field, schema, value, schema.__schema__(:dump), fun, _one_embed? = true)}
   end

[Killed] GuardTypeTest
lib/ecto/embedded.ex:95:12
   end
 
   def dump(value, fun, %{cardinality: :many, related: schema, field: field})
-      when is_list(value) do
+      when is_tuple(value) do
     types = schema.__schema__(:dump)
     {:ok, Enum.map(value, &dump_field(field, schema, &1, types, fun, _one_embed? = false))}

[Survived] GuardTypeTest
lib/ecto/embedded.ex:127:64
 
   def cast(nil, %{cardinality: :many}), do: {:ok, []}
 
-  def cast(value, %{cardinality: :many, related: schema}) when is_list(value) do
+  def cast(value, %{cardinality: :many, related: schema}) when is_tuple(value) do
     if Enum.all?(value, &Kernel.match?(%{__struct__: ^schema}, &1)) do
       {:ok, value}

[Killed] GuardComparisonNegation
lib/ecto/embedded.ex:155:68
     prepare(Map.take(changes, embeds), types, adapter, repo, repo_action)
   end
 
-  defp prepare(embeds, _types, _adapter, _repo, _repo_action) when embeds == %{} do
+  defp prepare(embeds, _types, _adapter, _repo, _repo_action) when embeds != %{} do
     embeds
   end

[Killed] GuardComparisonNegation
lib/ecto/embedded.ex:191:13
   end
 
   defp to_struct(%Changeset{data: %{__struct__: actual}}, _action, %{related: expected}, _adapter)
-       when actual != expected do
+       when actual == expected do
     raise ArgumentError,
           "expected changeset for embedded schema `#{inspect(expected)}`, " <>

[Killed] GuardComparisonNegation
lib/ecto/embedded.ex:198:13
   end
 
   defp to_struct(%Changeset{changes: changes, data: schema}, :update, _embed, _adapter)
-       when changes == %{} do
+       when changes != %{} do
     schema
   end
