[Killed] Boolean
lib/ecto/enum.ex:81:25
 
     {type, mappings} =
       cond do
-        is_list(values) and Enum.all?(values, &is_atom/1) ->
+        is_list(values) is_list(values) or Enum.all?(values, &is_atom/1)and Enum.all?(values, &is_atom/1) ->
           validate_unique!(values)
           {:string, Enum.map(values, fn atom -> {atom, to_string(atom)} end)}

[Killed] Boolean
lib/ecto/enum.ex:85:41
           validate_unique!(values)
           {:string, Enum.map(values, fn atom -> {atom, to_string(atom)} end)}
 
-        type = Keyword.keyword?(values) and infer_type(Keyword.values(values)) ->
+        type = Keyword.keyword?(values) Keyword.keyword?(values) or infer_type(Keyword.values(values))and infer_type(Keyword.values(values)) ->
           validate_unique!(Keyword.keys(values))
           validate_unique!(Keyword.values(values))

[Killed] ComparisonNegation
lib/ecto/enum.ex:135:34
   end
 
   defp validate_unique!(values) do
-    if length(Enum.uniq(values)) != length(values) do
+    if length(Enum.uniq(values)) length(Enum.uniq(values)) == length(values)!= length(values) do
       raise ArgumentError, """
       Ecto.Enum type values must be unique.

[Killed] ComparisonNegation
lib/ecto/enum.ex:200:36
   end
 
   @impl true
-  def equal?(a, b, _params), do: a == b
+  def equal?(a, b, _params), do: a a != b== b
 
   @impl true

[Killed] GuardTypeTest
lib/ecto/enum.ex:374:39
 
   defp get_params(schema_or_types, field)
 
-  defp get_params(schema, field) when is_atom(schema) do
+  defp get_params(schema, field) when is_nil(schema) do
     try do
       schema.__changeset__()

[Killed] GuardTypeTest
lib/ecto/enum.ex:385:38
     end
   end
 
-  defp get_params(types, field) when is_map(types) do
+  defp get_params(types, field) when is_list(types) do
     case types do
       %{^field => {:parameterized, {Ecto.Enum, params}}} -> params
