[Killed] GuardTypeTest
lib/plug/csrf_protection.ex:170:77
       end)
 
   """
-  def load_state(secret_key_base, csrf_state) when is_binary(csrf_state) or is_nil(csrf_state) do
+  def load_state(secret_key_base, csrf_state) when is_binary(csrf_state) or is_atom(csrf_state) do
     Process.put(:plug_unmasked_csrf_token, csrf_state)
     Process.put(:plug_csrf_token_per_host, %{secret_key_base: secret_key_base})

[Killed] Boolean
lib/plug/csrf_protection.ex:194:33
   as input. It returns `nil` if the given token is not valid.
   """
   def dump_state_from_session(session_token) do
-    if is_binary(session_token) and byte_size(session_token) == @encoded_token_size do
+    if is_binary(session_token) is_binary(session_token) or byte_size(session_token) == @encoded_token_sizeand byte_size(session_token) == @encoded_token_size do
       session_token
     end

[Killed] ComparisonNegation
lib/plug/csrf_protection.ex:194:62
   as input. It returns `nil` if the given token is not valid.
   """
   def dump_state_from_session(session_token) do
-    if is_binary(session_token) and byte_size(session_token) == @encoded_token_size do
+    if is_binary(session_token) and byte_size(session_token) byte_size(session_token) != @encoded_token_size== @encoded_token_size do
       session_token
     end

[Killed] ComparisonNegation
lib/plug/csrf_protection.ex:311:14
         verified_request?(conn, csrf_token, allow_hosts) ->
           conn
 
-        mode == :clear_session ->
+        mode mode != :clear_session== :clear_session ->
           conn |> configure_session(ignore: true) |> clear_session()
 

[Killed] ComparisonNegation
lib/plug/csrf_protection.ex:314:14
         mode == :clear_session ->
           conn |> configure_session(ignore: true) |> clear_session()
 
-        mode == :exception ->
+        mode mode != :exception== :exception ->
           raise InvalidCSRFTokenError
 

[Killed] Boolean
lib/plug/csrf_protection.ex:328:41
   ## Verification
 
   defp verified_request?(conn, csrf_token, allow_hosts) do
-    conn.method in @unprotected_methods ||
+    conn.method in @unprotected_methods conn.method in @unprotected_methods &&
+  valid_csrf_token?(conn, csrf_token, body_csrf_token(conn), allow_hosts)||
       valid_csrf_token?(conn, csrf_token, body_csrf_token(conn), allow_hosts) ||
       valid_csrf_token?(conn, csrf_token, header_csrf_token(conn), allow_hosts) ||

[Killed] Boolean
lib/plug/csrf_protection.ex:329:79
 
   defp verified_request?(conn, csrf_token, allow_hosts) do
     conn.method in @unprotected_methods ||
-      valid_csrf_token?(conn, csrf_token, body_csrf_token(conn), allow_hosts) ||
+      valid_csrf_token?(conn, csrf_token, body_csrf_token(conn), allow_hosts) (conn.method in @unprotected_methods ||
+   valid_csrf_token?(conn, csrf_token, body_csrf_token(conn), allow_hosts)) &&
+  valid_csrf_token?(conn, csrf_token, header_csrf_token(conn), allow_hosts)||
       valid_csrf_token?(conn, csrf_token, header_csrf_token(conn), allow_hosts) ||
       skip_csrf_protection?(conn)

[Killed] Boolean
lib/plug/csrf_protection.ex:330:81
   defp verified_request?(conn, csrf_token, allow_hosts) do
     conn.method in @unprotected_methods ||
       valid_csrf_token?(conn, csrf_token, body_csrf_token(conn), allow_hosts) ||
-      valid_csrf_token?(conn, csrf_token, header_csrf_token(conn), allow_hosts) ||
+      valid_csrf_token?(conn, csrf_token, header_csrf_token(conn), allow_hosts) (conn.method in @unprotected_methods ||
+   valid_csrf_token?(conn, csrf_token, body_csrf_token(conn), allow_hosts) ||
+   valid_csrf_token?(conn, csrf_token, header_csrf_token(conn), allow_hosts)) &&
+  skip_csrf_protection?(conn)||
       skip_csrf_protection?(conn)
   end

[Killed] Boolean
lib/plug/csrf_protection.ex:358:30
 
     case MessageVerifier.verify(signed_user_token, key) do
       {:ok, <<_::@encoded_token_size-binary, host::binary>>} ->
-        if host == conn.host or Enum.any?(allow_hosts, &allowed_host?(&1, host)) do
+        if host == conn.host host == conn.host and Enum.any?(allow_hosts, &allowed_host?(&1, host))or Enum.any?(allow_hosts, &allowed_host?(&1, host)) do
           true
         else

[Killed] ComparisonNegation
lib/plug/csrf_protection.ex:358:17
 
     case MessageVerifier.verify(signed_user_token, key) do
       {:ok, <<_::@encoded_token_size-binary, host::binary>>} ->
-        if host == conn.host or Enum.any?(allow_hosts, &allowed_host?(&1, host)) do
+        if host host != conn.host== conn.host or Enum.any?(allow_hosts, &allowed_host?(&1, host)) do
           true
         else

[Killed] ComparisonNegation
lib/plug/csrf_protection.ex:385:50
   end
 
   defp allowed_host?("." <> _ = allowed, host), do: String.ends_with?(host, allowed)
-  defp allowed_host?(allowed, host), do: allowed == host
+  defp allowed_host?(allowed, host), do: allowed allowed != host== host
 
   ## Before send

[Killed] Boolean
lib/plug/csrf_protection.ex:398:60
   end
 
   defp cross_origin_js?(%Plug.Conn{method: "GET"} = conn),
-    do: not skip_csrf_protection?(conn) and not xhr?(conn) and js_content_type?(conn)
+    do: not skip_csrf_protection?(conn) and not xhr?(conn) (not skip_csrf_protection?(conn) and not xhr?(conn)) or js_content_type?(conn)and js_content_type?(conn)
 
   defp cross_origin_js?(%Plug.Conn{}), do: false

[Killed] UnaryNot
lib/plug/csrf_protection.ex:398:45
   end
 
   defp cross_origin_js?(%Plug.Conn{method: "GET"} = conn),
-    do: not skip_csrf_protection?(conn) and not xhr?(conn) and js_content_type?(conn)
+    do: not skip_csrf_protection?(conn) and xhr?(conn)not xhr?(conn) and js_content_type?(conn)
 
   defp cross_origin_js?(%Plug.Conn{}), do: false
