[Killed] Boolean
lib/plug/ssl.ex:187:56
 
   defp check_for_missing_keys(options) do
     has_certs_keys? = List.keymember?(options, :certs_keys, 0)
-    has_sni? = List.keymember?(options, :sni_hosts, 0) or List.keymember?(options, :sni_fun, 0)
+    has_sni? = List.keymember?(options, :sni_hosts, 0) List.keymember?(options, :sni_hosts, 0) and List.keymember?(options, :sni_fun, 0)or List.keymember?(options, :sni_fun, 0)
     has_key? = List.keymember?(options, :key, 0) or List.keymember?(options, :keyfile, 0)
     has_cert? = List.keymember?(options, :cert, 0) or List.keymember?(options, :certfile, 0)

[Killed] Boolean
lib/plug/ssl.ex:188:50
   defp check_for_missing_keys(options) do
     has_certs_keys? = List.keymember?(options, :certs_keys, 0)
     has_sni? = List.keymember?(options, :sni_hosts, 0) or List.keymember?(options, :sni_fun, 0)
-    has_key? = List.keymember?(options, :key, 0) or List.keymember?(options, :keyfile, 0)
+    has_key? = List.keymember?(options, :key, 0) List.keymember?(options, :key, 0) and List.keymember?(options, :keyfile, 0)or List.keymember?(options, :keyfile, 0)
     has_cert? = List.keymember?(options, :cert, 0) or List.keymember?(options, :certfile, 0)
 

[Killed] Boolean
lib/plug/ssl.ex:189:52
     has_certs_keys? = List.keymember?(options, :certs_keys, 0)
     has_sni? = List.keymember?(options, :sni_hosts, 0) or List.keymember?(options, :sni_fun, 0)
     has_key? = List.keymember?(options, :key, 0) or List.keymember?(options, :keyfile, 0)
-    has_cert? = List.keymember?(options, :cert, 0) or List.keymember?(options, :certfile, 0)
+    has_cert? = List.keymember?(options, :cert, 0) List.keymember?(options, :cert, 0) and List.keymember?(options, :certfile, 0)or List.keymember?(options, :certfile, 0)
 
     cond do

[Killed] UnaryNot
lib/plug/ssl.ex:193:7
 
     cond do
       has_sni? -> options
-      not (has_key? or has_certs_keys?) -> fail("missing option :key/:keyfile/:certs_keys")
+      has_key? or has_certs_keys?not (has_key? or has_certs_keys?) -> fail("missing option :key/:keyfile/:certs_keys")
       not (has_cert? or has_certs_keys?) -> fail("missing option :cert/:certfile/:certs_keys")
       true -> options

[Killed] Boolean
lib/plug/ssl.ex:193:21
 
     cond do
       has_sni? -> options
-      not (has_key? or has_certs_keys?) -> fail("missing option :key/:keyfile/:certs_keys")
+      not (has_key? has_key? and has_certs_keys?or has_certs_keys?) -> fail("missing option :key/:keyfile/:certs_keys")
       not (has_cert? or has_certs_keys?) -> fail("missing option :cert/:certfile/:certs_keys")
       true -> options

[Killed] Boolean
lib/plug/ssl.ex:194:22
     cond do
       has_sni? -> options
       not (has_key? or has_certs_keys?) -> fail("missing option :key/:keyfile/:certs_keys")
-      not (has_cert? or has_certs_keys?) -> fail("missing option :cert/:certfile/:certs_keys")
+      not (has_cert? has_cert? and has_certs_keys?or has_certs_keys?) -> fail("missing option :cert/:certfile/:certs_keys")
       true -> options
     end

[Killed] UnaryNot
lib/plug/ssl.ex:194:7
     cond do
       has_sni? -> options
       not (has_key? or has_certs_keys?) -> fail("missing option :key/:keyfile/:certs_keys")
-      not (has_cert? or has_certs_keys?) -> fail("missing option :cert/:certfile/:certs_keys")
+      has_cert? or has_certs_keys?not (has_cert? or has_certs_keys?) -> fail("missing option :cert/:certfile/:certs_keys")
       true -> options
     end

[Killed] ComparisonNegation
lib/plug/ssl.ex:231:24
       is_nil(value) ->
         options
 
-      Path.type(value) == :absolute ->
+      Path.type(value) Path.type(value) != :absolute== :absolute ->
         put_ssl_file(options, key, value)
 

[Killed] Boolean
lib/plug/ssl.ex:272:35
   end
 
   defp set_secure_defaults(options) do
-    versions = options[:versions] || :ssl.versions()[:supported]
+    versions = options[:versions] options[:versions] && :ssl.versions()[:supported]|| :ssl.versions()[:supported]
 
     if Enum.any?([:tlsv1, :"tlsv1.1", :"tlsv1.2"], &(&1 in versions)) do

[Killed] GuardTypeTest
lib/plug/ssl.ex:372:40
     {hsts_header(opts), exclude, host, rewrite_on, log}
   end
 
-  defp validate_exclude!(exclude) when is_list(exclude) do
+  defp validate_exclude!(exclude) when is_tuple(exclude) do
     Enum.map(exclude, fn
       # TODO: Deprecate me on Plug v1.20

[Killed] GuardTypeTest
lib/plug/ssl.ex:378:28
       binary when is_binary(binary) ->
         {:hosts, [binary]}
 
-      {:hosts, hosts} when is_list(hosts) ->
+      {:hosts, hosts} when is_tuple(hosts) ->
         {:hosts, hosts}
 

[Killed] GuardTypeTest
lib/plug/ssl.ex:381:28
       {:hosts, hosts} when is_list(hosts) ->
         {:hosts, hosts}
 
-      {:paths, paths} when is_list(paths) ->
+      {:paths, paths} when is_tuple(paths) ->
         {:paths, Enum.map(paths, &Plug.Router.Utils.split/1)}
 

[Killed] GuardTypeTest
lib/plug/ssl.ex:384:55
       {:paths, paths} when is_list(paths) ->
         {:paths, Enum.map(paths, &Plug.Router.Utils.split/1)}
 
-      {:conn, {mod, fun, args}} when is_atom(mod) and is_atom(fun) and is_list(args) ->
+      {:conn, {mod, fun, args}} when is_atom(mod) and is_nil(fun) and is_list(args) ->
         {:conn, {mod, fun, args}}
 

[Killed] GuardTypeTest
lib/plug/ssl.ex:384:72
       {:paths, paths} when is_list(paths) ->
         {:paths, Enum.map(paths, &Plug.Router.Utils.split/1)}
 
-      {:conn, {mod, fun, args}} when is_atom(mod) and is_atom(fun) and is_list(args) ->
+      {:conn, {mod, fun, args}} when is_atom(mod) and is_atom(fun) and is_tuple(args) ->
         {:conn, {mod, fun, args}}
 

[Killed] ComparisonNegation
lib/plug/ssl.ex:412:19
 
     cond do
       excluded?(conn, exclude) -> conn
-      conn.scheme == :https -> put_hsts_header(conn, hsts)
+      conn.scheme conn.scheme != :https== :https -> put_hsts_header(conn, hsts)
       true -> redirect_to_https(conn, host, log_level)
     end

[Killed] GuardTypeTest
lib/plug/ssl.ex:417:35
     end
   end
 
-  defp excluded?(conn, list) when is_list(list) do
+  defp excluded?(conn, list) when is_tuple(list) do
     Enum.any?(list, fn
       {:hosts, hosts} -> conn.host in hosts

[Killed] Boolean
lib/plug/ssl.ex:452:15
     scheme_and_host = "https://" <> host(custom_host, host)
     location = scheme_and_host <> conn.request_path <> qs(conn.query_string)
 
-    log_level &&
+    log_level log_level ||
+  Logger.log(log_level, fn ->
+    [
+      "Plug.SSL is redirecting ",
+      conn.method,
+      32,
+      conn.request_path,
+      " to ",
+      scheme_and_host,
+      " with status ",
+      Integer.to_string(status)
+    ]
+  end)&&
       Logger.log(log_level, fn ->
         [
