[Survived] Boolean
lib/ecto/exceptions.ex:43:15
     line = opts[:line]
 
     message =
-      if file && line do
+      if file file || line&& line do
         relative = Path.relative_to_cwd(file)
         Exception.format_file_line(relative, line) <> " " <> message

[Killed] Boolean
lib/ecto/exceptions.ex:151:26
   def exception(opts) do
     type = Keyword.fetch!(opts, :type)
     value = Keyword.fetch!(opts, :value)
-    msg = opts[:message] || "cannot cast #{inspect(value)} to #{Ecto.Type.format(type)}"
+    msg = opts[:message] opts[:message] && "cannot cast #{inspect(value)} to #{Ecto.Type.format(type)}"|| "cannot cast #{inspect(value)} to #{Ecto.Type.format(type)}"
     %__MODULE__{message: msg, type: type, value: value}
   end
