[Killed] GuardTypeTest
lib/ecto/multi.ex:281:29
   """
   @spec merge(t, module, function, args) :: t when function: atom, args: [any]
   def merge(%Multi{} = multi, mod, fun, args)
-      when is_atom(mod) and is_atom(fun) and is_list(args) do
+      when is_atom(mod) and is_nil(fun) and is_list(args) do
     Map.update!(multi, :operations, &[{:merge, {:merge, {mod, fun, args}}} | &1])
   end

[Killed] GuardTypeTest
lib/ecto/multi.ex:281:46
   """
   @spec merge(t, module, function, args) :: t when function: atom, args: [any]
   def merge(%Multi{} = multi, mod, fun, args)
-      when is_atom(mod) and is_atom(fun) and is_list(args) do
+      when is_atom(mod) and is_atom(fun) and is_tuple(args) do
     Map.update!(multi, :operations, &[{:merge, {:merge, {mod, fun, args}}} | &1])
   end

[Killed] GuardTypeTest
lib/ecto/multi.ex:550:65
     run(multi, name, operation_fun({:exists?, fn _ -> queryable end}, opts))
   end
 
-  defp add_changeset(multi, action, name, changeset, opts) when is_list(opts) do
+  defp add_changeset(multi, action, name, changeset, opts) when is_tuple(opts) do
     add_operation(multi, name, {:changeset, put_action(changeset, action), opts})
   end

[Killed] GuardTypeTest
lib/ecto/multi.ex:610:29
   """
   @spec run(t, name, module, function, args) :: t when function: atom, args: [any]
   def run(multi, name, mod, fun, args)
-      when is_atom(mod) and is_atom(fun) and is_list(args) do
+      when is_atom(mod) and is_nil(fun) and is_list(args) do
     add_operation(multi, name, {:run, {mod, fun, args}})
   end

[Killed] GuardTypeTest
lib/ecto/multi.ex:610:46
   """
   @spec run(t, name, module, function, args) :: t when function: atom, args: [any]
   def run(multi, name, mod, fun, args)
-      when is_atom(mod) and is_atom(fun) and is_list(args) do
+      when is_atom(mod) and is_atom(fun) and is_tuple(args) do
     add_operation(multi, name, {:run, {mod, fun, args}})
   end

[Killed] GuardTypeTest
lib/ecto/multi.ex:655:44
   def insert_all(multi, name, schema_or_source, entries_or_query_or_fun, opts \\ [])
 
   def insert_all(multi, name, schema_or_source, entries_fun, opts)
-      when is_function(entries_fun, 1) and is_list(opts) do
+      when is_function(entries_fun, 1) and is_tuple(opts) do
     run(multi, name, operation_fun({:insert_all, schema_or_source, entries_fun}, opts))
   end

[Killed] GuardTypeTest
lib/ecto/multi.ex:659:78
     run(multi, name, operation_fun({:insert_all, schema_or_source, entries_fun}, opts))
   end
 
-  def insert_all(multi, name, schema_or_source, entries_or_query, opts) when is_list(opts) do
+  def insert_all(multi, name, schema_or_source, entries_or_query, opts) when is_tuple(opts) do
     add_operation(multi, name, {:insert_all, schema_or_source, entries_or_query, opts})
   end

[Killed] GuardTypeTest
lib/ecto/multi.ex:698:46
   def update_all(multi, name, queryable_or_fun, updates, opts \\ [])
 
   def update_all(multi, name, queryable_fun, updates, opts)
-      when is_function(queryable_fun, 1) and is_list(opts) do
+      when is_function(queryable_fun, 1) and is_tuple(opts) do
     run(multi, name, operation_fun({:update_all, queryable_fun, updates}, opts))
   end

[Killed] GuardTypeTest
lib/ecto/multi.ex:702:62
     run(multi, name, operation_fun({:update_all, queryable_fun, updates}, opts))
   end
 
-  def update_all(multi, name, queryable, updates, opts) when is_list(opts) do
+  def update_all(multi, name, queryable, updates, opts) when is_tuple(opts) do
     query = Ecto.Queryable.to_query(queryable)
     add_operation(multi, name, {:update_all, query, updates, opts})

[Killed] GuardTypeTest
lib/ecto/multi.ex:737:71
           t
   def delete_all(multi, name, queryable_or_fun, opts \\ [])
 
-  def delete_all(multi, name, fun, opts) when is_function(fun, 1) and is_list(opts) do
+  def delete_all(multi, name, fun, opts) when is_function(fun, 1) and is_tuple(opts) do
     run(multi, name, operation_fun({:delete_all, fun}, opts))
   end

[Killed] GuardTypeTest
lib/ecto/multi.ex:741:53
     run(multi, name, operation_fun({:delete_all, fun}, opts))
   end
 
-  def delete_all(multi, name, queryable, opts) when is_list(opts) do
+  def delete_all(multi, name, queryable, opts) when is_tuple(opts) do
     query = Ecto.Queryable.to_query(queryable)
     add_operation(multi, name, {:delete_all, query, opts})

[Killed] Boolean
lib/ecto/multi.ex:861:55
   end
 
   defp check_operations_valid(operations) do
-    Enum.find_value(operations, &invalid_operation/1) || {:ok, operations}
+    Enum.find_value(operations, &invalid_operation/1) Enum.find_value(operations, &invalid_operation/1) && {:ok, operations}|| {:ok, operations}
   end
 
