[Killed] GuardTypeTest
lib/plug/crypto.ex:23:51
   def prune_args_from_stacktrace([{mod, fun, [_ | _] = args, info} | rest]),
     do: [{mod, fun, length(args), info} | rest]
 
-  def prune_args_from_stacktrace(stacktrace) when is_list(stacktrace),
+  def prune_args_from_stacktrace(stacktrace) when is_tuple(stacktrace),
     do: stacktrace
 

[Killed] GuardTypeTest
lib/plug/crypto.ex:48:40
     term
   end
 
-  defp non_executable_terms(list) when is_list(list) do
+  defp non_executable_terms(list) when is_tuple(list) do
     non_executable_list(list)
   end

[Killed] GuardTypeTest
lib/plug/crypto.ex:52:41
     non_executable_list(list)
   end
 
-  defp non_executable_terms(tuple) when is_tuple(tuple) do
+  defp non_executable_terms(tuple) when is_list(tuple) do
     non_executable_tuple(tuple, tuple_size(tuple))
   end

[Killed] GuardTypeTest
lib/plug/crypto.ex:56:39
     non_executable_tuple(tuple, tuple_size(tuple))
   end
 
-  defp non_executable_terms(map) when is_map(map) do
+  defp non_executable_terms(map) when is_list(map) do
     folder = fn key, value, acc ->
       non_executable_terms(key)

[Killed] GuardTypeTest
lib/plug/crypto.ex:67:31
   end
 
   defp non_executable_terms(other)
-       when is_atom(other) or is_number(other) or is_bitstring(other) or is_pid(other) or
+       when is_atom(other) or is_integer(other) or is_bitstring(other) or is_pid(other) or
               is_reference(other) do
     other

[Killed] GuardTypeTest
lib/plug/crypto.ex:67:31
   end
 
   defp non_executable_terms(other)
-       when is_atom(other) or is_number(other) or is_bitstring(other) or is_pid(other) or
+       when is_atom(other) or is_float(other) or is_bitstring(other) or is_pid(other) or
               is_reference(other) do
     other

[Survived] GuardTypeTest
lib/plug/crypto.ex:79:42
 
   defp non_executable_list([]), do: :ok
 
-  defp non_executable_list([h | t]) when is_list(t) do
+  defp non_executable_list([h | t]) when is_tuple(t) do
     non_executable_terms(h)
     non_executable_list(t)

[Killed] Arithmetic
lib/plug/crypto.ex:93:35
 
   defp non_executable_tuple(tuple, n) do
     non_executable_terms(:erlang.element(n, tuple))
-    non_executable_tuple(tuple, n - 1)
+    non_executable_tuple(tuple, n n * 1- 1)
   end
 

[Killed] Arithmetic
lib/plug/crypto.ex:93:35
 
   defp non_executable_tuple(tuple, n) do
     non_executable_terms(:erlang.element(n, tuple))
-    non_executable_tuple(tuple, n - 1)
+    non_executable_tuple(tuple, n n + 1- 1)
   end
 

[Killed] ComparisonNegation
lib/plug/crypto.ex:115:21
   @spec masked_compare(binary(), binary(), binary()) :: boolean()
   def masked_compare(left, right, mask)
       when is_binary(left) and is_binary(right) and is_binary(mask) do
-    byte_size(left) == byte_size(right) and byte_size(right) == byte_size(mask) and
+    byte_size(left) byte_size(left) != byte_size(right)== byte_size(right) and byte_size(right) == byte_size(mask) and
       crypto_exor_hash_equals(left, right, mask)
   end

[Killed] Boolean
lib/plug/crypto.ex:115:41
   @spec masked_compare(binary(), binary(), binary()) :: boolean()
   def masked_compare(left, right, mask)
       when is_binary(left) and is_binary(right) and is_binary(mask) do
-    byte_size(left) == byte_size(right) and byte_size(right) == byte_size(mask) and
+    byte_size(left) == byte_size(right) byte_size(left) == byte_size(right) or byte_size(right) == byte_size(mask)and byte_size(right) == byte_size(mask) and
       crypto_exor_hash_equals(left, right, mask)
   end

[Killed] Boolean
lib/plug/crypto.ex:130:41
   """
   @spec secure_compare(binary(), binary()) :: boolean()
   def secure_compare(left, right) when is_binary(left) and is_binary(right) do
-    byte_size(left) == byte_size(right) and crypto_hash_equals(left, right)
+    byte_size(left) == byte_size(right) byte_size(left) == byte_size(right) or crypto_hash_equals(left, right)and crypto_hash_equals(left, right)
   end
 

[Killed] ComparisonNegation
lib/plug/crypto.ex:130:21
   """
   @spec secure_compare(binary(), binary()) :: boolean()
   def secure_compare(left, right) when is_binary(left) and is_binary(right) do
-    byte_size(left) == byte_size(right) and crypto_hash_equals(left, right)
+    byte_size(left) byte_size(left) != byte_size(right)== byte_size(right) and crypto_hash_equals(left, right)
   end
 

[Survived] Boolean
lib/plug/crypto.ex:134:35
   end
 
   # TODO: remove when we require OTP 25.0
-  if Code.ensure_loaded?(:crypto) and function_exported?(:crypto, :hash_equals, 2) do
+  if Code.ensure_loaded?(:crypto) Code.ensure_loaded?(:crypto) or function_exported?(:crypto, :hash_equals, 2)and function_exported?(:crypto, :hash_equals, 2) do
     defp crypto_hash_equals(x, y) do
       # Depending on the linked OpenSSL library hash_equals is available.

[Survived] ComparisonNegation
lib/plug/crypto.ex:159:9
   end
 
   defp legacy_secure_compare(<<>>, <<>>, acc) do
-    acc === 0
+    acc acc !== 0=== 0
   end
 

[Killed] Arithmetic
lib/plug/crypto.ex:221:70
 
   defp encode(data, opts) do
     signed_at_seconds = Keyword.get(opts, :signed_at)
-    signed_at_ms = if signed_at_seconds, do: trunc(signed_at_seconds * 1000), else: now_ms()
+    signed_at_ms = if signed_at_seconds, do: trunc(signed_at_seconds signed_at_seconds + 1000* 1000), else: now_ms()
     max_age_in_seconds = Keyword.get(opts, :max_age, 86400)
     :erlang.term_to_binary({data, signed_at_ms, max_age_in_seconds})

[Killed] Arithmetic
lib/plug/crypto.ex:221:70
 
   defp encode(data, opts) do
     signed_at_seconds = Keyword.get(opts, :signed_at)
-    signed_at_ms = if signed_at_seconds, do: trunc(signed_at_seconds * 1000), else: now_ms()
+    signed_at_ms = if signed_at_seconds, do: trunc(signed_at_seconds signed_at_seconds - 1000* 1000), else: now_ms()
     max_age_in_seconds = Keyword.get(opts, :max_age, 86400)
     :erlang.term_to_binary({data, signed_at_ms, max_age_in_seconds})

[Killed] GuardTypeTest
lib/plug/crypto.ex:312:58
   def decrypt(key_base, secret, token, opts \\ [])
 
   def decrypt(key_base, secret, nil, opts)
-      when is_binary(key_base) and is_binary(secret) and is_list(opts) do
+      when is_binary(key_base) and is_binary(secret) and is_tuple(opts) do
     {:error, :missing}
   end

[Killed] GuardTypeTest
lib/plug/crypto.ex:317:58
   end
 
   def decrypt(key_base, secret, token, opts)
-      when is_binary(key_base) and is_binary(secret) and is_list(opts) do
+      when is_binary(key_base) and is_binary(secret) and is_tuple(opts) do
     secret = get_secret(key_base, secret, opts)
 

[Killed] GuardComparisonNegation
lib/plug/crypto.ex:355:45
   end
 
   defp expired?(_signed, :infinity), do: false
-  defp expired?(_signed, max_age_secs) when max_age_secs <= 0, do: true
+  defp expired?(_signed, max_age_secs) when max_age_secs > 0, do: true
   defp expired?(signed, max_age_secs), do: signed + trunc(max_age_secs * 1000) < now_ms()
 

[Survived] GuardComparisonBoundary
lib/plug/crypto.ex:355:45
   end
 
   defp expired?(_signed, :infinity), do: false
-  defp expired?(_signed, max_age_secs) when max_age_secs <= 0, do: true
+  defp expired?(_signed, max_age_secs) when max_age_secs < 0, do: true
   defp expired?(signed, max_age_secs), do: signed + trunc(max_age_secs * 1000) < now_ms()
 

[Killed] Arithmetic
lib/plug/crypto.ex:356:72
 
   defp expired?(_signed, :infinity), do: false
   defp expired?(_signed, max_age_secs) when max_age_secs <= 0, do: true
-  defp expired?(signed, max_age_secs), do: signed + trunc(max_age_secs * 1000) < now_ms()
+  defp expired?(signed, max_age_secs), do: signed + trunc(max_age_secs max_age_secs - 1000* 1000) < now_ms()
 
   defp now_ms, do: System.os_time(:millisecond)

[Killed] Arithmetic
lib/plug/crypto.ex:356:51
 
   defp expired?(_signed, :infinity), do: false
   defp expired?(_signed, max_age_secs) when max_age_secs <= 0, do: true
-  defp expired?(signed, max_age_secs), do: signed + trunc(max_age_secs * 1000) < now_ms()
+  defp expired?(signed, max_age_secs), do: signed signed * trunc(max_age_secs * 1000)+ trunc(max_age_secs * 1000) < now_ms()
 
   defp now_ms, do: System.os_time(:millisecond)
