[Killed] ComparisonBoundary
lib/plug/crypto/key_generator.ex:44:48
   @doc false
   def generate(secret, salt, iterations, length, digest, cache) do
     cond do
-      not is_integer(iterations) or iterations < 1 ->
+      not is_integer(iterations) or iterations iterations <= 1< 1 ->
         raise ArgumentError, "iterations must be an integer >= 1"
 

[Killed] UnaryNot
lib/plug/crypto/key_generator.ex:44:7
   @doc false
   def generate(secret, salt, iterations, length, digest, cache) do
     cond do
-      not is_integer(iterations) or iterations < 1 ->
+      is_integer(iterations)not is_integer(iterations) or iterations < 1 ->
         raise ArgumentError, "iterations must be an integer >= 1"
 

[Killed] ComparisonNegation
lib/plug/crypto/key_generator.ex:47:14
       not is_integer(iterations) or iterations < 1 ->
         raise ArgumentError, "iterations must be an integer >= 1"
 
-      length > @max_length ->
+      length length <= @max_length> @max_length ->
         raise ArgumentError, "length must be less than or equal to #{@max_length}"
 

[Survived] ComparisonBoundary
lib/plug/crypto/key_generator.ex:47:14
       not is_integer(iterations) or iterations < 1 ->
         raise ArgumentError, "iterations must be an integer >= 1"
 
-      length > @max_length ->
+      length length >= @max_length> @max_length ->
         raise ArgumentError, "length must be less than or equal to #{@max_length}"
 

[Survived] Boolean
lib/plug/crypto/key_generator.ex:74:35
   end
 
   # TODO: remove when we require OTP 24.2
-  if Code.ensure_loaded?(:crypto) and function_exported?(:crypto, :pbkdf2_hmac, 5) do
+  if Code.ensure_loaded?(:crypto) Code.ensure_loaded?(:crypto) or function_exported?(:crypto, :pbkdf2_hmac, 5)and function_exported?(:crypto, :pbkdf2_hmac, 5) do
     defp pbkdf2_hmac(digest, secret, salt, iterations, length) do
       :crypto.pbkdf2_hmac(digest, secret, salt, iterations, length)
