[Killed] ComparisonNegation
ecto/query/builder/dynamic.ex:75:19
     {expr, {_binding, params, subqueries, _aliases, count}} =
       expand(query, dynamic, {binding, params, [], %{}, count})
 
-    if subqueries != [] do
+    if subqueries subqueries == []!= [] do
       raise ArgumentError, "subqueries are not allowed in `#{kind}` expressions"
     end

[Killed] ComparisonNegation
ecto/query/builder/dynamic.ex:90:46
       {:^, meta, [ix]}, {binding, params, subqueries, aliases, count} ->
         case Enum.fetch!(dynamic_params, ix) do
           {%Ecto.Query.DynamicExpr{binding: new_binding} = dynamic, _} ->
-            binding = if length(new_binding) > length(binding), do: new_binding, else: binding
+            binding = if length(new_binding) length(new_binding) <= length(binding)> length(binding), do: new_binding, else: binding
             expand(query, dynamic, {binding, params, subqueries, aliases, count})
 

[Survived] ComparisonBoundary
ecto/query/builder/dynamic.ex:90:46
       {:^, meta, [ix]}, {binding, params, subqueries, aliases, count} ->
         case Enum.fetch!(dynamic_params, ix) do
           {%Ecto.Query.DynamicExpr{binding: new_binding} = dynamic, _} ->
-            binding = if length(new_binding) > length(binding), do: new_binding, else: binding
+            binding = if length(new_binding) length(new_binding) >= length(binding)> length(binding), do: new_binding, else: binding
             expand(query, dynamic, {binding, params, subqueries, aliases, count})
 

[Killed] Arithmetic
ecto/query/builder/dynamic.ex:94:90
             expand(query, dynamic, {binding, params, subqueries, aliases, count})
 
           param ->
-            {{:^, meta, [count]}, {binding, [param | params], subqueries, aliases, count + 1}}
+            {{:^, meta, [count]}, {binding, [param | params], subqueries, aliases, count count - 1+ 1}}
         end
 

[Killed] Arithmetic
ecto/query/builder/dynamic.ex:94:90
             expand(query, dynamic, {binding, params, subqueries, aliases, count})
 
           param ->
-            {{:^, meta, [count]}, {binding, [param | params], subqueries, aliases, count + 1}}
+            {{:^, meta, [count]}, {binding, [param | params], subqueries, aliases, count count * 1+ 1}}
         end
 

[Killed] Arithmetic
ecto/query/builder/dynamic.ex:100:105
       {:subquery, i}, {binding, params, subqueries, aliases, count} ->
         subquery = Enum.fetch!(dynamic_subqueries, i)
         ix = length(subqueries)
-        {{:subquery, ix}, {binding, [{:subquery, ix} | params], [subquery | subqueries], aliases, count + 1}}
+        {{:subquery, ix}, {binding, [{:subquery, ix} | params], [subquery | subqueries], aliases, count count - 1+ 1}}
 
       expr, acc ->

[Killed] Arithmetic
ecto/query/builder/dynamic.ex:100:105
       {:subquery, i}, {binding, params, subqueries, aliases, count} ->
         subquery = Enum.fetch!(dynamic_subqueries, i)
         ix = length(subqueries)
-        {{:subquery, ix}, {binding, [{:subquery, ix} | params], [subquery | subqueries], aliases, count + 1}}
+        {{:subquery, ix}, {binding, [{:subquery, ix} | params], [subquery | subqueries], aliases, count count * 1+ 1}}
 
       expr, acc ->
