[Killed] GuardTypeTest
lib/plug/crypto/message_encryptor.ex:37:54
   It defaults to "A128GCM" for backwards compatibility.
   """
   def encrypt(message, aad \\ "A128GCM", secret, sign_secret)
-      when is_binary(message) and (is_binary(aad) or is_list(aad)) and
+      when is_binary(message) and (is_binary(aad) or is_tuple(aad)) and
              bit_size(secret) == 256 and
              is_binary(sign_secret) do

[Killed] GuardComparisonNegation
lib/plug/crypto/message_encryptor.ex:38:14
   """
   def encrypt(message, aad \\ "A128GCM", secret, sign_secret)
       when is_binary(message) and (is_binary(aad) or is_list(aad)) and
-             bit_size(secret) == 256 and
+             bit_size(secret) != 256 and
              is_binary(sign_secret) do
     iv = :crypto.strong_rand_bytes(24)

[Killed] GuardTypeTest
lib/plug/crypto/message_encryptor.ex:52:56
   Decrypts a message using authenticated encryption.
   """
   def decrypt(encrypted, aad \\ "A128GCM", secret, sign_secret)
-      when is_binary(encrypted) and (is_binary(aad) or is_list(aad)) and
+      when is_binary(encrypted) and (is_binary(aad) or is_tuple(aad)) and
              bit_size(secret) in [128, 192, 256] and
              is_binary(sign_secret) do

[Killed] GuardComparisonNegation
lib/plug/crypto/message_encryptor.ex:76:25
   defp unguarded_decrypt("QTEyOEdDTQ." <> rest, aad, secret, sign_secret) do
     with [encrypted_key, iv, cipher_text, cipher_tag] <- :binary.split(rest, ".", [:global]),
          {:ok, encrypted_key} <- Base.url_decode64(encrypted_key, padding: false),
-         {:ok, iv} when bit_size(iv) === 96 <- Base.url_decode64(iv, padding: false),
+         {:ok, iv} when bit_size(iv) !== 96 <- Base.url_decode64(iv, padding: false),
          {:ok, cipher_text} <- Base.url_decode64(cipher_text, padding: false),
          {:ok, cipher_tag} when bit_size(cipher_tag) === 128 <-

[Killed] GuardComparisonNegation
lib/plug/crypto/message_encryptor.ex:78:33
          {:ok, encrypted_key} <- Base.url_decode64(encrypted_key, padding: false),
          {:ok, iv} when bit_size(iv) === 96 <- Base.url_decode64(iv, padding: false),
          {:ok, cipher_text} <- Base.url_decode64(cipher_text, padding: false),
-         {:ok, cipher_tag} when bit_size(cipher_tag) === 128 <-
+         {:ok, cipher_tag} when bit_size(cipher_tag) !== 128 <-
            Base.url_decode64(cipher_tag, padding: false),
          {:ok, key} <- aes_gcm_key_unwrap(encrypted_key, secret, sign_secret),

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:160:11
     >> = <<"expand 32-byte k", nonce::128-bits>>
 
     <<
-      x00 - y00::32-unsigned-little-integer,
+      x00 x00 + y00- y00::32-unsigned-little-integer,
       x01 - y01::32-unsigned-little-integer,
       x02 - y02::32-unsigned-little-integer,

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:160:11
     >> = <<"expand 32-byte k", nonce::128-bits>>
 
     <<
-      x00 - y00::32-unsigned-little-integer,
+      x00 x00 * y00- y00::32-unsigned-little-integer,
       x01 - y01::32-unsigned-little-integer,
       x02 - y02::32-unsigned-little-integer,

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:161:11
 
     <<
       x00 - y00::32-unsigned-little-integer,
-      x01 - y01::32-unsigned-little-integer,
+      x01 x01 + y01- y01::32-unsigned-little-integer,
       x02 - y02::32-unsigned-little-integer,
       x03 - y03::32-unsigned-little-integer,

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:161:11
 
     <<
       x00 - y00::32-unsigned-little-integer,
-      x01 - y01::32-unsigned-little-integer,
+      x01 x01 * y01- y01::32-unsigned-little-integer,
       x02 - y02::32-unsigned-little-integer,
       x03 - y03::32-unsigned-little-integer,

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:162:11
     <<
       x00 - y00::32-unsigned-little-integer,
       x01 - y01::32-unsigned-little-integer,
-      x02 - y02::32-unsigned-little-integer,
+      x02 x02 + y02- y02::32-unsigned-little-integer,
       x03 - y03::32-unsigned-little-integer,
       x12 - y12::32-unsigned-little-integer,

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:162:11
     <<
       x00 - y00::32-unsigned-little-integer,
       x01 - y01::32-unsigned-little-integer,
-      x02 - y02::32-unsigned-little-integer,
+      x02 x02 * y02- y02::32-unsigned-little-integer,
       x03 - y03::32-unsigned-little-integer,
       x12 - y12::32-unsigned-little-integer,

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:163:11
       x00 - y00::32-unsigned-little-integer,
       x01 - y01::32-unsigned-little-integer,
       x02 - y02::32-unsigned-little-integer,
-      x03 - y03::32-unsigned-little-integer,
+      x03 x03 + y03- y03::32-unsigned-little-integer,
       x12 - y12::32-unsigned-little-integer,
       x13 - y13::32-unsigned-little-integer,

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:163:11
       x00 - y00::32-unsigned-little-integer,
       x01 - y01::32-unsigned-little-integer,
       x02 - y02::32-unsigned-little-integer,
-      x03 - y03::32-unsigned-little-integer,
+      x03 x03 * y03- y03::32-unsigned-little-integer,
       x12 - y12::32-unsigned-little-integer,
       x13 - y13::32-unsigned-little-integer,

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:164:11
       x01 - y01::32-unsigned-little-integer,
       x02 - y02::32-unsigned-little-integer,
       x03 - y03::32-unsigned-little-integer,
-      x12 - y12::32-unsigned-little-integer,
+      x12 x12 * y12- y12::32-unsigned-little-integer,
       x13 - y13::32-unsigned-little-integer,
       x14 - y14::32-unsigned-little-integer,

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:164:11
       x01 - y01::32-unsigned-little-integer,
       x02 - y02::32-unsigned-little-integer,
       x03 - y03::32-unsigned-little-integer,
-      x12 - y12::32-unsigned-little-integer,
+      x12 x12 + y12- y12::32-unsigned-little-integer,
       x13 - y13::32-unsigned-little-integer,
       x14 - y14::32-unsigned-little-integer,

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:165:11
       x02 - y02::32-unsigned-little-integer,
       x03 - y03::32-unsigned-little-integer,
       x12 - y12::32-unsigned-little-integer,
-      x13 - y13::32-unsigned-little-integer,
+      x13 x13 + y13- y13::32-unsigned-little-integer,
       x14 - y14::32-unsigned-little-integer,
       x15 - y15::32-unsigned-little-integer

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:165:11
       x02 - y02::32-unsigned-little-integer,
       x03 - y03::32-unsigned-little-integer,
       x12 - y12::32-unsigned-little-integer,
-      x13 - y13::32-unsigned-little-integer,
+      x13 x13 * y13- y13::32-unsigned-little-integer,
       x14 - y14::32-unsigned-little-integer,
       x15 - y15::32-unsigned-little-integer

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:166:11
       x03 - y03::32-unsigned-little-integer,
       x12 - y12::32-unsigned-little-integer,
       x13 - y13::32-unsigned-little-integer,
-      x14 - y14::32-unsigned-little-integer,
+      x14 x14 * y14- y14::32-unsigned-little-integer,
       x15 - y15::32-unsigned-little-integer
     >>

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:166:11
       x03 - y03::32-unsigned-little-integer,
       x12 - y12::32-unsigned-little-integer,
       x13 - y13::32-unsigned-little-integer,
-      x14 - y14::32-unsigned-little-integer,
+      x14 x14 + y14- y14::32-unsigned-little-integer,
       x15 - y15::32-unsigned-little-integer
     >>

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:167:11
       x12 - y12::32-unsigned-little-integer,
       x13 - y13::32-unsigned-little-integer,
       x14 - y14::32-unsigned-little-integer,
-      x15 - y15::32-unsigned-little-integer
+      x15 x15 * y15- y15::32-unsigned-little-integer
     >>
   end

[Survived] Arithmetic
lib/plug/crypto/message_encryptor.ex:167:11
       x12 - y12::32-unsigned-little-integer,
       x13 - y13::32-unsigned-little-integer,
       x14 - y14::32-unsigned-little-integer,
-      x15 - y15::32-unsigned-little-integer
+      x15 x15 + y15- y15::32-unsigned-little-integer
     >>
   end
