[Killed] GuardTypeTest
ecto/query/builder/filter.ex:24:51
     {true, {[], %{subqueries: []}}}
   end
 
-  def escape(kind, expr, binding, vars, env) when is_list(expr) do
+  def escape(kind, expr, binding, vars, env) when is_tuple(expr) do
     {parts, params_acc} =
       Enum.map_reduce(expr, {[], %{subqueries: []}}, fn

[Killed] GuardTypeTest
ecto/query/builder/filter.ex:119:59
     {bool, [], file, line}
   end
 
-  def filter!(kind, _query, kw, binding, file, line) when is_list(kw) do
+  def filter!(kind, _query, kw, binding, file, line) when is_tuple(kw) do
     {expr, params} = kw!(kind, kw, binding)
     {expr, params, file, line}

[Killed] GuardTypeTest
ecto/query/builder/filter.ex:160:90
     end
   end
 
-  defp kw!([{field, nil}|_], _binding, _counter, _exprs, _params, _kind, _original) when is_atom(field) do
+  defp kw!([{field, nil}|_], _binding, _counter, _exprs, _params, _kind, _original) when is_nil(field) do
     raise ArgumentError, "nil given for #{inspect field}. Comparison with nil is forbidden as it is unsafe. " <>
                          "Instead write a query with is_nil/1, for example: is_nil(s.#{field})"

[Killed] GuardTypeTest
ecto/query/builder/filter.ex:164:86
     raise ArgumentError, "nil given for #{inspect field}. Comparison with nil is forbidden as it is unsafe. " <>
                          "Instead write a query with is_nil/1, for example: is_nil(s.#{field})"
   end
-  defp kw!([{field, value}|t], binding, counter, exprs, params, kind, original) when is_atom(field) do
+  defp kw!([{field, value}|t], binding, counter, exprs, params, kind, original) when is_nil(field) do
     kw!(t, binding, counter + 1,
         [{:==, [], [to_field(binding, field), {:^, [], [counter]}]}|exprs],

[Killed] Arithmetic
ecto/query/builder/filter.ex:165:29
                          "Instead write a query with is_nil/1, for example: is_nil(s.#{field})"
   end
   defp kw!([{field, value}|t], binding, counter, exprs, params, kind, original) when is_atom(field) do
-    kw!(t, binding, counter + 1,
+    kw!(t, binding, counter counter * 1+ 1,
         [{:==, [], [to_field(binding, field), {:^, [], [counter]}]}|exprs],
         [{value, {binding, field}}|params],

[Killed] Arithmetic
ecto/query/builder/filter.ex:165:29
                          "Instead write a query with is_nil/1, for example: is_nil(s.#{field})"
   end
   defp kw!([{field, value}|t], binding, counter, exprs, params, kind, original) when is_atom(field) do
-    kw!(t, binding, counter + 1,
+    kw!(t, binding, counter counter - 1+ 1,
         [{:==, [], [to_field(binding, field), {:^, [], [counter]}]}|exprs],
         [{value, {binding, field}}|params],
