[Killed] GuardComparisonNegation
lib/plug/crypto/message_verifier.ex:21:35
   Signs a message according to the given secret.
   """
   def sign(message, secret, digest_type \\ :sha256)
-      when is_binary(message) and byte_size(secret) > 0 and
+      when is_binary(message) and byte_size(secret) <= 0 and
              digest_type in [:sha256, :sha384, :sha512] do
     hmac_sha2_sign(message, secret, digest_type)

[Survived] GuardComparisonBoundary
lib/plug/crypto/message_verifier.ex:21:35
   Signs a message according to the given secret.
   """
   def sign(message, secret, digest_type \\ :sha256)
-      when is_binary(message) and byte_size(secret) > 0 and
+      when is_binary(message) and byte_size(secret) >= 0 and
              digest_type in [:sha256, :sha384, :sha512] do
     hmac_sha2_sign(message, secret, digest_type)

[Killed] GuardComparisonNegation
lib/plug/crypto/message_verifier.ex:31:57
   @doc """
   Decodes and verifies the encoded binary was not tampered with.
   """
-  def verify(signed, secret) when is_binary(signed) and byte_size(secret) > 0 do
+  def verify(signed, secret) when is_binary(signed) and byte_size(secret) <= 0 do
     hmac_sha2_verify(signed, secret)
   rescue

[Survived] GuardComparisonBoundary
lib/plug/crypto/message_verifier.ex:31:57
   @doc """
   Decodes and verifies the encoded binary was not tampered with.
   """
-  def verify(signed, secret) when is_binary(signed) and byte_size(secret) > 0 do
+  def verify(signed, secret) when is_binary(signed) and byte_size(secret) >= 0 do
     hmac_sha2_verify(signed, secret)
   rescue
