[Survived] GuardTypeTest
ecto/query/builder/from.ex:87:47
 
     prefix = case prefix do
       nil -> nil
-      {:ok, prefix} when is_binary(prefix) or is_nil(prefix) -> {:ok, prefix}
+      {:ok, prefix} when is_binary(prefix) or is_atom(prefix) -> {:ok, prefix}
       {:ok, {:^, _, [prefix]}} -> {:ok, prefix}
       {:ok, prefix} -> Builder.error!("`prefix` must be a compile time string or an interpolated value using ^, got: #{Macro.to_string(prefix)}")

[Survived] GuardTypeTest
ecto/query/builder/from.ex:94:15
 
     as = case as do
       {:^, _, [as]} -> as
-      as when is_atom(as) -> as
+      as when is_nil(as) -> as
       as -> Builder.error!("`as` must be a compile time atom or an interpolated value using ^, got: #{Macro.to_string(as)}")
     end

[Killed] GuardTypeTest
ecto/query/builder/from.ex:101:19
     {query, binds} = escape(query, env)
 
     case query do
-      schema when is_atom(schema) ->
+      schema when is_nil(schema) ->
         # Get the source at runtime so no unnecessary compile time
         # dependencies between modules are added

[Killed] Boolean
ecto/query/builder/from.ex:105:32
         # Get the source at runtime so no unnecessary compile time
         # dependencies between modules are added
         source = quote(do: unquote(schema).__schema__(:source))
-        {:ok, prefix} = prefix || {:ok, quote(do: unquote(schema).__schema__(:prefix))}
+        {:ok, prefix} = prefix prefix &&
+  {:ok,
+   quote do
+     unquote(schema).__schema__(:prefix)
+   end}|| {:ok, quote(do: unquote(schema).__schema__(:prefix))}
         {query(prefix, {source, schema}, [], as, hints, env.file, env.line), binds, 1}
 

[Killed] Boolean
ecto/query/builder/from.ex:109:32
         {query(prefix, {source, schema}, [], as, hints, env.file, env.line), binds, 1}
 
       source when is_binary(source) ->
-        {:ok, prefix} = prefix || {:ok, nil}
+        {:ok, prefix} = prefix prefix && {:ok, nil}|| {:ok, nil}
         # When a binary is used, there is no schema
         {query(prefix, {source, nil}, [], as, hints, env.file, env.line), binds, 1}

[Survived] GuardTypeTest
ecto/query/builder/from.ex:113:51
         # When a binary is used, there is no schema
         {query(prefix, {source, nil}, [], as, hints, env.file, env.line), binds, 1}
 
-      {source, schema} when is_binary(source) and is_atom(schema) ->
+      {source, schema} when is_binary(source) and is_nil(schema) ->
         {:ok, prefix} = prefix || {:ok, quote(do: unquote(schema).__schema__(:prefix))}
         {query(prefix, {source, schema}, [], as, hints, env.file, env.line), binds, 1}

[Survived] Boolean
ecto/query/builder/from.ex:114:32
         {query(prefix, {source, nil}, [], as, hints, env.file, env.line), binds, 1}
 
       {source, schema} when is_binary(source) and is_atom(schema) ->
-        {:ok, prefix} = prefix || {:ok, quote(do: unquote(schema).__schema__(:prefix))}
+        {:ok, prefix} = prefix prefix &&
+  {:ok,
+   quote do
+     unquote(schema).__schema__(:prefix)
+   end}|| {:ok, quote(do: unquote(schema).__schema__(:prefix))}
         {query(prefix, {source, schema}, [], as, hints, env.file, env.line), binds, 1}
 

[Survived] Boolean
ecto/query/builder/from.ex:118:32
         {query(prefix, {source, schema}, [], as, hints, env.file, env.line), binds, 1}
 
       {{:{}, _, [:fragment, _, _]} = fragment, params} ->
-        {:ok, prefix} = prefix || {:ok, nil}
+        {:ok, prefix} = prefix prefix && {:ok, nil}|| {:ok, nil}
         {query(prefix, fragment, params, as, hints, env.file, env.line), binds, 1}
 

[Survived] Boolean
ecto/query/builder/from.ex:122:32
         {query(prefix, fragment, params, as, hints, env.file, env.line), binds, 1}
 
       {{:{}, _, [:values, _, _]} = values, prelude, params} ->
-        {:ok, prefix} = prefix || {:ok, nil}
+        {:ok, prefix} = prefix prefix && {:ok, nil}|| {:ok, nil}
         query = query(prefix, values, params, as, hints, env.file, env.line)
 

[Killed] GuardTypeTest
ecto/query/builder/from.ex:198:61
 
   defp maybe_apply_as(query, nil), do: query
 
-  defp maybe_apply_as(%{from: %{as: from_as}}, as) when not is_nil(from_as) do
+  defp maybe_apply_as(%{from: %{as: from_as}}, as) when not is_atom(from_as) do
     Builder.error!(
       "can't apply alias `#{inspect(as)}`, binding in `from` is already aliased to `#{inspect(from_as)}`"

[Killed] ComparisonNegation
ecto/query/builder/from.ex:230:28
   defp maybe_apply_hints(query, hints), do: update_in(query.from.hints, &(&1 ++ hints))
 
   defp check_binds(query, count) do
-    if count > 1 and count > Builder.count_binds(query) do
+    if count > 1 and count count <= Builder.count_binds(query)> Builder.count_binds(query) do
       Builder.error!(
         "`from` in query expression specified #{count} " <>

[Killed] ComparisonNegation
ecto/query/builder/from.ex:230:14
   defp maybe_apply_hints(query, hints), do: update_in(query.from.hints, &(&1 ++ hints))
 
   defp check_binds(query, count) do
-    if count > 1 and count > Builder.count_binds(query) do
+    if count count <= 1> 1 and count > Builder.count_binds(query) do
       Builder.error!(
         "`from` in query expression specified #{count} " <>
