[Survived] AtomLiteral
lib/plug/crypto.ex:77:37
           "cannot deserialize #{inspect(other)}, the term is not safe for deserialization"
   end
 
-  defp non_executable_list([]), do: :ok
+  defp non_executable_list([]), do: :error
 
   defp non_executable_list([h | t]) when is_list(t) do

[Survived] IntegerLiteral
lib/plug/crypto.ex:89:37
     non_executable_terms(t)
   end
 
-  defp non_executable_tuple(_tuple, 0), do: :ok
+  defp non_executable_tuple(_tuple, 1), do: :ok
 
   defp non_executable_tuple(tuple, n) do

[Survived] AtomLiteral
lib/plug/crypto.ex:89:45
     non_executable_terms(t)
   end
 
-  defp non_executable_tuple(_tuple, 0), do: :ok
+  defp non_executable_tuple(_tuple, 0), do: :error
 
   defp non_executable_tuple(tuple, n) do
