[Killed] GuardTypeTest
ecto/query/builder/group_by.ex:30:62
     {quote(do: Ecto.Query.Builder.GroupBy.field!(unquote(kind), unquote(expr))), params_acc}
   end
 
-  defp do_escape(field, params_acc, _kind, _vars, _env) when is_atom(field) do
+  defp do_escape(field, params_acc, _kind, _vars, _env) when is_nil(field) do
     {Macro.escape(to_field(field)), params_acc}
   end

[Killed] GuardTypeTest
ecto/query/builder/group_by.ex:41:33
   @doc """
   Called at runtime to verify a field.
   """
-  def field!(_kind, field) when is_atom(field),
+  def field!(_kind, field) when is_nil(field),
     do: to_field(field)
   def field!(kind, other) do
