[Killed] GuardTypeTest
ecto/query/builder/join.ex:48:29
   @spec escape(Macro.t(), Keyword.t(), Macro.Env.t()) ::
           {atom, Macro.t() | nil, Macro.t() | nil, list}
   def escape({:in, _, [{var, _, context}, expr]}, vars, env)
-      when is_atom(var) and is_atom(context) do
+      when is_atom(var) and is_nil(context) do
     {_, expr, assoc, prelude, params} = escape(expr, vars, env)
     {var, expr, assoc, prelude, params}

[Killed] GuardTypeTest
ecto/query/builder/join.ex:48:12
   @spec escape(Macro.t(), Keyword.t(), Macro.Env.t()) ::
           {atom, Macro.t() | nil, Macro.t() | nil, list}
   def escape({:in, _, [{var, _, context}, expr]}, vars, env)
-      when is_atom(var) and is_atom(context) do
+      when is_nil(var) and is_atom(context) do
     {_, expr, assoc, prelude, params} = escape(expr, vars, env)
     {var, expr, assoc, prelude, params}

[Killed] GuardTypeTest
ecto/query/builder/join.ex:76:19
 
   def escape({string, schema} = join, _vars, env) when is_binary(string) do
     case Macro.expand(schema, env) do
-      schema when is_atom(schema) ->
+      schema when is_nil(schema) ->
         {:_, {string, schema}, nil, nil, []}
 

[Killed] GuardTypeTest
ecto/query/builder/join.ex:85:12
   end
 
   def escape({:assoc, _, [{var, _, context}, field]}, vars, _env)
-      when is_atom(var) and is_atom(context) do
+      when is_nil(var) and is_atom(context) do
     ensure_field!(field)
     var = Builder.find_var!(var, vars)

[Killed] GuardTypeTest
ecto/query/builder/join.ex:85:29
   end
 
   def escape({:assoc, _, [{var, _, context}, field]}, vars, _env)
-      when is_atom(var) and is_atom(context) do
+      when is_atom(var) and is_nil(context) do
     ensure_field!(field)
     var = Builder.find_var!(var, vars)

[Killed] GuardTypeTest
ecto/query/builder/join.ex:100:40
     {:_, {string, nil}, nil, nil, []}
   end
 
-  def escape(schema, _vars, _env) when is_atom(schema) do
+  def escape(schema, _vars, _env) when is_nil(schema) do
     {:_, {nil, schema}, nil, nil, []}
   end

[Killed] GuardTypeTest
ecto/query/builder/join.ex:117:24
   @doc """
   Called at runtime to check dynamic joins.
   """
-  def join!(expr) when is_atom(expr),
+  def join!(expr) when is_nil(expr),
     do: {nil, expr}
 

[Killed] GuardTypeTest
ecto/query/builder/join.ex:123:58
   def join!(expr) when is_binary(expr),
     do: {expr, nil}
 
-  def join!({source, module}) when is_binary(source) and is_atom(module),
+  def join!({source, module}) when is_binary(source) and is_nil(module),
     do: {source, module}
 

[Killed] Boolean
ecto/query/builder/join.ex:150:28
         ) ::
           {Macro.t(), Keyword.t(), non_neg_integer | nil}
   def build(query, qual, binding, expr, count_bind, on, as, prefix, maybe_hints, env) do
-    {:ok, prefix} = prefix || {:ok, nil}
+    {:ok, prefix} = prefix prefix && {:ok, nil}|| {:ok, nil}
     hints = List.wrap(maybe_hints)
 

[Killed] GuardTypeTest
ecto/query/builder/join.ex:182:17
         {:^, _, [as]} ->
           as
 
-        as when is_atom(as) ->
+        as when is_nil(as) ->
           as
 

[Survived] Arithmetic
ecto/query/builder/join.ex:216:20
 
     next_bind =
       if is_integer(count_bind) do
-        count_bind + 1
+        count_bind count_bind - 1+ 1
       else
         quote(do: unquote(count_bind) + 1)

[Survived] Arithmetic
ecto/query/builder/join.ex:216:20
 
     next_bind =
       if is_integer(count_bind) do
-        count_bind + 1
+        count_bind count_bind * 1+ 1
       else
         quote(do: unquote(count_bind) + 1)

[Survived] GuardTypeTest
ecto/query/builder/join.ex:238:35
     {query, binding, next_bind}
   end
 
-  defp escape_params(params) when is_list(params) do
+  defp escape_params(params) when is_tuple(params) do
     Builder.escape_params(params)
   end

[Killed] GuardComparisonNegation
ecto/query/builder/join.ex:290:57
     end
   end
 
-  defp ensure_on(on, _assoc, _qual, _source, _env) when on != nil, do: on
+  defp ensure_on(on, _assoc, _qual, _source, _env) when on == nil, do: on
 
   defp ensure_on(nil, _assoc = nil, qual, source, env)

[Killed] Boolean
ecto/query/builder/join.ex:296:48
        when qual not in [:cross, :cross_lateral] do
     maybe_source =
       with {source, alias} <- source,
-           source when source != nil <- source || alias do
+           source when source != nil <- source source && alias|| alias do
         " on #{inspect(source)}"
       else

[Killed] GuardComparisonNegation
ecto/query/builder/join.ex:296:24
        when qual not in [:cross, :cross_lateral] do
     maybe_source =
       with {source, alias} <- source,
-           source when source != nil <- source || alias do
+           source when source == nil <- source || alias do
         " on #{inspect(source)}"
       else

[Killed] GuardTypeTest
ecto/query/builder/join.ex:336:55
   """
   def runtime_aliases(aliases, nil, _), do: aliases
 
-  def runtime_aliases(aliases, name, join_count) when is_integer(join_count) do
+  def runtime_aliases(aliases, name, join_count) when is_number(join_count) do
     if Map.has_key?(aliases, name) do
       Builder.error!("alias `#{inspect(name)}` already exists")

[Killed] GuardTypeTest
ecto/query/builder/join.ex:336:55
   """
   def runtime_aliases(aliases, nil, _), do: aliases
 
-  def runtime_aliases(aliases, name, join_count) when is_integer(join_count) do
+  def runtime_aliases(aliases, name, join_count) when is_float(join_count) do
     if Map.has_key?(aliases, name) do
       Builder.error!("alias `#{inspect(name)}` already exists")

[Survived] GuardTypeTest
ecto/query/builder/join.ex:345:31
   end
 
   defp compile_aliases({:%{}, meta, aliases}, name, join_count)
-       when is_atom(name) and is_integer(join_count) do
+       when is_atom(name) and is_float(join_count) do
     {:%{}, meta, aliases |> Map.new() |> runtime_aliases(name, join_count) |> Map.to_list()}
   end

[Survived] GuardTypeTest
ecto/query/builder/join.ex:345:31
   end
 
   defp compile_aliases({:%{}, meta, aliases}, name, join_count)
-       when is_atom(name) and is_integer(join_count) do
+       when is_atom(name) and is_number(join_count) do
     {:%{}, meta, aliases |> Map.new() |> runtime_aliases(name, join_count) |> Map.to_list()}
   end

[Survived] GuardTypeTest
ecto/query/builder/join.ex:383:33
     apply(query, join, as, count_bind)
   end
 
-  defp validate_qual(qual) when is_atom(qual) do
+  defp validate_qual(qual) when is_nil(qual) do
     qual!(qual)
   end

[Killed] Boolean
ecto/query/builder/join.ex:392:19
   end
 
   defp validate_bind(bind, all) do
-    if bind != :_ and bind in all do
+    if bind != :_ bind != :_ or bind in alland bind in all do
       Builder.error!("variable `#{bind}` is already defined in query")
     end

[Survived] ComparisonNegation
ecto/query/builder/join.ex:392:13
   end
 
   defp validate_bind(bind, all) do
-    if bind != :_ and bind in all do
+    if bind bind == :_!= :_ and bind in all do
       Builder.error!("variable `#{bind}` is already defined in query")
     end

[Killed] GuardComparisonNegation
ecto/query/builder/join.ex:419:40
             Enum.map_join(@qualifiers, ", ", &"`#{inspect(&1)}`")
   end
 
-  defp ensure_field!({var, _, _}) when var != :^ do
+  defp ensure_field!({var, _, _}) when var == :^ do
     Builder.error!(
       "you passed the variable `#{var}` to `assoc/2`. Did you mean to pass the atom `:#{var}`?"
