[Killed] AtomLiteral
lib/plug/crypto/message_verifier.ex:66:9
       if Plug.Crypto.secure_compare(challenge, signature) do
         {:ok, payload}
       else
-        :error
+        :ok
       end
     else
