[Survived] ComparisonNegation
ecto/query/builder/lock.ex:21:15
   def escape({:fragment, _, [_ | _]} = expr, vars, env) do
     {expr, {params, _acc}} = Builder.escape(expr, :any, {[], %{}}, vars, env)
 
-    if params != [] do
+    if params params == []!= [] do
       Builder.error!("value interpolation is not allowed in :lock")
     end
