[Killed] GuardTypeTest
ecto/query/builder/order_by.ex:68:68
      params_acc}
   end
 
-  defp do_escape({dir, field}, params_acc, kind, _vars, _env) when is_atom(field) do
+  defp do_escape({dir, field}, params_acc, kind, _vars, _env) when is_nil(field) do
     {[{quoted_dir!(kind, dir), Macro.escape(to_field(field))}], params_acc}
   end

[Survived] GuardTypeTest
ecto/query/builder/order_by.ex:100:76
     escape(kind, expr, params_acc, vars, env)
   end
 
-  defp escape_expansion(_kind, field, _type, params_acc, _vars, _env) when is_atom(field) do
+  defp escape_expansion(_kind, field, _type, params_acc, _vars, _env) when is_nil(field) do
     {Macro.escape(to_field(field)), params_acc}
   end

[Killed] GuardTypeTest
ecto/query/builder/order_by.ex:141:33
   @doc """
   Called at runtime to verify a field.
   """
-  def field!(_kind, field) when is_atom(field) do
+  def field!(_kind, field) when is_nil(field) do
     to_field(field)
   end

[Killed] GuardTypeTest
ecto/query/builder/order_by.ex:212:67
     {expr, {params, count, subqueries}}
   end
 
-  defp dynamic_or_field!(_kind, field, _query, params_count) when is_atom(field) do
+  defp dynamic_or_field!(_kind, field, _query, params_count) when is_nil(field) do
     {to_field(field), params_count}
   end
