[Killed] GuardTypeTest
ecto/query/builder/preload.ex:53:58
     {Enum.reverse(preloads), Enum.reverse(assocs)}
   end
 
-  defp escape(atom, _mode, preloads, assocs, _vars) when is_atom(atom) do
+  defp escape(atom, _mode, preloads, assocs, _vars) when is_nil(atom) do
     {[atom | preloads], assocs}
   end

[Killed] GuardTypeTest
ecto/query/builder/preload.ex:57:56
     {[atom | preloads], assocs}
   end
 
-  defp escape(list, mode, preloads, assocs, vars) when is_list(list) do
+  defp escape(list, mode, preloads, assocs, vars) when is_tuple(list) do
     Enum.reduce(list, {preloads, assocs}, fn item, acc ->
       escape_each(item, mode, acc, vars)

[Survived] GuardTypeTest
ecto/query/builder/preload.ex:81:13
   end
 
   defp escape_each({key, {var, _, context}}, mode, {preloads, assocs}, vars)
-       when is_atom(context) do
+       when is_nil(context) do
     assert_assoc!(mode, key, var)
     key = escape_key(key)

[Survived] GuardTypeTest
ecto/query/builder/preload.ex:89:13
   end
 
   defp escape_each({key, {{var, _, context}, list}}, mode, {preloads, assocs}, vars)
-       when is_atom(context) do
+       when is_nil(context) do
     assert_assoc!(mode, key, var)
     key = escape_key(key)

[Killed] GuardTypeTest
ecto/query/builder/preload.ex:112:30
     escape(other, mode, preloads, assocs, vars)
   end
 
-  defp escape_key(atom) when is_atom(atom) do
+  defp escape_key(atom) when is_nil(atom) do
     atom
   end

[Killed] GuardTypeTest
ecto/query/builder/preload.ex:127:22
   @doc """
   Called at runtime to check dynamic preload keys.
   """
-  def key!(key) when is_atom(key),
+  def key!(key) when is_nil(key),
     do: key
 

[Killed] GuardTypeTest
ecto/query/builder/preload.ex:213:59
     expand(preloads, query, :both, [], [])
   end
 
-  defp expand(atom, _query, _mode, preloads, assocs) when is_atom(atom) do
+  defp expand(atom, _query, _mode, preloads, assocs) when is_nil(atom) do
     {[atom | preloads], assocs}
   end

[Killed] GuardTypeTest
ecto/query/builder/preload.ex:217:57
     {[atom | preloads], assocs}
   end
 
-  defp expand(list, query, mode, preloads, assocs) when is_list(list) do
+  defp expand(list, query, mode, preloads, assocs) when is_tuple(list) do
     {preloads, assocs} =
       Enum.reduce(list, {preloads, assocs}, fn item, acc ->

[Survived] GuardTypeTest
ecto/query/builder/preload.ex:232:66
             "expected an atom or a list."
   end
 
-  defp expand_each(atom, _query, _mode, {preloads, assocs}) when is_atom(atom) do
+  defp expand_each(atom, _query, _mode, {preloads, assocs}) when is_nil(atom) do
     {[atom | preloads], assocs}
   end

[Killed] GuardTypeTest
ecto/query/builder/preload.ex:236:73
     {[atom | preloads], assocs}
   end
 
-  defp expand_each({key, atom}, _query, _mode, {preloads, assocs}) when is_atom(atom) do
+  defp expand_each({key, atom}, _query, _mode, {preloads, assocs}) when is_nil(atom) do
     assert_key!(key)
 

[Killed] GuardTypeTest
ecto/query/builder/preload.ex:277:72
     {[{key, {query_or_fun, inner_preloads}} | preloads], assocs}
   end
 
-  defp expand_each({key, list}, query, _mode, {preloads, assocs}) when is_list(list) do
+  defp expand_each({key, list}, query, _mode, {preloads, assocs}) when is_tuple(list) do
     assert_key!(key)
 

[Killed] GuardTypeTest
ecto/query/builder/preload.ex:297:45
 
   defp expand_dynamic(%Ecto.Query.DynamicExpr{} = dynamic, query) do
     case Builder.Dynamic.fully_expand(query, dynamic) do
-      {{:&, [], [idx]}, _, _, _, _, _} when is_integer(idx) ->
+      {{:&, [], [idx]}, _, _, _, _, _} when is_float(idx) ->
         idx
 

[Survived] GuardTypeTest
ecto/query/builder/preload.ex:297:45
 
   defp expand_dynamic(%Ecto.Query.DynamicExpr{} = dynamic, query) do
     case Builder.Dynamic.fully_expand(query, dynamic) do
-      {{:&, [], [idx]}, _, _, _, _, _} when is_integer(idx) ->
+      {{:&, [], [idx]}, _, _, _, _, _} when is_number(idx) ->
         idx
 

[Survived] Boolean
ecto/query/builder/preload.ex:308:40
     end
   end
 
-  defp assert_key!(key), do: key!(key) && :ok
+  defp assert_key!(key), do: key!(key) key!(key) || :ok&& :ok
 
   defp assert_query_or_fun!(%Ecto.Query{}, _key), do: :ok
