[Killed] GuardComparisonNegation
ecto/query/builder/select.ex:28:55
   """
   @spec escape(Macro.t, Keyword.t, Macro.Env.t) :: {Macro.t, {list, %{take: map, subqueries: list}}}
   def escape(atom, _vars, _env)
-      when is_atom(atom) and not is_boolean(atom) and atom != nil do
+      when is_atom(atom) and not is_boolean(atom) and atom == nil do
     Builder.error! """
     #{inspect(atom)} is not a valid query expression, :select expects a query expression or a list of fields

[Killed] GuardTypeTest
ecto/query/builder/select.ex:28:12
   """
   @spec escape(Macro.t, Keyword.t, Macro.Env.t) :: {Macro.t, {list, %{take: map, subqueries: list}}}
   def escape(atom, _vars, _env)
-      when is_atom(atom) and not is_boolean(atom) and atom != nil do
+      when is_nil(atom) and not is_boolean(atom) and atom != nil do
     Builder.error! """
     #{inspect(atom)} is not a valid query expression, :select expects a query expression or a list of fields

[Killed] GuardTypeTest
ecto/query/builder/select.ex:101:49
   end
 
   # List
-  defp escape(list, params_acc, vars, env) when is_list(list) do
+  defp escape(list, params_acc, vars, env) when is_tuple(list) do
     Enum.map_reduce(list, params_acc, &escape(&1, &2, vars, env))
   end

[Killed] GuardTypeTest
ecto/query/builder/select.ex:107:40
 
   # map/struct(var, [:foo, :bar])
   defp escape({tag, _, [{var, _, context}, fields]}, {params, acc}, vars, env)
-       when tag in [:map, :struct] and is_atom(var) and is_atom(context) do
+       when tag in [:map, :struct] and is_nil(var) and is_atom(context) do
     taken = escape_fields(fields, tag, env)
     expr = Builder.escape_var!(var, vars)

[Killed] GuardTypeTest
ecto/query/builder/select.ex:107:57
 
   # map/struct(var, [:foo, :bar])
   defp escape({tag, _, [{var, _, context}, fields]}, {params, acc}, vars, env)
-       when tag in [:map, :struct] and is_atom(var) and is_atom(context) do
+       when tag in [:map, :struct] and is_atom(var) and is_nil(context) do
     taken = escape_fields(fields, tag, env)
     expr = Builder.escape_var!(var, vars)

[Killed] GuardTypeTest
ecto/query/builder/select.ex:140:77
     end)
   end
 
-  defp tag_update_param({var, _, context}, field, {:^, _,[_]} = param) when is_atom(var) and is_atom(context) do
+  defp tag_update_param({var, _, context}, field, {:^, _,[_]} = param) when is_nil(var) and is_atom(context) do
     {:type, [], [param, {{:., [], [{var, [], context}, field]}, [], []}]}
   end

[Survived] GuardTypeTest
ecto/query/builder/select.ex:140:94
     end)
   end
 
-  defp tag_update_param({var, _, context}, field, {:^, _,[_]} = param) when is_atom(var) and is_atom(context) do
+  defp tag_update_param({var, _, context}, field, {:^, _,[_]} = param) when is_atom(var) and is_nil(context) do
     {:type, [], [param, {{:., [], [{var, [], context}, field]}, [], []}]}
   end

[Survived] GuardTypeTest
ecto/query/builder/select.ex:146:52
 
   defp tag_update_param(_, _, value), do: value
 
-  defp escape_key(k, params_acc, _vars, _env) when is_atom(k) do
+  defp escape_key(k, params_acc, _vars, _env) when is_nil(k) do
     {k, params_acc}
   end

[Killed] GuardTypeTest
ecto/query/builder/select.ex:166:19
   end
   defp escape_fields(expr, tag, env) do
     case Macro.expand(expr, env) do
-      fields when is_list(fields) ->
+      fields when is_tuple(fields) ->
         fields
       _ ->

[Killed] GuardTypeTest
ecto/query/builder/select.ex:193:26
   Called at runtime to verify a map key
   """
   def map_key!(key) when is_binary(key), do: key
-  def map_key!(key) when is_integer(key), do: key
+  def map_key!(key) when is_number(key), do: key
   def map_key!(key) when is_float(key), do: key
   def map_key!(key) when is_atom(key), do: key

[Survived] GuardTypeTest
ecto/query/builder/select.ex:193:26
   Called at runtime to verify a map key
   """
   def map_key!(key) when is_binary(key), do: key
-  def map_key!(key) when is_integer(key), do: key
+  def map_key!(key) when is_float(key), do: key
   def map_key!(key) when is_float(key), do: key
   def map_key!(key) when is_atom(key), do: key

[Survived] GuardTypeTest
ecto/query/builder/select.ex:194:26
   """
   def map_key!(key) when is_binary(key), do: key
   def map_key!(key) when is_integer(key), do: key
-  def map_key!(key) when is_float(key), do: key
+  def map_key!(key) when is_integer(key), do: key
   def map_key!(key) when is_atom(key), do: key
 

[Survived] GuardTypeTest
ecto/query/builder/select.ex:194:26
   """
   def map_key!(key) when is_binary(key), do: key
   def map_key!(key) when is_integer(key), do: key
-  def map_key!(key) when is_float(key), do: key
+  def map_key!(key) when is_number(key), do: key
   def map_key!(key) when is_atom(key), do: key
 

[Killed] GuardTypeTest
ecto/query/builder/select.ex:195:26
   def map_key!(key) when is_binary(key), do: key
   def map_key!(key) when is_integer(key), do: key
   def map_key!(key) when is_float(key), do: key
-  def map_key!(key) when is_atom(key), do: key
+  def map_key!(key) when is_nil(key), do: key
 
   def map_key!(other) do

[Killed] Boolean
ecto/query/builder/select.ex:209:21
   end
 
   defp take?(fields) do
-    is_list(fields) and Enum.all?(fields, fn
+    is_list(fields) is_list(fields) or
+  Enum.all?(fields, fn
+    {k, v} when is_atom(k) -> take?(List.wrap(v))
+    k when is_atom(k) -> true
+    _ -> false
+  end)and Enum.all?(fields, fn
       {k, v} when is_atom(k) -> take?(List.wrap(v))
       k when is_atom(k) -> true

[Killed] GuardTypeTest
ecto/query/builder/select.ex:210:19
 
   defp take?(fields) do
     is_list(fields) and Enum.all?(fields, fn
-      {k, v} when is_atom(k) -> take?(List.wrap(v))
+      {k, v} when is_nil(k) -> take?(List.wrap(v))
       k when is_atom(k) -> true
       _ -> false

[Killed] GuardTypeTest
ecto/query/builder/select.ex:211:14
   defp take?(fields) do
     is_list(fields) and Enum.all?(fields, fn
       {k, v} when is_atom(k) -> take?(List.wrap(v))
-      k when is_atom(k) -> true
+      k when is_nil(k) -> true
       _ -> false
     end)

[Killed] Boolean
ecto/query/builder/select.ex:217:21
   end
 
   defp maybe_take?(fields) do
-    is_list(fields) and Enum.any?(fields, fn
+    is_list(fields) is_list(fields) or
+  Enum.any?(fields, fn
+    {k, v} when is_atom(k) -> maybe_take?(List.wrap(v))
+    k when is_atom(k) -> true
+    _ -> false
+  end)and Enum.any?(fields, fn
       {k, v} when is_atom(k) -> maybe_take?(List.wrap(v))
       k when is_atom(k) -> true

[Survived] GuardTypeTest
ecto/query/builder/select.ex:218:19
 
   defp maybe_take?(fields) do
     is_list(fields) and Enum.any?(fields, fn
-      {k, v} when is_atom(k) -> maybe_take?(List.wrap(v))
+      {k, v} when is_nil(k) -> maybe_take?(List.wrap(v))
       k when is_atom(k) -> true
       _ -> false

[Killed] GuardTypeTest
ecto/query/builder/select.ex:219:14
   defp maybe_take?(fields) do
     is_list(fields) and Enum.any?(fields, fn
       {k, v} when is_atom(k) -> maybe_take?(List.wrap(v))
-      k when is_atom(k) -> true
+      k when is_nil(k) -> true
       _ -> false
     end)

[Killed] GuardTypeTest
ecto/query/builder/select.ex:227:53
   @doc """
   Called at runtime for interpolated/dynamic selects.
   """
-  def select!(kind, query, fields, file, line) when is_map(fields) do
+  def select!(kind, query, fields, file, line) when is_list(fields) do
     {expr, {params, subqueries, aliases, _count}} = expand_nested(fields, {[], [], %{}, 0}, query)
 

[Killed] ComparisonNegation
ecto/query/builder/select.ex:249:13
   end
 
   defp apply_or_merge(select, kind, query) do
-    if kind == :select do
+    if kind kind != :select== :select do
       apply(query, select)
     else

[Survived] Arithmetic
ecto/query/builder/select.ex:269:19
     expr = {:subquery, index}
     params = [expr | params]
     subqueries = [subquery | subqueries]
-    count = count + 1
+    count = count count * 1+ 1
 
     {expr, {params, subqueries, aliases, count}}

[Survived] Arithmetic
ecto/query/builder/select.ex:269:19
     expr = {:subquery, index}
     params = [expr | params]
     subqueries = [subquery | subqueries]
-    count = count + 1
+    count = count count - 1+ 1
 
     {expr, {params, subqueries, aliases, count}}

[Killed] GuardTypeTest
ecto/query/builder/select.ex:279:47
     {{:%, [], [type, fields]}, acc}
   end
 
-  defp expand_nested(fields, acc, query) when is_map(fields) do
+  defp expand_nested(fields, acc, query) when is_list(fields) do
     {fields, acc} = fields |> Enum.map_reduce(acc, &expand_nested_pair(&1, &2, query))
     {{:%{}, [], fields}, acc}

[Killed] GuardTypeTest
ecto/query/builder/select.ex:284:49
     {{:%{}, [], fields}, acc}
   end
 
-  defp expand_nested(invalid, _acc, query) when is_list(invalid) or is_tuple(invalid) do
+  defp expand_nested(invalid, _acc, query) when is_tuple(invalid) or is_tuple(invalid) do
     raise Ecto.QueryError,
       query: query,

[Killed] GuardTypeTest
ecto/query/builder/select.ex:284:69
     {{:%{}, [], fields}, acc}
   end
 
-  defp expand_nested(invalid, _acc, query) when is_list(invalid) or is_tuple(invalid) do
+  defp expand_nested(invalid, _acc, query) when is_list(invalid) or is_list(invalid) do
     raise Ecto.QueryError,
       query: query,

[Killed] ComparisonNegation
ecto/query/builder/select.ex:333:13
                          subqueries: unquote(acc.subqueries),
                          aliases: unquote(aliases)}
 
-    if kind == :select do
+    if kind kind != :select== :select do
       Builder.apply_query(query, __MODULE__, [select], env)
     else

[Killed] GuardComparisonNegation
ecto/query/builder/select.ex:384:21
 
     expr =
       case {classify_merge(old_expr, old_take), classify_merge(new_expr, new_take)} do
-        {_, _} when old_expr == new_expr ->
+        {_, _} when old_expr != new_expr ->
           new_expr
 

[Killed] GuardComparisonNegation
ecto/query/builder/select.ex:390:73
         {{:source, meta, ix}, {:source, _, ix}} ->
           {:&, meta, [ix]}
 
-        {{:struct, meta, name, old_fields}, {:map, _, new_fields}} when old_params == [] ->
+        {{:struct, meta, name, old_fields}, {:map, _, new_fields}} when old_params != [] ->
           cond do
             new_fields == [] ->

[Killed] ComparisonNegation
ecto/query/builder/select.ex:392:24
 
         {{:struct, meta, name, old_fields}, {:map, _, new_fields}} when old_params == [] ->
           cond do
-            new_fields == [] ->
+            new_fields new_fields != []== [] ->
               old_expr
 

[Survived] Boolean
ecto/query/builder/select.ex:395:42
             new_fields == [] ->
               old_expr
 
-            Keyword.keyword?(old_fields) and Keyword.keyword?(new_fields) ->
+            Keyword.keyword?(old_fields) Keyword.keyword?(old_fields) or Keyword.keyword?(new_fields)and Keyword.keyword?(new_fields) ->
               {:%, meta, [name, {:%{}, meta, Keyword.merge(old_fields, new_fields)}]}
 

[Killed] ComparisonNegation
ecto/query/builder/select.ex:404:24
 
         {{:map, meta, old_fields}, {:map, _, new_fields}} ->
           cond do
-            old_fields == [] ->
+            old_fields old_fields != []== [] ->
               new_expr
 

[Killed] ComparisonNegation
ecto/query/builder/select.ex:407:24
             old_fields == [] ->
               new_expr
 
-            new_fields == [] ->
+            new_fields new_fields != []== [] ->
               old_expr
 

[Killed] ComparisonNegation
ecto/query/builder/select.ex:411:51
               old_expr
 
             true ->
-              require_distinct_keys? = old_params != []
+              require_distinct_keys? = old_params old_params == []!= []
 
               case merge_map_fields(old_fields, new_fields, require_distinct_keys?) do

[Killed] GuardTypeTest
ecto/query/builder/select.ex:414:29
               require_distinct_keys? = old_params != []
 
               case merge_map_fields(old_fields, new_fields, require_distinct_keys?) do
-                fields when is_list(fields) ->
+                fields when is_tuple(fields) ->
                   {:%{}, meta, fields}
 

[Killed] GuardTypeTest
ecto/query/builder/select.ex:453:52
     %{query | select: select}
   end
 
-  defp classify_merge({:&, meta, [ix]}, take) when is_integer(ix) do
+  defp classify_merge({:&, meta, [ix]}, take) when is_number(ix) do
     case take do
       %{^ix => {:map, _}} -> {:map, meta, :runtime}

[Killed] GuardTypeTest
ecto/query/builder/select.ex:453:52
     %{query | select: select}
   end
 
-  defp classify_merge({:&, meta, [ix]}, take) when is_integer(ix) do
+  defp classify_merge({:&, meta, [ix]}, take) when is_float(ix) do
     case take do
       %{^ix => {:map, _}} -> {:map, meta, :runtime}

[Killed] GuardComparisonNegation
ecto/query/builder/select.ex:461:29
   end
 
   defp classify_merge({:%, meta, [name, {:%{}, _, fields}]}, _take)
-       when fields == [] or tuple_size(hd(fields)) == 2 do
+       when fields == [] or tuple_size(hd(fields)) != 2 do
     {:struct, meta, name, fields}
   end

[Survived] GuardComparisonNegation
ecto/query/builder/select.ex:461:13
   end
 
   defp classify_merge({:%, meta, [name, {:%{}, _, fields}]}, _take)
-       when fields == [] or tuple_size(hd(fields)) == 2 do
+       when fields != [] or tuple_size(hd(fields)) == 2 do
     {:struct, meta, name, fields}
   end

[Killed] GuardComparisonNegation
ecto/query/builder/select.ex:466:13
   end
 
   defp classify_merge({:%{}, meta, fields}, _take)
-       when fields == [] or tuple_size(hd(fields)) == 2 do
+       when fields != [] or tuple_size(hd(fields)) == 2 do
     {:map, meta, fields}
   end

[Killed] GuardComparisonNegation
ecto/query/builder/select.ex:466:29
   end
 
   defp classify_merge({:%{}, meta, fields}, _take)
-       when fields == [] or tuple_size(hd(fields)) == 2 do
+       when fields == [] or tuple_size(hd(fields)) != 2 do
     {:map, meta, fields}
   end

[Killed] Boolean
ecto/query/builder/select.ex:479:37
   end
 
   defp merge_map_fields(old_fields, new_fields, false) do
-    if Keyword.keyword?(old_fields) and Keyword.keyword?(new_fields) do
+    if Keyword.keyword?(old_fields) Keyword.keyword?(old_fields) or Keyword.keyword?(new_fields)and Keyword.keyword?(new_fields) do
       Keyword.merge(old_fields, new_fields)
     else

[Killed] GuardTypeTest
ecto/query/builder/select.ex:486:60
     end
   end
 
-  defp merge_map_fields(old_fields, new_fields, true) when is_list(old_fields) do
+  defp merge_map_fields(old_fields, new_fields, true) when is_tuple(old_fields) do
     if Keyword.keyword?(new_fields) do
       valid? =

[Survived] Boolean
ecto/query/builder/select.ex:508:30
   defp merge_map_fields(_, _, true), do: :error
 
   defp merge_argument_to_error({:&, _, [0]}, %{from: %{source: {source, alias}}}) do
-    "source #{inspect(source || alias)}"
+    "source #{inspect(source source && alias|| alias)}"
   end
 

[Killed] Arithmetic
ecto/query/builder/select.ex:528:47
     len = length(old_subqueries)
 
     Enum.map(new_params, fn
-      {:subquery, counter} -> {:subquery, len + counter}
+      {:subquery, counter} -> {:subquery, len len * counter+ counter}
       other -> other
     end)

[Survived] Arithmetic
ecto/query/builder/select.ex:528:47
     len = length(old_subqueries)
 
     Enum.map(new_params, fn
-      {:subquery, counter} -> {:subquery, len + counter}
+      {:subquery, counter} -> {:subquery, len len - counter+ counter}
       other -> other
     end)

[Killed] GuardComparisonNegation
ecto/query/builder/select.ex:548:34
               source = Enum.at([query.from | query.joins], binding).source
 
               case source do
-                {_, schema} when schema != nil ->
+                {_, schema} when schema == nil ->
                   Map.put(acc, binding, {new_kind, Enum.uniq(new_fields ++ schema.__schema__(:query_fields))})
 
