[Killed] GuardTypeTest
ecto/query/builder/update.ex:29:36
 
   """
   @spec escape(Macro.t, Keyword.t, Macro.Env.t) :: {Macro.t, Macro.t, list}
-  def escape(expr, vars, env) when is_list(expr) do
+  def escape(expr, vars, env) when is_tuple(expr) do
     escape_op(expr, [], [], [], vars, env)
   end

[Killed] GuardTypeTest
ecto/query/builder/update.ex:41:72
     compile_error!(expr)
   end
 
-  defp escape_op([{k, v}|t], compile, runtime, params, vars, env) when is_atom(k) and is_list(v) do
+  defp escape_op([{k, v}|t], compile, runtime, params, vars, env) when is_nil(k) and is_list(v) do
     validate_op!(k)
     {compile_values, runtime_values, params} = escape_kw(k, v, params, vars, env)

[Killed] GuardTypeTest
ecto/query/builder/update.ex:41:87
     compile_error!(expr)
   end
 
-  defp escape_op([{k, v}|t], compile, runtime, params, vars, env) when is_atom(k) and is_list(v) do
+  defp escape_op([{k, v}|t], compile, runtime, params, vars, env) when is_atom(k) and is_tuple(v) do
     validate_op!(k)
     {compile_values, runtime_values, params} = escape_kw(k, v, params, vars, env)

[Killed] ComparisonNegation
ecto/query/builder/update.ex:45:25
     validate_op!(k)
     {compile_values, runtime_values, params} = escape_kw(k, v, params, vars, env)
     compile =
-      if compile_values == [], do: compile, else: [{k, Enum.reverse(compile_values)} | compile]
+      if compile_values compile_values != []== [], do: compile, else: [{k, Enum.reverse(compile_values)} | compile]
     runtime =
       if runtime_values == [], do: runtime, else: [{k, Enum.reverse(runtime_values)} | runtime]

[Killed] ComparisonNegation
ecto/query/builder/update.ex:47:25
     compile =
       if compile_values == [], do: compile, else: [{k, Enum.reverse(compile_values)} | compile]
     runtime =
-      if runtime_values == [], do: runtime, else: [{k, Enum.reverse(runtime_values)} | runtime]
+      if runtime_values runtime_values != []== [], do: runtime, else: [{k, Enum.reverse(runtime_values)} | runtime]
     escape_op(t, compile, runtime, params, vars, env)
   end

[Killed] GuardTypeTest
ecto/query/builder/update.ex:51:83
     escape_op(t, compile, runtime, params, vars, env)
   end
 
-  defp escape_op([{k, {:^, _, [v]}}|t], compile, runtime, params, vars, env) when is_atom(k) do
+  defp escape_op([{k, {:^, _, [v]}}|t], compile, runtime, params, vars, env) when is_nil(k) do
     validate_op!(k)
     escape_op(t, compile, [{k, v}|runtime], params, vars, env)

[Killed] GuardTypeTest
ecto/query/builder/update.ex:79:30
   end
 
   defp escape_field!({:^, _, [k]}), do: quote(do: Ecto.Query.Builder.Update.field!(unquote(k)))
-  defp escape_field!(k) when is_atom(k), do: k
+  defp escape_field!(k) when is_nil(k), do: k
 
   defp escape_field!(k) do

[Killed] GuardTypeTest
ecto/query/builder/update.ex:87:26
     )
   end
 
-  def field!(field) when is_atom(field), do: field
+  def field!(field) when is_nil(field), do: field
 
   def field!(other) do

[Survived] ComparisonNegation
ecto/query/builder/update.ex:112:18
     {compile, runtime, params} = escape(expr, binding, env)
 
     query =
-      if compile == [] do
+      if compile compile != []== [] do
         query
       else

[Survived] ComparisonNegation
ecto/query/builder/update.ex:125:16
         Builder.apply_query(query, __MODULE__, [update], env)
       end
 
-    if runtime == [] do
+    if runtime runtime != []== [] do
       query
     else

[Killed] GuardTypeTest
ecto/query/builder/update.ex:151:48
   we need to handle them at runtime. We do such in
   this callback.
   """
-  def update!(query, runtime, file, line) when is_list(runtime) do
+  def update!(query, runtime, file, line) when is_tuple(runtime) do
     {runtime, {params, _count}} =
       Enum.map_reduce runtime, {[], 0}, fn

[Killed] Arithmetic
ecto/query/builder/update.ex:179:49
         {{k, v}, {params, count}}
       {k, v}, {params, count} when is_atom(k) ->
         params = [{v, type_for_key(key, {0, k})} | params]
-        {{k, {:^, [], [count]}}, {params, count + 1}}
+        {{k, {:^, [], [count]}}, {params, count count * 1+ 1}}
       _, _acc ->
         raise ArgumentError, "malformed #{inspect key} in update `#{inspect(kw)}`, " <>

[Killed] Arithmetic
ecto/query/builder/update.ex:179:49
         {{k, v}, {params, count}}
       {k, v}, {params, count} when is_atom(k) ->
         params = [{v, type_for_key(key, {0, k})} | params]
-        {{k, {:^, [], [count]}}, {params, count + 1}}
+        {{k, {:^, [], [count]}}, {params, count count - 1+ 1}}
       _, _acc ->
         raise ArgumentError, "malformed #{inspect key} in update `#{inspect(kw)}`, " <>
