[Killed] GuardTypeTest
ecto/query/builder/windows.ex:21:46
   """
   @spec escape([Macro.t], {list, term}, Keyword.t, Macro.Env.t | {Macro.Env.t, fun})
           :: {Macro.t, [{atom, term}], {list, term}}
-  def escape(kw, params_acc, vars, env) when is_list(kw) do
+  def escape(kw, params_acc, vars, env) when is_tuple(kw) do
     {compile, runtime} = sort(@sort_order, kw, :compile, [], [])
     {compile, params_acc} = Enum.map_reduce(compile, params_acc, &escape_compile(&1, &2, vars, env))

[Killed] GuardComparisonNegation
ecto/query/builder/windows.ex:39:19
       {{:^, _, [var]}, kw} ->
         sort(keys, kw, :runtime, compile, [{key, var} | runtime])
 
-      {_, _} when mode == :runtime ->
+      {_, _} when mode != :runtime ->
         [{runtime_key, _} | _] = runtime
         raise ArgumentError, "window has an interpolated value under `#{runtime_key}` " <>

[Survived] GuardTypeTest
ecto/query/builder/windows.ex:94:48
   runtime work.
   """
   @spec build(Macro.t, [Macro.t], Keyword.t, Macro.Env.t) :: Macro.t
-  def build(query, binding, windows, env) when is_list(windows) do
+  def build(query, binding, windows, env) when is_tuple(windows) do
     {query, binding} = Builder.escape_binding(query, binding, env)
 
