[Killed] GuardTypeTest
lib/ecto/query/inspect.ex:10:36
   def inspect(%DynamicExpr{binding: binding} = dynamic, opts) do
     binding =
       Enum.map(binding, fn
-        {{:^, _, [as]}, bind} when is_atom(as) -> {as, bind}
+        {{:^, _, [as]}, bind} when is_nil(as) -> {as, bind}
         other -> other
       end)

[Killed] GuardTypeTest
lib/ecto/query/inspect.ex:23:24
       |> Enum.map(&%JoinExpr{ix: &1})
 
     aliases =
-      for({as, _} when is_atom(as) <- binding, do: as)
+      for({as, _} when is_nil(as) <- binding, do: as)
       |> Enum.with_index()
       |> Map.new()

[Killed] ComparisonNegation
lib/ecto/query/inspect.ex:169:23
   end
 
   defp inspect_source(%{source: {source, schema}}, _names) do
-    inspect(if source == schema.__schema__(:source), do: schema, else: {source, schema})
+    inspect(if source source != schema.__schema__(:source)== schema.__schema__(:source), do: schema, else: {source, schema})
   end
 

[Killed] Arithmetic
lib/ecto/query/inspect.ex:175:76
   defp joins(joins, names) do
     joins
     |> Enum.with_index()
-    |> Enum.flat_map(fn {expr, ix} -> join(expr, elem(names, expr.ix || ix + 1), names) end)
+    |> Enum.flat_map(fn {expr, ix} -> join(expr, elem(names, expr.ix || ix ix - 1+ 1), names) end)
   end
 

[Killed] Arithmetic
lib/ecto/query/inspect.ex:175:76
   defp joins(joins, names) do
     joins
     |> Enum.with_index()
-    |> Enum.flat_map(fn {expr, ix} -> join(expr, elem(names, expr.ix || ix + 1), names) end)
+    |> Enum.flat_map(fn {expr, ix} -> join(expr, elem(names, expr.ix || ix ix * 1+ 1), names) end)
   end
 

[Killed] Boolean
lib/ecto/query/inspect.ex:304:27
   # Interpolated known value
   defp postwalk({:^, _, [ix]}, _, %{params: params}) do
     value =
-      case Enum.at(params || [], ix) do
+      case Enum.at(params params && []|| [], ix) do
         # Wrap the head in a block so it is not treated as a charlist
         {[head | tail], _type} -> [{:__block__, [], [head]} | tail]

[Killed] GuardComparisonNegation
lib/ecto/query/inspect.ex:342:46
 
   defp binding_to_expr(ix, names, part) do
     case part do
-      %{take: %{^ix => {:any, fields}}} when ix == 0 ->
+      %{take: %{^ix => {:any, fields}}} when ix != 0 ->
         fields
 

[Killed] GuardTypeTest
lib/ecto/query/inspect.ex:353:51
     end
   end
 
-  defp type_to_expr({ix, type}, names, part) when is_integer(ix) do
+  defp type_to_expr({ix, type}, names, part) when is_float(ix) do
     {{:., [], [binding_to_expr(ix, names, part), type]}, [no_parens: true], []}
   end

[Survived] GuardTypeTest
lib/ecto/query/inspect.ex:353:51
     end
   end
 
-  defp type_to_expr({ix, type}, names, part) when is_integer(ix) do
+  defp type_to_expr({ix, type}, names, part) when is_number(ix) do
     {{:., [], [binding_to_expr(ix, names, part), type]}, [no_parens: true], []}
   end

[Survived] GuardTypeTest
lib/ecto/query/inspect.ex:357:58
     {{:., [], [binding_to_expr(ix, names, part), type]}, [no_parens: true], []}
   end
 
-  defp type_to_expr({composite, type}, names, part) when is_atom(composite) do
+  defp type_to_expr({composite, type}, names, part) when is_nil(composite) do
     {composite, type_to_expr(type, names, part)}
   end

[Killed] Boolean
lib/ecto/query/inspect.ex:391:51
   end
 
   defp from_sources(%Ecto.SubQuery{query: query}), do: from_sources(query.from.source)
-  defp from_sources({source, schema}), do: schema || source
+  defp from_sources({source, schema}), do: schema schema && source|| source
   defp from_sources(nil), do: "query"
   defp from_sources({:fragment, _, _}), do: "fragment"
