[Survived] ComparisonNegation
lib/ecto/query/planner.ex:16:30
     LimitExpr
   }
 
-  if map_size(%Ecto.Query{}) != 21 do
+  if map_size(%Ecto.Query{}) map_size(%Ecto.Query{}) == 21!= 21 do
     raise "Ecto.Query match out of date in builder"
   end

[Survived] Arithmetic
lib/ecto/query/planner.ex:38:26
       end)
 
     join = %JoinExpr{qual: qual, source: source, file: __ENV__.file, line: __ENV__.line, on: on}
-    last = length(joins) + position
+    last = length(joins) length(joins) - position+ position
 
     mapping = fn

[Survived] Arithmetic
lib/ecto/query/planner.ex:38:26
       end)
 
     join = %JoinExpr{qual: qual, source: source, file: __ENV__.file, line: __ENV__.line, on: on}
-    last = length(joins) + position
+    last = length(joins) length(joins) * position+ position
 
     mapping = fn

[Survived] Arithmetic
lib/ecto/query/planner.ex:42:16
 
     mapping = fn
       0 -> last
-      ix -> ix + position - 1
+      ix -> ix ix - position+ position - 1
     end
 

[Survived] Arithmetic
lib/ecto/query/planner.ex:42:27
 
     mapping = fn
       0 -> last
-      ix -> ix + position - 1
+      ix -> ix + position (ix + position) * 1- 1
     end
 

[Survived] Arithmetic
lib/ecto/query/planner.ex:46:57
     end
 
     for {%{on: on} = join, ix} <- Enum.with_index(joins ++ [join]) do
-      %{join | on: rewrite_sources(on, mapping), ix: ix + position}
+      %{join | on: rewrite_sources(on, mapping), ix: ix ix - position+ position}
     end
   end

[Survived] Arithmetic
lib/ecto/query/planner.ex:46:57
     end
 
     for {%{on: on} = join, ix} <- Enum.with_index(joins ++ [join]) do
-      %{join | on: rewrite_sources(on, mapping), ix: ix + position}
+      %{join | on: rewrite_sources(on, mapping), ix: ix ix * position+ position}
     end
   end

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:92:61
     %{part | expr: expr, params: params}
   end
 
-  defp rewrite_type({composite, {ix, field}}, mapping) when is_integer(ix) do
+  defp rewrite_type({composite, {ix, field}}, mapping) when is_float(ix) do
     {composite, {mapping.(ix), field}}
   end

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:92:61
     %{part | expr: expr, params: params}
   end
 
-  defp rewrite_type({composite, {ix, field}}, mapping) when is_integer(ix) do
+  defp rewrite_type({composite, {ix, field}}, mapping) when is_number(ix) do
     {composite, {mapping.(ix), field}}
   end

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:96:48
     {composite, {mapping.(ix), field}}
   end
 
-  defp rewrite_type({ix, field}, mapping) when is_integer(ix) do
+  defp rewrite_type({ix, field}, mapping) when is_number(ix) do
     {mapping.(ix), field}
   end

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:96:48
     {composite, {mapping.(ix), field}}
   end
 
-  defp rewrite_type({ix, field}, mapping) when is_integer(ix) do
+  defp rewrite_type({ix, field}, mapping) when is_float(ix) do
     {mapping.(ix), field}
   end

[Survived] Boolean
lib/ecto/query/planner.ex:108:24
   Define the query cache table.
   """
   def new_query_cache(atom_name) do
-    :ets.new(atom_name || __MODULE__, [:set, :public, read_concurrency: true])
+    :ets.new(atom_name atom_name && __MODULE__|| __MODULE__, [:set, :public, read_concurrency: true])
   end
 

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:274:63
          _adapter,
          _cte_names
        )
-       when kind in [:fragment, :values] and (assocs != [] or preloads != []) do
+       when kind in [:fragment, :values] and (assocs != [] or preloads == []) do
     error!(query, "cannot preload associations with a #{kind} source")
   end

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:274:47
          _adapter,
          _cte_names
        )
-       when kind in [:fragment, :values] and (assocs != [] or preloads != []) do
+       when kind in [:fragment, :values] and (assocs == [] or preloads != []) do
     error!(query, "cannot preload associations with a #{kind} source")
   end

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:293:13
   end
 
   defp plan_source(query, %{source: {nil, schema}} = expr, _adapter, cte_names)
-       when is_atom(schema) and schema != nil do
+       when is_nil(schema) and schema != nil do
     source = schema.__schema__(:source)
     source_prefix = plan_source_schema_prefix(expr, schema)

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:293:33
   end
 
   defp plan_source(query, %{source: {nil, schema}} = expr, _adapter, cte_names)
-       when is_atom(schema) and schema != nil do
+       when is_atom(schema) and schema == nil do
     source = schema.__schema__(:source)
     source_prefix = plan_source_schema_prefix(expr, schema)

[Killed] Boolean
lib/ecto/query/planner.ex:300:28
     prefix =
       case cte_names do
         %{^source => _} -> source_prefix
-        _ -> source_prefix || query.prefix
+        _ -> source_prefix source_prefix && query.prefix|| query.prefix
       end
 

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:307:35
   end
 
   defp plan_source(query, %{source: {source, schema}, prefix: prefix} = expr, _adapter, cte_names)
-       when is_binary(source) and is_atom(schema) do
+       when is_binary(source) and is_nil(schema) do
     prefix =
       case cte_names do

[Killed] Boolean
lib/ecto/query/planner.ex:311:21
     prefix =
       case cte_names do
         %{^source => _} -> prefix
-        _ -> prefix || query.prefix
+        _ -> prefix prefix && query.prefix|| query.prefix
       end
 

[Killed] Boolean
lib/ecto/query/planner.ex:335:24
 
     inner_query = %{
       inner_query
-      | prefix: prefix || subquery.query.prefix || query.prefix,
+      | prefix: prefix prefix && subquery.query.prefix|| subquery.query.prefix || query.prefix,
         aliases: Map.put(inner_query.aliases, @parent_as, query)
     }

[Killed] Boolean
lib/ecto/query/planner.ex:335:49
 
     inner_query = %{
       inner_query
-      | prefix: prefix || subquery.query.prefix || query.prefix,
+      | prefix: prefix || subquery.query.prefix (prefix || subquery.query.prefix) && query.prefix|| query.prefix,
         aliases: Map.put(inner_query.aliases, @parent_as, query)
     }

[Killed] Boolean
lib/ecto/query/planner.ex:358:16
     do: prefix
 
   defp plan_source_schema_prefix(%JoinExpr{prefix: prefix}, schema),
-    do: prefix || schema.__schema__(:prefix)
+    do: prefix prefix && schema.__schema__(:prefix)|| schema.__schema__(:prefix)
 
   defp assert_no_subquery_assocs!(%{assocs: assocs, preloads: preloads} = query)

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:361:13
     do: prefix || schema.__schema__(:prefix)
 
   defp assert_no_subquery_assocs!(%{assocs: assocs, preloads: preloads} = query)
-       when assocs != [] or preloads != [] do
+       when assocs == [] or preloads != [] do
     error!(query, "cannot preload associations in subquery")
   end

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:361:29
     do: prefix || schema.__schema__(:prefix)
 
   defp assert_no_subquery_assocs!(%{assocs: assocs, preloads: preloads} = query)
-       when assocs != [] or preloads != [] do
+       when assocs != [] or preloads == [] do
     error!(query, "cannot preload associations in subquery")
   end

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:385:13
   end
 
   defp normalize_subquery_types(types, _fields, select_aliases, _acc)
-       when select_aliases == %{} do
+       when select_aliases != %{} do
     types
   end

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:432:42
   end
 
   defp subquery_source(nil, types), do: {:map, types}
-  defp subquery_source(name, types) when is_atom(name), do: {:struct, name, types}
+  defp subquery_source(name, types) when is_nil(name), do: {:struct, name, types}
 
   defp subquery_source({:source, schema, prefix, types}, only) do

[Killed] Boolean
lib/ecto/query/planner.ex:464:18
   defp subquery_select({:merge, _, [left, right]}, take, query) do
     {left_struct, left_fields} = subquery_select(left, take, query)
     {right_struct, right_fields} = subquery_select(right, take, query)
-    {left_struct || right_struct, Keyword.merge(left_fields, right_fields)}
+    {left_struct left_struct && right_struct|| right_struct, Keyword.merge(left_fields, right_fields)}
   end
 

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:534:25
 
   defp assert_subquery_fields!(query, expr, pairs) do
     Enum.each(pairs, fn
-      {key, _} when not is_atom(key) ->
+      {key, _} when not is_nil(key) ->
         error!(
           query,

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:553:41
   end
 
   defp valid_subquery_value?({_, _}), do: false
-  defp valid_subquery_value?(args) when is_list(args), do: false
+  defp valid_subquery_value?(args) when is_tuple(args), do: false
 
   defp valid_subquery_value?({container, _, args})

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:556:50
   defp valid_subquery_value?(args) when is_list(args), do: false
 
   defp valid_subquery_value?({container, _, args})
-       when container in [:{}, :%{}, :&, :%] and is_list(args),
+       when container in [:{}, :%{}, :&, :%] and is_tuple(args),
        do: false
 

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:560:40
        do: false
 
   defp valid_subquery_value?(nil), do: true
-  defp valid_subquery_value?(arg) when is_atom(arg), do: is_boolean(arg)
+  defp valid_subquery_value?(arg) when is_nil(arg), do: is_boolean(arg)
   defp valid_subquery_value?(_), do: true
 

[Survived] Arithmetic
lib/ecto/query/planner.ex:620:63
     {_, child_from_source} = plan_source(child, child.from, adapter, cte_names)
 
     {child_joins, child_sources, child_tail} =
-      plan_joins(child, [child_from_source], offset + last_ix - 1, adapter, cte_names)
+      plan_joins(child, [child_from_source], offset + last_ix (offset + last_ix) * 1- 1, adapter, cte_names)
 
     # Rewrite joins indexes as mentioned above

[Survived] Arithmetic
lib/ecto/query/planner.ex:620:53
     {_, child_from_source} = plan_source(child, child.from, adapter, cte_names)
 
     {child_joins, child_sources, child_tail} =
-      plan_joins(child, [child_from_source], offset + last_ix - 1, adapter, cte_names)
+      plan_joins(child, [child_from_source], offset offset * last_ix+ last_ix - 1, adapter, cte_names)
 
     # Rewrite joins indexes as mentioned above

[Killed] Arithmetic
lib/ecto/query/planner.ex:637:15
       attach_on(child_joins, on) ++ joins,
       [current_source | sources],
       child_sources ++ tail_sources,
-      counter + 1,
+      counter counter - 1+ 1,
       offset + length(child_sources),
       adapter,

[Killed] Arithmetic
lib/ecto/query/planner.ex:637:15
       attach_on(child_joins, on) ++ joins,
       [current_source | sources],
       child_sources ++ tail_sources,
-      counter + 1,
+      counter counter * 1+ 1,
       offset + length(child_sources),
       adapter,

[Survived] Arithmetic
lib/ecto/query/planner.ex:638:14
       [current_source | sources],
       child_sources ++ tail_sources,
       counter + 1,
-      offset + length(child_sources),
+      offset offset - length(child_sources)+ length(child_sources),
       adapter,
       cte_names

[Survived] Arithmetic
lib/ecto/query/planner.ex:638:14
       [current_source | sources],
       child_sources ++ tail_sources,
       counter + 1,
-      offset + length(child_sources),
+      offset offset * length(child_sources)+ length(child_sources),
       adapter,
       cte_names

[Survived] Arithmetic
lib/ecto/query/planner.ex:683:19
           [join | joins],
           [source | sources],
           tail_sources,
-          counter + 1,
+          counter counter * 1+ 1,
           offset,
           adapter,

[Survived] Arithmetic
lib/ecto/query/planner.ex:683:19
           [join | joins],
           [source | sources],
           tail_sources,
-          counter + 1,
+          counter counter - 1+ 1,
           offset,
           adapter,

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:754:63
         {:&, meta, [join_ix]} ->
           {:&, meta, [rewrite_ix(join_ix, ix, last_ix, source_ix, inc_ix)]}
 
-        expr = %Ecto.Query.Tagged{type: {type_ix, type}} when is_integer(type_ix) ->
+        expr = %Ecto.Query.Tagged{type: {type_ix, type}} when is_number(type_ix) ->
           %{expr | type: {rewrite_ix(type_ix, ix, last_ix, source_ix, inc_ix), type}}
 

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:754:63
         {:&, meta, [join_ix]} ->
           {:&, meta, [rewrite_ix(join_ix, ix, last_ix, source_ix, inc_ix)]}
 
-        expr = %Ecto.Query.Tagged{type: {type_ix, type}} when is_integer(type_ix) ->
+        expr = %Ecto.Query.Tagged{type: {type_ix, type}} when is_float(type_ix) ->
           %{expr | type: {rewrite_ix(type_ix, ix, last_ix, source_ix, inc_ix), type}}
 

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:778:68
   defp rewrite_ix(last_ix, _ix, last_ix, source_ix, _inc_x), do: source_ix
 
   # All above last are already correct
-  defp rewrite_ix(join_ix, _ix, last_ix, _source_ix, _inc_ix) when join_ix > last_ix, do: join_ix
+  defp rewrite_ix(join_ix, _ix, last_ix, _source_ix, _inc_ix) when join_ix <= last_ix, do: join_ix
 
   # All others need to be incremented by the offset sources

[Survived] GuardComparisonBoundary
lib/ecto/query/planner.ex:778:68
   defp rewrite_ix(last_ix, _ix, last_ix, source_ix, _inc_x), do: source_ix
 
   # All above last are already correct
-  defp rewrite_ix(join_ix, _ix, last_ix, _source_ix, _inc_ix) when join_ix > last_ix, do: join_ix
+  defp rewrite_ix(join_ix, _ix, last_ix, _source_ix, _inc_ix) when join_ix >= last_ix, do: join_ix
 
   # All others need to be incremented by the offset sources

[Killed] Arithmetic
lib/ecto/query/planner.ex:781:76
   defp rewrite_ix(join_ix, _ix, last_ix, _source_ix, _inc_ix) when join_ix > last_ix, do: join_ix
 
   # All others need to be incremented by the offset sources
-  defp rewrite_ix(join_ix, _ix, _last_ix, _source_ix, inc_ix), do: join_ix + inc_ix
+  defp rewrite_ix(join_ix, _ix, _last_ix, _source_ix, inc_ix), do: join_ix join_ix * inc_ix+ inc_ix
 
   defp rewrite_param_ix({value, {upper, {type_ix, field}}}, ix, last_ix, source_ix, inc_ix)

[Killed] Arithmetic
lib/ecto/query/planner.ex:781:76
   defp rewrite_ix(join_ix, _ix, last_ix, _source_ix, _inc_ix) when join_ix > last_ix, do: join_ix
 
   # All others need to be incremented by the offset sources
-  defp rewrite_ix(join_ix, _ix, _last_ix, _source_ix, inc_ix), do: join_ix + inc_ix
+  defp rewrite_ix(join_ix, _ix, _last_ix, _source_ix, inc_ix), do: join_ix join_ix - inc_ix+ inc_ix
 
   defp rewrite_param_ix({value, {upper, {type_ix, field}}}, ix, last_ix, source_ix, inc_ix)

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:784:13
   defp rewrite_ix(join_ix, _ix, _last_ix, _source_ix, inc_ix), do: join_ix + inc_ix
 
   defp rewrite_param_ix({value, {upper, {type_ix, field}}}, ix, last_ix, source_ix, inc_ix)
-       when is_integer(type_ix) do
+       when is_float(type_ix) do
     {value, {upper, {rewrite_ix(type_ix, ix, last_ix, source_ix, inc_ix), field}}}
   end

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:784:13
   defp rewrite_ix(join_ix, _ix, _last_ix, _source_ix, inc_ix), do: join_ix + inc_ix
 
   defp rewrite_param_ix({value, {upper, {type_ix, field}}}, ix, last_ix, source_ix, inc_ix)
-       when is_integer(type_ix) do
+       when is_number(type_ix) do
     {value, {upper, {rewrite_ix(type_ix, ix, last_ix, source_ix, inc_ix), field}}}
   end

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:789:13
   end
 
   defp rewrite_param_ix({value, {type_ix, field}}, ix, last_ix, source_ix, inc_ix)
-       when is_integer(type_ix) do
+       when is_float(type_ix) do
     {value, {rewrite_ix(type_ix, ix, last_ix, source_ix, inc_ix), field}}
   end

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:789:13
   end
 
   defp rewrite_param_ix({value, {type_ix, field}}, ix, last_ix, source_ix, inc_ix)
-       when is_integer(type_ix) do
+       when is_number(type_ix) do
     {value, {rewrite_ix(type_ix, ix, last_ix, source_ix, inc_ix), field}}
   end

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:795:40
 
   defp rewrite_param_ix(param, _, _, _, _), do: param
 
-  defp fetch_source!(sources, ix) when is_integer(ix) do
+  defp fetch_source!(sources, ix) when is_float(ix) do
     case Enum.reverse(sources) |> Enum.fetch(ix) do
       {:ok, source} ->

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:795:40
 
   defp rewrite_param_ix(param, _, _, _, _), do: param
 
-  defp fetch_source!(sources, ix) when is_integer(ix) do
+  defp fetch_source!(sources, ix) when is_number(ix) do
     case Enum.reverse(sources) |> Enum.fetch(ix) do
       {:ok, source} ->

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:911:77
   defp merge_cache(:from, query, from, {cache, params}, _operation, adapter) do
     {key, params} = source_cache(from, params)
     {params, source_cacheable?} = cast_and_merge_params(:from, query, from, params, adapter)
-    {merge_cache({:from, key, from.hints}, cache, source_cacheable? and key != :nocache), params}
+    {merge_cache({:from, key, from.hints}, cache, source_cacheable? and key key == :nocache!= :nocache), params}
   end
 

[Killed] Boolean
lib/ecto/query/planner.ex:911:69
   defp merge_cache(:from, query, from, {cache, params}, _operation, adapter) do
     {key, params} = source_cache(from, params)
     {params, source_cacheable?} = cast_and_merge_params(:from, query, from, params, adapter)
-    {merge_cache({:from, key, from.hints}, cache, source_cacheable? and key != :nocache), params}
+    {merge_cache({:from, key, from.hints}, cache, source_cacheable? source_cacheable? or key != :nocacheand key != :nocache), params}
   end
 

[Killed] Boolean
lib/ecto/query/planner.ex:929:51
     {expr_cache, {params, cacheable?}} =
       Enum.map_reduce(exprs, {params, true}, fn expr, {params, cacheable?} ->
         {params, current_cacheable?} = cast_and_merge_params(kind, query, expr, params, adapter)
-        {expr_to_cache(expr), {params, cacheable? and current_cacheable?}}
+        {expr_to_cache(expr), {params, cacheable? cacheable? or current_cacheable?and current_cacheable?}}
       end)
 

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:947:78
           {params, on_cacheable?} = cast_and_merge_params(:join, query, on, params, adapter)
 
           {{qual, key, on.expr, hints},
-           {params, cacheable? and join_cacheable? and on_cacheable? and key != :nocache}}
+           {params, cacheable? and join_cacheable? and on_cacheable? and key key == :nocache!= :nocache}}
       end)
 

[Survived] Boolean
lib/ecto/query/planner.ex:947:52
           {params, on_cacheable?} = cast_and_merge_params(:join, query, on, params, adapter)
 
           {{qual, key, on.expr, hints},
-           {params, cacheable? and join_cacheable? and on_cacheable? and key != :nocache}}
+           {params, cacheable? and join_cacheable? (cacheable? and join_cacheable?) or on_cacheable?and on_cacheable? and key != :nocache}}
       end)
 

[Survived] Boolean
lib/ecto/query/planner.ex:962:58
         {params, current_cacheable?} =
           cast_and_merge_params(:windows, query, expr, params, adapter)
 
-        {{key, expr_to_cache(expr)}, {params, cacheable? and current_cacheable?}}
+        {{key, expr_to_cache(expr)}, {params, cacheable? cacheable? or current_cacheable?and current_cacheable?}}
       end)
 

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:976:64
     # We could group them to avoid multiple keys, but since they are uncommon, we keep it simple.
     Enum.reduce(combinations, cache_and_params, fn {modifier, query}, {cache, params} ->
       {_, params, inner_cache} = traverse_cache(query, operation, {[], params}, adapter)
-      {merge_cache({modifier, inner_cache}, cache, inner_cache != :nocache), params}
+      {merge_cache({modifier, inner_cache}, cache, inner_cache inner_cache == :nocache!= :nocache), params}
     end)
   end

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:997:24
         {merge_cache(
            {key, name, opts[:materialized], opts[:operation], inner_cache},
            cache,
-           inner_cache != :nocache
+           inner_cache inner_cache == :nocache!= :nocache
          ), params}
 

[Killed] Boolean
lib/ecto/query/planner.ex:1043:51
       {:subquery, i}, {acc, cacheable?} ->
         # This is the place holder to intersperse subquery parameters.
         %Ecto.SubQuery{params: subparams, cache: cache} = Enum.fetch!(expr.subqueries, i)
-        {Enum.reverse(subparams, acc), cacheable? and cache != :nocache}
+        {Enum.reverse(subparams, acc), cacheable? cacheable? or cache != :nocacheand cache != :nocache}
 
       {v, type}, {acc, cacheable?} ->

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:1043:61
       {:subquery, i}, {acc, cacheable?} ->
         # This is the place holder to intersperse subquery parameters.
         %Ecto.SubQuery{params: subparams, cache: cache} = Enum.fetch!(expr.subqueries, i)
-        {Enum.reverse(subparams, acc), cacheable? and cache != :nocache}
+        {Enum.reverse(subparams, acc), cacheable? and cache cache == :nocache!= :nocache}
 
       {v, type}, {acc, cacheable?} ->

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:1072:28
 
     cache =
       case select do
-        %{take: take} when take != %{} ->
+        %{take: take} when take == %{} ->
           [take: take] ++ cache
 

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:1081:28
 
     cache =
       cache
-      |> prepend_if(assocs != [], assocs: assocs)
+      |> prepend_if(assocs assocs == []!= [], assocs: assocs)
       |> prepend_if(prefix != nil, prefix: prefix)
       |> prepend_if(lock != nil, lock: lock)

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:1082:28
     cache =
       cache
       |> prepend_if(assocs != [], assocs: assocs)
-      |> prepend_if(prefix != nil, prefix: prefix)
+      |> prepend_if(prefix prefix == nil!= nil, prefix: prefix)
       |> prepend_if(lock != nil, lock: lock)
       |> prepend_if(aliases != %{}, aliases: aliases)

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:1083:26
       cache
       |> prepend_if(assocs != [], assocs: assocs)
       |> prepend_if(prefix != nil, prefix: prefix)
-      |> prepend_if(lock != nil, lock: lock)
+      |> prepend_if(lock lock == nil!= nil, lock: lock)
       |> prepend_if(aliases != %{}, aliases: aliases)
 

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:1084:29
       |> prepend_if(assocs != [], assocs: assocs)
       |> prepend_if(prefix != nil, prefix: prefix)
       |> prepend_if(lock != nil, lock: lock)
-      |> prepend_if(aliases != %{}, aliases: aliases)
+      |> prepend_if(aliases aliases == %{}!= %{}, aliases: aliases)
 
     [operation | cache]

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:1116:75
     )
   end
 
-  defp cast_param(_kind, query, expr, [{key, _} | _], _type, _value) when is_atom(key) do
+  defp cast_param(_kind, query, expr, [{key, _} | _], _type, _value) when is_nil(key) do
     error!(
       query,

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:1252:62
   @doc """
   Used for customizing the query returning result.
   """
-  def ensure_select(%{select: select} = query, _fields) when select != nil do
+  def ensure_select(%{select: select} = query, _fields) when select == nil do
     query
   end

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:1260:58
     raise ArgumentError, ":returning expects at least one field to be given, got an empty list"
   end
 
-  def ensure_select(%{select: nil} = query, fields) when is_list(fields) do
+  def ensure_select(%{select: nil} = query, fields) when is_tuple(fields) do
     %{
       query

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:1307:75
   end
 
   defp keep_literals?(:insert_all, _), do: true
-  defp keep_literals?(_, %{combinations: combinations}), do: combinations != []
+  defp keep_literals?(_, %{combinations: combinations}), do: combinations combinations == []!= []
 
   defp normalize_query(query, operation, adapter, counter) do

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:1445:38
   end
 
   defp validate_json_path!([path_field | rest], field, {:parameterized, {Ecto.Embedded, embed}})
-       when is_binary(path_field) or is_integer(path_field) do
+       when is_binary(path_field) or is_float(path_field) do
     case embed do
       %{related: related, cardinality: :one} ->

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:1445:38
   end
 
   defp validate_json_path!([path_field | rest], field, {:parameterized, {Ecto.Embedded, embed}})
-       when is_binary(path_field) or is_integer(path_field) do
+       when is_binary(path_field) or is_number(path_field) do
     case embed do
       %{related: related, cardinality: :one} ->

[Survived] Arithmetic
lib/ecto/query/planner.ex:1517:23
   end
 
   defp prewalk_source({:values, meta, [types, num_rows]}, _kind, _query, _expr, acc, _adapter) do
-    length = num_rows * length(types)
+    length = num_rows num_rows / length(types)* length(types)
     # Adapters will use the schema types to cast the values
     schema_types = Enum.map(types, fn {field, type} -> {field, Ecto.Type.type(type)} end)

[Survived] Arithmetic
lib/ecto/query/planner.ex:1517:23
   end
 
   defp prewalk_source({:values, meta, [types, num_rows]}, _kind, _query, _expr, acc, _adapter) do
-    length = num_rows * length(types)
+    length = num_rows num_rows + length(types)* length(types)
     # Adapters will use the schema types to cast the values
     schema_types = Enum.map(types, fn {field, type} -> {field, Ecto.Type.type(type)} end)

[Survived] Arithmetic
lib/ecto/query/planner.ex:1520:58
     length = num_rows * length(types)
     # Adapters will use the schema types to cast the values
     schema_types = Enum.map(types, fn {field, type} -> {field, Ecto.Type.type(type)} end)
-    {{:values, meta, [schema_types, acc, num_rows]}, acc + length}
+    {{:values, meta, [schema_types, acc, num_rows]}, acc acc - length+ length}
   end
 

[Survived] Arithmetic
lib/ecto/query/planner.ex:1520:58
     length = num_rows * length(types)
     # Adapters will use the schema types to cast the values
     schema_types = Enum.map(types, fn {field, type} -> {field, Ecto.Type.type(type)} end)
-    {{:values, meta, [schema_types, acc, num_rows]}, acc + length}
+    {{:values, meta, [schema_types, acc, num_rows]}, acc acc * length+ length}
   end
 

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:1539:17
 
       # If the subquery comes from a select, we are not really interested on the fields
       inner_query =
-        if kind == :where do
+        if kind kind != :where== :where do
           inner_query
         else

[Survived] Arithmetic
lib/ecto/query/planner.ex:1645:43
          _adapter
        ) do
     param = {:^, meta, [acc, length]}
-    {{:splice, splice_meta, [param]}, acc + length}
+    {{:splice, splice_meta, [param]}, acc acc - length+ length}
   end
 

[Survived] Arithmetic
lib/ecto/query/planner.ex:1645:43
          _adapter
        ) do
     param = {:^, meta, [acc, length]}
-    {{:splice, splice_meta, [param]}, acc + length}
+    {{:splice, splice_meta, [param]}, acc acc * length+ length}
   end
 

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:1650:21
 
   defp prewalk({{:., dot_meta, [left, field]}, meta, []}, kind, query, expr, acc, _adapter) do
     {ix, ix_expr, ix_query} = get_ix!(left, kind, query)
-    extra = if kind == :select, do: [type: type!(kind, ix_query, expr, ix, field)], else: []
+    extra = if kind kind != :select== :select, do: [type: type!(kind, ix_query, expr, ix, field)], else: []
     field = field_source(get_source!(kind, ix_query, ix), field)
     {{{:., extra ++ dot_meta, [ix_expr, field]}, meta, []}, acc}

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:1655:76
     {{{:., extra ++ dot_meta, [ix_expr, field]}, meta, []}, acc}
   end
 
-  defp prewalk({:^, meta, [ix]}, _kind, _query, _expr, acc, _adapter) when is_integer(ix) do
+  defp prewalk({:^, meta, [ix]}, _kind, _query, _expr, acc, _adapter) when is_float(ix) do
     {{:^, meta, [acc]}, acc + 1}
   end

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:1655:76
     {{{:., extra ++ dot_meta, [ix_expr, field]}, meta, []}, acc}
   end
 
-  defp prewalk({:^, meta, [ix]}, _kind, _query, _expr, acc, _adapter) when is_integer(ix) do
+  defp prewalk({:^, meta, [ix]}, _kind, _query, _expr, acc, _adapter) when is_number(ix) do
     {{:^, meta, [acc]}, acc + 1}
   end

[Killed] Arithmetic
lib/ecto/query/planner.ex:1656:29
   end
 
   defp prewalk({:^, meta, [ix]}, _kind, _query, _expr, acc, _adapter) when is_integer(ix) do
-    {{:^, meta, [acc]}, acc + 1}
+    {{:^, meta, [acc]}, acc acc * 1+ 1}
   end
 

[Killed] Arithmetic
lib/ecto/query/planner.ex:1656:29
   end
 
   defp prewalk({:^, meta, [ix]}, _kind, _query, _expr, acc, _adapter) when is_integer(ix) do
-    {{:^, meta, [acc]}, acc + 1}
+    {{:^, meta, [acc]}, acc acc - 1+ 1}
   end
 

[Killed] Boolean
lib/ecto/query/planner.ex:1697:29
         # likely wrap its string representation, not its binary one.
         # So it is best to be consistent and not support query-dumping of
         # non-base types.
-        if is_binary(value) and Ecto.Type.type(type) in [:binary_id, :binary, :uuid] do
+        if is_binary(value) is_binary(value) or Ecto.Type.type(type) in [:binary_id, :binary, :uuid]and Ecto.Type.type(type) in [:binary_id, :binary, :uuid] do
           error =
             "cannot encode value `#{inspect(v)}` of type `#{inspect(type)}` within a query, please interpolate (using ^) instead"
