[Killed] GuardTypeTest
lib/ecto/query/planner.ex:1729:60
     {{left, meta, args}, acc}
   end
 
-  defp prewalk(list, kind, query, expr, acc, adapter) when is_list(list) do
+  defp prewalk(list, kind, query, expr, acc, adapter) when is_tuple(list) do
     Enum.map_reduce(list, acc, &prewalk(&1, kind, query, expr, &2, adapter))
   end

[Killed] Arithmetic
lib/ecto/query/planner.ex:1753:57
     length = length(v)
 
     case adapter.dumpers(t, t) do
-      [{:in, _} | _] -> {{:^, meta, [acc, length]}, acc + length}
+      [{:in, _} | _] -> {{:^, meta, [acc, length]}, acc acc * length+ length}
       _ -> {{:^, meta, [acc, length]}, acc + 1}
     end

[Killed] Arithmetic
lib/ecto/query/planner.ex:1753:57
     length = length(v)
 
     case adapter.dumpers(t, t) do
-      [{:in, _} | _] -> {{:^, meta, [acc, length]}, acc + length}
+      [{:in, _} | _] -> {{:^, meta, [acc, length]}, acc acc - length+ length}
       _ -> {{:^, meta, [acc, length]}, acc + 1}
     end

[Survived] Arithmetic
lib/ecto/query/planner.ex:1754:44
 
     case adapter.dumpers(t, t) do
       [{:in, _} | _] -> {{:^, meta, [acc, length]}, acc + length}
-      _ -> {{:^, meta, [acc, length]}, acc + 1}
+      _ -> {{:^, meta, [acc, length]}, acc acc * 1+ 1}
     end
   end

[Survived] Arithmetic
lib/ecto/query/planner.ex:1754:44
 
     case adapter.dumpers(t, t) do
       [{:in, _} | _] -> {{:^, meta, [acc, length]}, acc + length}
-      _ -> {{:^, meta, [acc, length]}, acc + 1}
+      _ -> {{:^, meta, [acc, length]}, acc acc - 1+ 1}
     end
   end

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:1774:14
     {take, from_tag} =
       case source do
         {source, schema, _}
-        when tag == :map and preloads != [] and is_binary(source) and schema != nil ->
+        when tag != :map and preloads != [] and is_binary(source) and schema != nil ->
           {Map.put(take, 0, {:struct, from_take}), :map}
 

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:1774:30
     {take, from_tag} =
       case source do
         {source, schema, _}
-        when tag == :map and preloads != [] and is_binary(source) and schema != nil ->
+        when tag == :map and preloads == [] and is_binary(source) and schema != nil ->
           {Map.put(take, 0, {:struct, from_take}), :map}
 

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:1792:38
           preprocess = [from_expr | Enum.reverse(assoc_exprs)]
           {fields, preprocess, {from_tag, from_source}}
 
-        :none when preloads != [] or assocs != [] ->
+        :none when preloads != [] or assocs == [] ->
           error!(
             query,

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:1792:20
           preprocess = [from_expr | Enum.reverse(assoc_exprs)]
           {fields, preprocess, {from_tag, from_source}}
 
-        :none when preloads != [] or assocs != [] ->
+        :none when preloads == [] or assocs != [] ->
           error!(
             query,

[Survived] ComparisonNegation
lib/ecto/query/planner.ex:1931:25
     {left_type, _, _} = collect_fields(left, fields, from, query, take, true, %{})
     {right_type, _, _} = collect_fields(right, fields, from, query, take, true, %{})
 
-    type = if left_type == right_type, do: left_type, else: {:value, :any}
+    type = if left_type left_type != right_type== right_type, do: left_type, else: {:value, :any}
     {type, [expr | fields], from}
   end

[Killed] UnaryNot
lib/ecto/query/planner.ex:1944:28
          keep_literals?,
          _drop
        ) do
-    if is_atom(window) and not Keyword.has_key?(query.windows, window) do
+    if is_atom(window) and Keyword.has_key?(query.windows, window)not Keyword.has_key?(query.windows, window) do
       error!(query, "unknown window #{inspect(window)} given to over/2")
     end

[Survived] Boolean
lib/ecto/query/planner.ex:1944:24
          keep_literals?,
          _drop
        ) do
-    if is_atom(window) and not Keyword.has_key?(query.windows, window) do
+    if is_atom(window) is_atom(window) or not Keyword.has_key?(query.windows, window)and not Keyword.has_key?(query.windows, window) do
       error!(query, "unknown window #{inspect(window)} given to over/2")
     end

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:2057:13
   end
 
   defp collect_fields(args, fields, from, query, take, keep_literals?, _drop)
-       when is_list(args) do
+       when is_tuple(args) do
     {args, fields, from} = collect_args(args, fields, from, query, take, keep_literals?, [])
     {{:list, args}, fields, from}

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:2066:76
     {{:value, :binary}, [expr | fields], from}
   end
 
-  defp collect_fields(expr, fields, from, _query, _take, true, _drop) when is_integer(expr) do
+  defp collect_fields(expr, fields, from, _query, _take, true, _drop) when is_number(expr) do
     {{:value, :integer}, [expr | fields], from}
   end

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:2066:76
     {{:value, :binary}, [expr | fields], from}
   end
 
-  defp collect_fields(expr, fields, from, _query, _take, true, _drop) when is_integer(expr) do
+  defp collect_fields(expr, fields, from, _query, _take, true, _drop) when is_float(expr) do
     {{:value, :integer}, [expr | fields], from}
   end

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:2070:76
     {{:value, :integer}, [expr | fields], from}
   end
 
-  defp collect_fields(expr, fields, from, _query, _take, true, _drop) when is_float(expr) do
+  defp collect_fields(expr, fields, from, _query, _take, true, _drop) when is_number(expr) do
     {{:value, :float}, [expr | fields], from}
   end

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:2070:76
     {{:value, :integer}, [expr | fields], from}
   end
 
-  defp collect_fields(expr, fields, from, _query, _take, true, _drop) when is_float(expr) do
+  defp collect_fields(expr, fields, from, _query, _take, true, _drop) when is_integer(expr) do
     {{:value, :float}, [expr | fields], from}
   end

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:2083:13
   end
 
   defp collect_fields(expr, fields, from, _query, _take, _keep_literals?, _drop)
-       when is_atom(expr) do
+       when is_nil(expr) do
     {expr, fields, from}
   end

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:2088:32
   end
 
   defp collect_fields(expr, fields, from, _query, _take, false, _drop)
-       when is_binary(expr) or is_number(expr) do
+       when is_binary(expr) or is_float(expr) do
     {expr, fields, from}
   end

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:2088:32
   end
 
   defp collect_fields(expr, fields, from, _query, _take, false, _drop)
-       when is_binary(expr) or is_number(expr) do
+       when is_binary(expr) or is_integer(expr) do
     {expr, fields, from}
   end

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:2216:26
 
       {{:ok, {kind, fields}}, {source, schema, prefix}} when is_binary(source) ->
         dumper = if schema, do: schema.__schema__(:dump), else: %{}
-        schema = if kind == :map, do: nil, else: schema
+        schema = if kind kind != :map== :map, do: nil, else: schema
         {types, fields} = select_dump(List.wrap(fields), dumper, ix, drop)
         {{:source, {source, schema}, prefix || query.prefix, types}, fields}

[Survived] Boolean
lib/ecto/query/planner.ex:2218:45
         dumper = if schema, do: schema.__schema__(:dump), else: %{}
         schema = if kind == :map, do: nil, else: schema
         {types, fields} = select_dump(List.wrap(fields), dumper, ix, drop)
-        {{:source, {source, schema}, prefix || query.prefix, types}, fields}
+        {{:source, {source, schema}, prefix prefix && query.prefix|| query.prefix, types}, fields}
 
       {{:ok, {_, fields}}, _} ->

[Killed] Boolean
lib/ecto/query/planner.ex:2245:45
         {types, fields} =
           select_dump(schema.__schema__(:query_fields), schema.__schema__(:dump), ix, drop)
 
-        {{:source, {source, schema}, prefix || query.prefix, types}, fields}
+        {{:source, {source, schema}, prefix prefix && query.prefix|| query.prefix, types}, fields}
 
       {:error, %Ecto.SubQuery{select: select}} ->

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:2272:47
 
     schema =
       case select do
-        {:source, {_, schema}, _, _} when not is_nil(schema) -> schema
+        {:source, {_, schema}, _, _} when not is_atom(schema) -> schema
 
         _ ->

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:2313:40
   defp get_ix!({:parent_as, meta, [as]}, kind, query) do
     case query.aliases[@parent_as] do
       %{aliases: %{^as => ix}, sources: sources} = query ->
-        if kind == :select and not (ix < tuple_size(sources)) do
+        if kind == :select and not (ix ix >= tuple_size(sources)< tuple_size(sources)) do
           error!(
             query,

[Killed] Boolean
lib/ecto/query/planner.ex:2313:28
   defp get_ix!({:parent_as, meta, [as]}, kind, query) do
     case query.aliases[@parent_as] do
       %{aliases: %{^as => ix}, sources: sources} = query ->
-        if kind == :select and not (ix < tuple_size(sources)) do
+        if kind == :select kind == :select or not (ix < tuple_size(sources))and not (ix < tuple_size(sources)) do
           error!(
             query,

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:2343:60
 
   defp get_preload_source!(query, ix) do
     case get_source!(:preload, query, ix) do
-      {source, schema, _} = all when is_binary(source) and schema != nil ->
+      {source, schema, _} = all when is_binary(source) and schema == nil ->
         all
 

[Survived] GuardComparisonNegation
lib/ecto/query/planner.ex:2347:34
         all
 
       %Ecto.SubQuery{select: {:source, {source, schema}, _, _}} = subquery
-      when is_binary(source) and schema != nil ->
+      when is_binary(source) and schema == nil ->
         subquery
 

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:2362:56
   @doc """
   Puts the prefix given via `opts` into the given query, if available.
   """
-  def attach_prefix(%{prefix: nil} = query, opts) when is_list(opts) do
+  def attach_prefix(%{prefix: nil} = query, opts) when is_tuple(opts) do
     case Keyword.fetch(opts, :prefix) do
       {:ok, prefix} ->

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:2439:13
   defp field_type!(kind, query, expr, type, allow_virtuals? \\ false)
 
   defp field_type!(kind, query, expr, {composite, {ix, field}}, allow_virtuals?)
-       when is_integer(ix) do
+       when is_float(ix) do
     {composite, type!(kind, query, expr, ix, field, allow_virtuals?)}
   end

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:2439:13
   defp field_type!(kind, query, expr, type, allow_virtuals? \\ false)
 
   defp field_type!(kind, query, expr, {composite, {ix, field}}, allow_virtuals?)
-       when is_integer(ix) do
+       when is_number(ix) do
     {composite, type!(kind, query, expr, ix, field, allow_virtuals?)}
   end

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:2461:74
     type!(kind, ix_query, expr, ix, field, allow_virtuals?)
   end
 
-  defp field_type!(kind, query, expr, {ix, field}, allow_virtuals?) when is_integer(ix) do
+  defp field_type!(kind, query, expr, {ix, field}, allow_virtuals?) when is_float(ix) do
     type!(kind, query, expr, ix, field, allow_virtuals?)
   end

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:2461:74
     type!(kind, ix_query, expr, ix, field, allow_virtuals?)
   end
 
-  defp field_type!(kind, query, expr, {ix, field}, allow_virtuals?) when is_integer(ix) do
+  defp field_type!(kind, query, expr, {ix, field}, allow_virtuals?) when is_number(ix) do
     type!(kind, query, expr, ix, field, allow_virtuals?)
   end

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:2475:66
 
   defp type!(_kind, _query, _expr, _ix, field, _allow_virtuals?) when is_binary(field), do: :any
 
-  defp type!(kind, query, expr, ix, field, allow_virtuals?) when is_integer(ix) do
+  defp type!(kind, query, expr, ix, field, allow_virtuals?) when is_float(ix) do
     case get_source!(kind, query, ix) do
       {:fragment, _, _} ->

[Survived] GuardTypeTest
lib/ecto/query/planner.ex:2475:66
 
   defp type!(_kind, _query, _expr, _ix, field, _allow_virtuals?) when is_binary(field), do: :any
 
-  defp type!(kind, query, expr, ix, field, allow_virtuals?) when is_integer(ix) do
+  defp type!(kind, query, expr, ix, field, allow_virtuals?) when is_number(ix) do
     case get_source!(kind, query, ix) do
       {:fragment, _, _} ->

[Killed] GuardTypeTest
lib/ecto/query/planner.ex:2500:70
     end
   end
 
-  defp type!(kind, query, expr, schema, field, allow_virtuals?) when is_atom(schema) do
+  defp type!(kind, query, expr, schema, field, allow_virtuals?) when is_nil(schema) do
     cond do
       type = schema.__schema__(:type, field) ->

[Killed] Boolean
lib/ecto/query/planner.ex:2505:30
       type = schema.__schema__(:type, field) ->
         type
 
-      type = allow_virtuals? && schema.__schema__(:virtual_type, field) ->
+      type = allow_virtuals? allow_virtuals? || schema.__schema__(:virtual_type, field)&& schema.__schema__(:virtual_type, field) ->
         type
 

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:2550:48
 
     schema.__schema__(:fields)
     |> Enum.map(fn field -> {field, String.jaro_distance(input_string, Atom.to_string(field))} end)
-    |> Enum.filter(fn {_field, score} -> score >= 0.77 end)
+    |> Enum.filter(fn {_field, score} -> score score < 0.77>= 0.77 end)
     |> Enum.sort(&(elem(&1, 0) >= elem(&2, 0)))
     |> Enum.take(5)

[Survived] ComparisonBoundary
lib/ecto/query/planner.ex:2550:48
 
     schema.__schema__(:fields)
     |> Enum.map(fn field -> {field, String.jaro_distance(input_string, Atom.to_string(field))} end)
-    |> Enum.filter(fn {_field, score} -> score >= 0.77 end)
+    |> Enum.filter(fn {_field, score} -> score score > 0.77>= 0.77 end)
     |> Enum.sort(&(elem(&1, 0) >= elem(&2, 0)))
     |> Enum.take(5)

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:2615:76
     end
   end
 
-  defp field_source({source, schema, _}, field) when is_binary(source) and schema != nil do
+  defp field_source({source, schema, _}, field) when is_binary(source) and schema == nil do
     # If the field is not found we return the field itself
     # which will be checked and raise later.

[Killed] Boolean
lib/ecto/query/planner.ex:2618:45
   defp field_source({source, schema, _}, field) when is_binary(source) and schema != nil do
     # If the field is not found we return the field itself
     # which will be checked and raise later.
-    schema.__schema__(:field_source, field) || field
+    schema.__schema__(:field_source, field) schema.__schema__(:field_source, field) && field|| field
   end
 

[Killed] ComparisonNegation
lib/ecto/query/planner.ex:2671:16
         end)
       end)
 
-    if changes == %{} do
+    if changes changes != %{}== %{} do
       error!(query, "`#{operation}` requires at least one field to be updated")
     end

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:2703:14
       } ->
         query
 
-      _ when operation == :delete_all ->
+      _ when operation != :delete_all ->
         error!(
           query,

[Killed] GuardComparisonNegation
lib/ecto/query/planner.ex:2723:54
 
   defp dumper_for_update(query) do
     case get_source!(:updates, query, 0) do
-      {source, schema, _} when is_binary(source) and schema != nil ->
+      {source, schema, _} when is_binary(source) and schema == nil ->
         schema.__schema__(:dump)
 
