[Killed] GuardTypeTest
lib/ecto/queryable.ex:148:34
 
 defimpl Ecto.Queryable, for: Tuple do
   def to_query({source, schema} = from)
-      when is_binary(source) and is_atom(schema) and not is_nil(schema) do
+      when is_binary(source) and is_nil(schema) and not is_nil(schema) do
     %Ecto.Query{from: %Ecto.Query.FromExpr{source: from, prefix: schema.__schema__(:prefix)}}
   end

[Killed] GuardTypeTest
lib/ecto/queryable.ex:148:58
 
 defimpl Ecto.Queryable, for: Tuple do
   def to_query({source, schema} = from)
-      when is_binary(source) and is_atom(schema) and not is_nil(schema) do
+      when is_binary(source) and is_atom(schema) and not is_atom(schema) do
     %Ecto.Query{from: %Ecto.Query.FromExpr{source: from, prefix: schema.__schema__(:prefix)}}
   end
