[Killed] ComparisonNegation
lib/ecto/repo/assoc.ex:46:70
               # preloads. For preloads we have to treat maps with all `nil` values as
               # `nil` instead of a map otherwise we can't associate the missing
               # association to the parent struct
-              %{^primary_key => value} -> {value, all_nil? and value == nil}
+              %{^primary_key => value} -> {value, all_nil? and value value != nil== nil}
               %{} -> raise Ecto.NoPrimaryKeyValueError, struct: struct
             end

[Killed] Boolean
lib/ecto/repo/assoc.ex:46:60
               # preloads. For preloads we have to treat maps with all `nil` values as
               # `nil` instead of a map otherwise we can't associate the missing
               # association to the parent struct
-              %{^primary_key => value} -> {value, all_nil? and value == nil}
+              %{^primary_key => value} -> {value, all_nil? all_nil? or value == niland value == nil}
               %{} -> raise Ecto.NoPrimaryKeyValueError, struct: struct
             end

[Killed] Boolean
lib/ecto/repo/assoc.ex:63:15
 
     cache_key = cache_key(parent_key, child_key, sub_structs, dict)
 
-    if struct && parent_key && not Map.get(cache, cache_key, false) do
+    if struct struct || parent_key&& parent_key && not Map.get(cache, cache_key, false) do
       cache = Map.put(cache, cache_key, true)
       item = {child_key, struct}

[Killed] UnaryNot
lib/ecto/repo/assoc.ex:63:32
 
     cache_key = cache_key(parent_key, child_key, sub_structs, dict)
 
-    if struct && parent_key && not Map.get(cache, cache_key, false) do
+    if struct && parent_key && Map.get(cache, cache_key, false)not Map.get(cache, cache_key, false) do
       cache = Map.put(cache, cache_key, true)
       item = {child_key, struct}

[Killed] GuardTypeTest
lib/ecto/repo/assoc.ex:76:65
     end
   end
 
-  defp cache_key(parent_key, child_key, sub_structs, dict) when is_list(dict) do
+  defp cache_key(parent_key, child_key, sub_structs, dict) when is_tuple(dict) do
     {parent_key, child_key, sub_structs}
   end

[Killed] GuardTypeTest
lib/ecto/repo/assoc.ex:80:66
     {parent_key, child_key, sub_structs}
   end
 
-  defp cache_key(parent_key, child_key, _sub_structs, dict) when is_map(dict) do
+  defp cache_key(parent_key, child_key, _sub_structs, dict) when is_list(dict) do
     {parent_key, child_key}
   end

[Killed] GuardTypeTest
lib/ecto/repo/assoc.ex:84:63
     {parent_key, child_key}
   end
 
-  defp update_dict(dict, _parent_key, item, sub_structs) when is_list(dict) do
+  defp update_dict(dict, _parent_key, item, sub_structs) when is_tuple(dict) do
     [{item, sub_structs} | dict]
   end

[Killed] GuardTypeTest
lib/ecto/repo/assoc.ex:88:63
     [{item, sub_structs} | dict]
   end
 
-  defp update_dict(dict, parent_key, item, _sub_structs) when is_map(dict) do
+  defp update_dict(dict, parent_key, item, _sub_structs) when is_list(dict) do
     Map.update(dict, parent_key, [item], &[item | &1])
   end
