[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:45:82
     nil
   end
 
-  def preload(structs, repo_name, preloads, {_adapter_meta, opts} = tuplet) when is_list(structs) do
+  def preload(structs, repo_name, preloads, {_adapter_meta, opts} = tuplet) when is_tuple(structs) do
     normalize_and_preload_each(structs, repo_name, preloads, opts[:take], %{}, tuplet)
   end

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:49:81
     normalize_and_preload_each(structs, repo_name, preloads, opts[:take], %{}, tuplet)
   end
 
-  def preload(struct, repo_name, preloads, {_adapter_meta, opts} = tuplet) when is_map(struct) do
+  def preload(struct, repo_name, preloads, {_adapter_meta, opts} = tuplet) when is_list(struct) do
     normalize_and_preload_each([struct], repo_name, preloads, opts[:take], %{}, tuplet) |> hd()
   end

[Killed] ComparisonNegation
lib/ecto/repo/preloader.ex:121:24
         {fetch_ids, loaded_ids, loaded_structs} = fetch_ids(structs, module, assoc, tuplet)
 
         queries =
-          if fetch_ids != [] do
+          if fetch_ids fetch_ids == []!= [] do
             [
               fn tuplet ->

[Killed] ComparisonNegation
lib/ecto/repo/preloader.ex:132:29
             queries
           end
 
-        {[{assoc, fetch_ids != [], loaded_ids, loaded_structs, preloads} | assocs], queries}
+        {[{assoc, fetch_ids fetch_ids == []!= [], loaded_ids, loaded_structs, preloads} | assocs], queries}
     end)
   end

[Killed] UnaryNot
lib/ecto/repo/preloader.ex:138:44
 
   # Then we execute queries in parallel
   defp maybe_pmap(preloaders, _repo_name, {adapter_meta, opts}) do
-    if match?([_, _ | _] , preloaders) and not adapter_meta.adapter.checked_out?(adapter_meta) and
+    if match?([_, _ | _] , preloaders) and adapter_meta.adapter.checked_out?(adapter_meta)not adapter_meta.adapter.checked_out?(adapter_meta) and
          Keyword.get(opts, :in_parallel, true) do
       # We pass caller: self() so the ownership pool knows where

[Killed] Boolean
lib/ecto/repo/preloader.ex:138:96
 
   # Then we execute queries in parallel
   defp maybe_pmap(preloaders, _repo_name, {adapter_meta, opts}) do
-    if match?([_, _ | _] , preloaders) and not adapter_meta.adapter.checked_out?(adapter_meta) and
+    if match?([_, _ | _] , preloaders) and not adapter_meta.adapter.checked_out?(adapter_meta) (match?([_, _ | _], preloaders) and not adapter_meta.adapter.checked_out?(adapter_meta)) or
+  Keyword.get(opts, :in_parallel, true)and
          Keyword.get(opts, :in_parallel, true) do
       # We pass caller: self() so the ownership pool knows where

[Killed] Boolean
lib/ecto/repo/preloader.ex:261:45
       struct, {fetch_ids, loaded_ids, loaded_structs} ->
         assert_struct!(module, struct)
         %{^owner_key => id, ^field => value} = struct
-        loaded? = Ecto.assoc_loaded?(value) and not force?
+        loaded? = Ecto.assoc_loaded?(value) Ecto.assoc_loaded?(value) or not force?and not force?
 
         if loaded? and is_nil(id) and not Ecto.Changeset.Relation.empty?(assoc, value) do

[Killed] UnaryNot
lib/ecto/repo/preloader.ex:261:49
       struct, {fetch_ids, loaded_ids, loaded_structs} ->
         assert_struct!(module, struct)
         %{^owner_key => id, ^field => value} = struct
-        loaded? = Ecto.assoc_loaded?(value) and not force?
+        loaded? = Ecto.assoc_loaded?(value) and force?not force?
 
         if loaded? and is_nil(id) and not Ecto.Changeset.Relation.empty?(assoc, value) do

[Killed] Boolean
lib/ecto/repo/preloader.ex:263:20
         %{^owner_key => id, ^field => value} = struct
         loaded? = Ecto.assoc_loaded?(value) and not force?
 
-        if loaded? and is_nil(id) and not Ecto.Changeset.Relation.empty?(assoc, value) do
+        if loaded? loaded? or is_nil(id)and is_nil(id) and not Ecto.Changeset.Relation.empty?(assoc, value) do
           Logger.warning """
           association `#{field}` for `#{inspect(module)}` has a loaded value but \

[Killed] Boolean
lib/ecto/repo/preloader.ex:263:35
         %{^owner_key => id, ^field => value} = struct
         loaded? = Ecto.assoc_loaded?(value) and not force?
 
-        if loaded? and is_nil(id) and not Ecto.Changeset.Relation.empty?(assoc, value) do
+        if loaded? and is_nil(id) (loaded? and is_nil(id)) or not Ecto.Changeset.Relation.empty?(assoc, value)and not Ecto.Changeset.Relation.empty?(assoc, value) do
           Logger.warning """
           association `#{field}` for `#{inspect(module)}` has a loaded value but \

[Killed] Boolean
lib/ecto/repo/preloader.ex:276:24
         end
 
         cond do
-          card == :one and loaded? ->
+          card == :one card == :one or loaded?and loaded? ->
             {fetch_ids, [id | loaded_ids], [value | loaded_structs]}
           card == :many and loaded? ->

[Killed] ComparisonNegation
lib/ecto/repo/preloader.ex:276:16
         end
 
         cond do
-          card == :one and loaded? ->
+          card card != :one== :one and loaded? ->
             {fetch_ids, [id | loaded_ids], [value | loaded_structs]}
           card == :many and loaded? ->

[Killed] Boolean
lib/ecto/repo/preloader.ex:278:25
         cond do
           card == :one and loaded? ->
             {fetch_ids, [id | loaded_ids], [value | loaded_structs]}
-          card == :many and loaded? ->
+          card == :many card == :many or loaded?and loaded? ->
             {fetch_ids, [{id, length(value)} | loaded_ids], value ++ loaded_structs}
           is_nil(id) ->

[Killed] ComparisonNegation
lib/ecto/repo/preloader.ex:278:16
         cond do
           card == :one and loaded? ->
             {fetch_ids, [id | loaded_ids], [value | loaded_structs]}
-          card == :many and loaded? ->
+          card card != :many== :many and loaded? ->
             {fetch_ids, [{id, length(value)} | loaded_ids], value ++ loaded_structs}
           is_nil(id) ->

[Killed] ComparisonNegation
lib/ecto/repo/preloader.ex:296:47
     |> Enum.uniq()
     |> preload_function(assoc, query)
     |> fetched_records_to_tuple_ids(assoc, related_key)
-    |> Enum.sort(fn {id1, _}, {id2, _} -> id1 <= id2 end)
+    |> Enum.sort(fn {id1, _}, {id2, _} -> id1 id1 > id2<= id2 end)
     |> unzip_ids([], [])
   end

[Killed] ComparisonBoundary
lib/ecto/repo/preloader.ex:296:47
     |> Enum.uniq()
     |> preload_function(assoc, query)
     |> fetched_records_to_tuple_ids(assoc, related_key)
-    |> Enum.sort(fn {id1, _}, {id2, _} -> id1 <= id2 end)
+    |> Enum.sort(fn {id1, _}, {id2, _} -> id1 id1 < id2<= id2 end)
     |> unzip_ids([], [])
   end

[Killed] Boolean
lib/ecto/repo/preloader.ex:305:60
     related_field_ast = related_key_to_field(query, related_key)
 
     # Normalize query
-    query = %{Ecto.Query.Planner.ensure_select(query, take || true) | prefix: prefix}
+    query = %{Ecto.Query.Planner.ensure_select(query, take take && true|| true) | prefix: prefix}
 
     # Add the related key to the query results

[Killed] GuardComparisonBoundary
lib/ecto/repo/preloader.ex:391:42
     {{:., [], [{:&, [], [related_key_pos(query, pos)]}, key]}, [], []}
   end
 
-  defp related_key_pos(_query, pos) when pos >= 0, do: pos
+  defp related_key_pos(_query, pos) when pos > 0, do: pos
   defp related_key_pos(query, pos), do: Ecto.Query.Builder.count_binds(query) + pos
 

[Killed] GuardComparisonNegation
lib/ecto/repo/preloader.ex:391:42
     {{:., [], [{:&, [], [related_key_pos(query, pos)]}, key]}, [], []}
   end
 
-  defp related_key_pos(_query, pos) when pos >= 0, do: pos
+  defp related_key_pos(_query, pos) when pos < 0, do: pos
   defp related_key_pos(query, pos), do: Ecto.Query.Builder.count_binds(query) + pos
 

[Killed] Arithmetic
lib/ecto/repo/preloader.ex:392:79
   end
 
   defp related_key_pos(_query, pos) when pos >= 0, do: pos
-  defp related_key_pos(query, pos), do: Ecto.Query.Builder.count_binds(query) + pos
+  defp related_key_pos(query, pos), do: Ecto.Query.Builder.count_binds(query) Ecto.Query.Builder.count_binds(query) - pos+ pos
 
   defp add_preload_order([], query), do: query

[Killed] Arithmetic
lib/ecto/repo/preloader.ex:392:79
   end
 
   defp related_key_pos(_query, pos) when pos >= 0, do: pos
-  defp related_key_pos(query, pos), do: Ecto.Query.Builder.count_binds(query) + pos
+  defp related_key_pos(query, pos), do: Ecto.Query.Builder.count_binds(query) Ecto.Query.Builder.count_binds(query) * pos+ pos
 
   defp add_preload_order([], query), do: query

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:396:45
 
   defp add_preload_order([], query), do: query
 
-  defp add_preload_order(order, query) when is_list(order) do
+  defp add_preload_order(order, query) when is_tuple(order) do
     Ecto.Query.prepend_order_by(query, [q], ^order)
   end

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:403:20
   defp add_preload_order({m, f, a}, query) do
     order =
       case apply(m, f, a) do
-        order when is_list(order) ->
+        order when is_tuple(order) ->
           order
 

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:413:31
       end
 
     Enum.each(order, fn
-      {direction, field} when is_atom(field) or is_struct(field, DynamicExpr) ->
+      {direction, field} when is_nil(field) or is_struct(field, DynamicExpr) ->
         unless Ecto.Query.Builder.OrderBy.valid_direction?(direction) do
           raise ArgumentError,

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:422:18
 
         :ok
 
-      field when is_atom(field) or is_struct(field, DynamicExpr) ->
+      field when is_nil(field) or is_struct(field, DynamicExpr) ->
         :ok
 

[Killed] Arithmetic
lib/ecto/repo/preloader.ex:470:68
   end
 
   defp split_n(structs, 0, acc), do: {acc, structs}
-  defp split_n([struct | structs], n, acc), do: split_n(structs, n - 1, [struct | acc])
+  defp split_n([struct | structs], n, acc), do: split_n(structs, n n + 1- 1, [struct | acc])
 
   defp split_while([id|ids], [struct|structs], id, acc),

[Killed] Arithmetic
lib/ecto/repo/preloader.ex:470:68
   end
 
   defp split_n(structs, 0, acc), do: {acc, structs}
-  defp split_n([struct | structs], n, acc), do: split_n(structs, n - 1, [struct | acc])
+  defp split_n([struct | structs], n, acc), do: split_n(structs, n n * 1- 1, [struct | acc])
 
   defp split_while([id|ids], [struct|structs], id, acc),

[Killed] GuardComparisonNegation
lib/ecto/repo/preloader.ex:490:16
     loaded =
       case ids do
         %{^key => value} -> value
-        _ when cardinality == :many -> []
+        _ when cardinality != :many -> []
         _ -> nil
       end

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:588:13
   end
 
   defp normalize_each({atom, {query, list}}, acc, take, original)
-       when is_atom(atom) and (is_map(query) or is_function(query, 1) or is_function(query, 2)) do
+       when is_nil(atom) and (is_map(query) or is_function(query, 1) or is_function(query, 2)) do
     fields = take(take, atom)
     [{atom, {fields, query!(query), normalize_each(wrap(list, original), [], fields, original)}}|acc]

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:588:32
   end
 
   defp normalize_each({atom, {query, list}}, acc, take, original)
-       when is_atom(atom) and (is_map(query) or is_function(query, 1) or is_function(query, 2)) do
+       when is_atom(atom) and (is_list(query) or is_function(query, 1) or is_function(query, 2)) do
     fields = take(take, atom)
     [{atom, {fields, query!(query), normalize_each(wrap(list, original), [], fields, original)}}|acc]

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:594:32
   end
 
   defp normalize_each({atom, query}, acc, take, _original)
-       when is_atom(atom) and (is_map(query) or is_function(query, 1) or is_function(query, 2)) do
+       when is_atom(atom) and (is_list(query) or is_function(query, 1) or is_function(query, 2)) do
     [{atom, {take(take, atom), query!(query), []}}|acc]
   end

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:594:13
   end
 
   defp normalize_each({atom, query}, acc, take, _original)
-       when is_atom(atom) and (is_map(query) or is_function(query, 1) or is_function(query, 2)) do
+       when is_nil(atom) and (is_map(query) or is_function(query, 1) or is_function(query, 2)) do
     [{atom, {take(take, atom), query!(query), []}}|acc]
   end

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:598:63
     [{atom, {take(take, atom), query!(query), []}}|acc]
   end
 
-  defp normalize_each({atom, list}, acc, take, original) when is_atom(atom) do
+  defp normalize_each({atom, list}, acc, take, original) when is_nil(atom) do
     fields = take(take, atom)
     [{atom, {fields, nil, normalize_each(wrap(list, original), [], fields, original)}}|acc]

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:603:56
     [{atom, {fields, nil, normalize_each(wrap(list, original), [], fields, original)}}|acc]
   end
 
-  defp normalize_each(atom, acc, take, _original) when is_atom(atom) do
+  defp normalize_each(atom, acc, take, _original) when is_nil(atom) do
     [{atom, {take(take, atom), nil, []}}|acc]
   end

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:622:35
     end
   end
 
-  defp wrap(list, _original) when is_list(list),
+  defp wrap(list, _original) when is_tuple(list),
     do: list
   defp wrap(atom, _original) when is_atom(atom),

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:624:35
 
   defp wrap(list, _original) when is_list(list),
     do: list
-  defp wrap(atom, _original) when is_atom(atom),
+  defp wrap(atom, _original) when is_nil(atom),
     do: atom
   defp wrap(other, original) do

[Killed] GuardTypeTest
lib/ecto/repo/preloader.ex:633:44
 
   defp normalize_query_assocs([]), do: %{}
 
-  defp normalize_query_assocs(assocs) when is_list(assocs) do
+  defp normalize_query_assocs(assocs) when is_tuple(assocs) do
     Enum.reduce(assocs, %{}, &normalize_each_query_assoc(&1, &2))
   end

[Killed] ComparisonNegation
lib/ecto/repo/preloader.ex:671:27
           end
 
         :embed ->
-          if sub_preloads == [] do
+          if sub_preloads sub_preloads != []== [] do
             raise ArgumentError,
                   "cannot preload embedded field #{inspect(assoc_or_embed.field)} " <>

[Killed] Boolean
lib/ecto/repo/preloader.ex:693:46
   end
 
   defp association_or_embed!(schema, preload) do
-    schema.__schema__(:association, preload) || schema.__schema__(:embed, preload) ||
+    schema.__schema__(:association, preload) schema.__schema__(:association, preload) && schema.__schema__(:embed, preload)|| schema.__schema__(:embed, preload) ||
       raise ArgumentError, "schema #{inspect schema} does not have association or embed #{inspect preload}#{maybe_module(preload)}"
   end

[Killed] Boolean
lib/ecto/repo/preloader.ex:693:84
   end
 
   defp association_or_embed!(schema, preload) do
-    schema.__schema__(:association, preload) || schema.__schema__(:embed, preload) ||
+    schema.__schema__(:association, preload) || schema.__schema__(:embed, preload) (schema.__schema__(:association, preload) || schema.__schema__(:embed, preload)) &&
+  raise ArgumentError,
+        "schema #{inspect(schema)} does not have association or embed #{inspect(preload)}#{maybe_module(preload)}"||
       raise ArgumentError, "schema #{inspect schema} does not have association or embed #{inspect preload}#{maybe_module(preload)}"
   end
