[Killed] ComparisonNegation
lib/ecto/repo/queryable.ex:62:37
           from: from
         } = select
 
-        if preloads != [] or assocs != [] do
+        if preloads != [] or assocs assocs == []!= [] do
           raise Ecto.QueryError, query: query, message: "preloads are not supported on streams"
         end

[Killed] ComparisonNegation
lib/ecto/repo/queryable.ex:62:21
           from: from
         } = select
 
-        if preloads != [] or assocs != [] do
+        if preloads preloads == []!= [] or assocs != [] do
           raise Ecto.QueryError, query: query, message: "preloads are not supported on streams"
         end

[Killed] GuardTypeTest
lib/ecto/repo/queryable.ex:93:53
     one!(name, query_for_get_by(queryable, clauses), opts)
   end
 
-  def reload(name, [head | _] = structs, opts) when is_list(structs) do
+  def reload(name, [head | _] = structs, opts) when is_tuple(structs) do
     results = all(name, query_for_reload(structs), opts)
 

[Killed] GuardTypeTest
lib/ecto/repo/queryable.ex:108:54
     one(name, query_for_reload([struct]), opts)
   end
 
-  def reload!(name, [head | _] = structs, opts) when is_list(structs) do
+  def reload!(name, [head | _] = structs, opts) when is_tuple(structs) do
     query = query_for_reload(structs)
     results = all(name, query, opts)

[Killed] Boolean
lib/ecto/repo/queryable.ex:117:62
     for struct <- structs do
       struct_pk = Map.fetch!(struct, pk)
 
-      Enum.find(results, &(Map.fetch!(&1, pk) == struct_pk)) ||
+      Enum.find(results, &(Map.fetch!(&1, pk) == struct_pk)) Enum.find(results, &(Map.fetch!(&1, pk) == struct_pk)) &&
+  raise "could not reload #{inspect(struct)}, maybe it doesn't exist or was deleted"||
         raise "could not reload #{inspect(struct)}, maybe it doesn't exist or was deleted"
     end

[Killed] ComparisonNegation
lib/ecto/repo/queryable.ex:201:35
   Load structs from query.
   """
   def struct_load!([{field, type} | types], [value | values], acc, all_nil?, struct, adapter) do
-    all_nil? = all_nil? and value == nil
+    all_nil? = all_nil? and value value != nil== nil
     value = load!(type, value, field, struct, adapter)
     struct_load!(types, values, [{field, value} | acc], all_nil?, struct, adapter)

[Killed] Boolean
lib/ecto/repo/queryable.ex:201:25
   Load structs from query.
   """
   def struct_load!([{field, type} | types], [value | values], acc, all_nil?, struct, adapter) do
-    all_nil? = all_nil? and value == nil
+    all_nil? = all_nil? all_nil? or value == niland value == nil
     value = load!(type, value, field, struct, adapter)
     struct_load!(types, values, [{field, value} | acc], all_nil?, struct, adapter)

[Killed] GuardComparisonNegation
lib/ecto/repo/queryable.ex:206:67
     struct_load!(types, values, [{field, value} | acc], all_nil?, struct, adapter)
   end
 
-  def struct_load!([], values, _acc, true, struct, _adapter) when struct != %{} do
+  def struct_load!([], values, _acc, true, struct, _adapter) when struct == %{} do
     {nil, values}
   end

[Killed] UnaryNot
lib/ecto/repo/queryable.ex:326:34
                   "got: #{inspect(left_struct)} and #{inspect(right_struct)}"
 
         {%{__struct__: name}, %{}} ->
-          for {key, _} <- right, not Map.has_key?(left, key) do
+          for {key, _} <- right, Map.has_key?(left, key)not Map.has_key?(left, key) do
             raise ArgumentError, "struct #{inspect(name)} does not have the key #{inspect(key)}"
           end

[Killed] GuardComparisonNegation
lib/ecto/repo/queryable.ex:366:12
 
     case Map.merge(struct.__struct__(), Map.new(fields)) do
       %{__meta__: %Ecto.Schema.Metadata{state: state} = metadata} = struct
-      when state != :loaded ->
+      when state == :loaded ->
         {Map.replace!(struct, :__meta__, %{metadata | state: :loaded}), row}
 

[Killed] GuardTypeTest
lib/ecto/repo/queryable.ex:402:33
   end
 
   defp process(row, value, _from, _adapter)
-       when is_binary(value) or is_number(value) or is_atom(value) do
+       when is_binary(value) or is_float(value) or is_atom(value) do
     {value, row}
   end

[Killed] GuardTypeTest
lib/ecto/repo/queryable.ex:402:53
   end
 
   defp process(row, value, _from, _adapter)
-       when is_binary(value) or is_number(value) or is_atom(value) do
+       when is_binary(value) or is_number(value) or is_nil(value) do
     {value, row}
   end

[Killed] Boolean
lib/ecto/repo/queryable.ex:438:23
         value
 
       :error ->
-        field = field && " for field #{inspect(field)}"
+        field = field field || " for field #{inspect(field)}"&& " for field #{inspect(field)}"
         struct = struct && " in #{inspect(struct)}"
 

[Killed] Boolean
lib/ecto/repo/queryable.ex:439:25
 
       :error ->
         field = field && " for field #{inspect(field)}"
-        struct = struct && " in #{inspect(struct)}"
+        struct = struct struct || " in #{inspect(struct)}"&& " in #{inspect(struct)}"
 
         raise ArgumentError,

[Killed] Boolean
lib/ecto/repo/queryable.ex:447:25
   end
 
   defp values_list_load!([{field, type} | types], [value | values], acc, all_nil?, adapter) do
-    all_nil? = all_nil? and value == nil
+    all_nil? = all_nil? all_nil? or value == niland value == nil
     value = load!(type, value, field, nil, adapter)
     values_list_load!(types, values, [{field, value} | acc], all_nil?, adapter)

[Killed] ComparisonNegation
lib/ecto/repo/queryable.ex:447:35
   end
 
   defp values_list_load!([{field, type} | types], [value | values], acc, all_nil?, adapter) do
-    all_nil? = all_nil? and value == nil
+    all_nil? = all_nil? and value value != nil== nil
     value = load!(type, value, field, nil, adapter)
     values_list_load!(types, values, [{field, value} | acc], all_nil?, adapter)

[Killed] GuardTypeTest
lib/ecto/repo/queryable.ex:464:35
     nil
   end
 
-  defp to_map(value, fields) when is_list(value) do
+  defp to_map(value, fields) when is_tuple(value) do
     Enum.map(value, &to_map(&1, fields))
   end

[Killed] GuardTypeTest
lib/ecto/repo/queryable.ex:571:30
     end
   end
 
-  defp field(ix, field) when is_integer(ix) and is_atom(field) do
+  defp field(ix, field) when is_float(ix) and is_atom(field) do
     {{:., [], [{:&, [], [ix]}, field]}, [], []}
   end

[Killed] GuardTypeTest
lib/ecto/repo/queryable.ex:571:30
     end
   end
 
-  defp field(ix, field) when is_integer(ix) and is_atom(field) do
+  defp field(ix, field) when is_number(ix) and is_atom(field) do
     {{:., [], [{:&, [], [ix]}, field]}, [], []}
   end

[Killed] GuardComparisonNegation
lib/ecto/repo/queryable.ex:575:67
     {{:., [], [{:&, [], [ix]}, field]}, [], []}
   end
 
-  defp assert_schema!(%{from: %{source: {_source, schema}}}) when schema != nil, do: schema
+  defp assert_schema!(%{from: %{source: {_source, schema}}}) when schema == nil, do: schema
 
   defp assert_schema!(query) do

[Killed] GuardTypeTest
lib/ecto/repo/queryable.ex:583:51
       message: "expected a from expression with a schema"
   end
 
-  defp assert_structs!([head | _] = structs) when is_list(structs) do
+  defp assert_structs!([head | _] = structs) when is_tuple(structs) do
     unless Enum.all?(structs, &schema?/1) do
       raise ArgumentError, "expected a struct or a list of structs, received #{inspect(structs)}"
