[Killed] Boolean
lib/ecto/repo/registry.ex:16:12
 
   def all_running() do
     for [pid, name] <- :ets.match(__MODULE__, {:"$1", :_, :"$2", :_}) do
-      name || pid
+      name name && pid|| pid
     end
   end

[Killed] GuardTypeTest
lib/ecto/repo/registry.ex:20:25
     end
   end
 
-  def lookup(repo) when is_atom(repo) do
+  def lookup(repo) when is_nil(repo) do
     GenServer.whereis(repo)
     |> Kernel.||(raise "could not lookup Ecto repo #{inspect repo} because it was not started or it does not exist")
