[Killed] GuardTypeTest
lib/ecto/repo/schema.ex:15:57
   @doc """
   Implementation for `Ecto.Repo.insert_all/3`.
   """
-  def insert_all(repo, name, schema, rows, tuplet) when is_atom(schema) do
+  def insert_all(repo, name, schema, rows, tuplet) when is_nil(schema) do
     do_insert_all(
       repo,

[Killed] GuardTypeTest
lib/ecto/repo/schema.ex:31:67
     do_insert_all(repo, name, nil, nil, table, rows, tuplet)
   end
 
-  def insert_all(repo, name, {source, schema}, rows, tuplet) when is_atom(schema) do
+  def insert_all(repo, name, {source, schema}, rows, tuplet) when is_nil(schema) do
     do_insert_all(repo, name, schema, schema.__schema__(:prefix), source, rows, tuplet)
   end

[Killed] Boolean
lib/ecto/repo/schema.ex:45:25
 
   defp do_insert_all(repo, _name, schema, prefix, source, rows_or_query, {adapter_meta, opts}) do
     %{adapter: adapter} = adapter_meta
-    autogen_id = schema && schema.__schema__(:autogenerate_id)
+    autogen_id = schema schema || schema.__schema__(:autogenerate_id)&& schema.__schema__(:autogenerate_id)
     dumper = schema && schema.__schema__(:dump)
     placeholder_map = Keyword.get(opts, :placeholders, %{})

[Killed] Boolean
lib/ecto/repo/schema.ex:46:21
   defp do_insert_all(repo, _name, schema, prefix, source, rows_or_query, {adapter_meta, opts}) do
     %{adapter: adapter} = adapter_meta
     autogen_id = schema && schema.__schema__(:autogenerate_id)
-    dumper = schema && schema.__schema__(:dump)
+    dumper = schema schema || schema.__schema__(:dump)&& schema.__schema__(:dump)
     placeholder_map = Keyword.get(opts, :placeholders, %{})
 

[Killed] GuardTypeTest
lib/ecto/repo/schema.ex:125:13
          adapter,
          _opts
        )
-       when is_list(rows) do
+       when is_tuple(rows) do
     mapper = init_mapper(schema, dumper, adapter, placeholder_map)
 

[Killed] UnaryNot
lib/ecto/repo/schema.ex:185:17
 
           unchanged_fields =
             for {{:., _, [{:&, _, [^ix]}, field]}, [], []} = expr <- fields,
-                not MapSet.member?(updated_set, field),
+                MapSet.member?(updated_set, field)not MapSet.member?(updated_set, field),
                 do: insert_all_select_dump!(expr)
 

[Killed] GuardComparisonNegation
lib/ecto/repo/schema.ex:248:52
   defp init_mapper(schema, dumper, adapter, placeholder_map) do
     fn {field, value}, acc ->
       case dumper do
-        %{^field => {source, type, writable}} when writable != :never ->
+        %{^field => {source, type, writable}} when writable == :never ->
           extract_value(source, value, type, placeholder_map, acc, fn val ->
             dump_field!(:insert_all, schema, field, type, val, adapter)

[Killed] Arithmetic
lib/ecto/repo/schema.ex:303:61
           end
 
         placeholder_dump = Map.put(placeholder_dump, key, {counter, type, cast_value, dump_value})
-        {{:placeholder, counter}, placeholder_dump, counter + 1}
+        {{:placeholder, counter}, placeholder_dump, counter counter - 1+ 1}
     end
   end

[Killed] Arithmetic
lib/ecto/repo/schema.ex:303:61
           end
 
         placeholder_dump = Map.put(placeholder_dump, key, {counter, type, cast_value, dump_value})
-        {{:placeholder, counter}, placeholder_dump, counter + 1}
+        {{:placeholder, counter}, placeholder_dump, counter counter * 1+ 1}
     end
   end

[Killed] Arithmetic
lib/ecto/repo/schema.ex:320:68
               num_params = length(dump_params)
 
               {[{key, {query, dump_params}}],
-               {Enum.reverse(cast_params, cast_param_acc), counter + num_params}}
+               {Enum.reverse(cast_params, cast_param_acc), counter counter - num_params+ num_params}}
 
             {^key, {:placeholder, _} = value} ->

[Killed] Arithmetic
lib/ecto/repo/schema.ex:320:68
               num_params = length(dump_params)
 
               {[{key, {query, dump_params}}],
-               {Enum.reverse(cast_params, cast_param_acc), counter + num_params}}
+               {Enum.reverse(cast_params, cast_param_acc), counter counter * num_params+ num_params}}
 
             {^key, {:placeholder, _} = value} ->

[Killed] Arithmetic
lib/ecto/repo/schema.ex:326:77
               {[{key, value}], {cast_param_acc, counter}}
 
             {^key, cast_value, dump_value} ->
-              {[{key, dump_value}], {[cast_value | cast_param_acc], counter + 1}}
+              {[{key, dump_value}], {[cast_value | cast_param_acc], counter counter - 1+ 1}}
 
             false ->

[Killed] Arithmetic
lib/ecto/repo/schema.ex:326:77
               {[{key, value}], {cast_param_acc, counter}}
 
             {^key, cast_value, dump_value} ->
-              {[{key, dump_value}], {[cast_value | cast_param_acc], counter + 1}}
+              {[{key, dump_value}], {[cast_value | cast_param_acc], counter counter * 1+ 1}}
 
             false ->

[Killed] ComparisonNegation
lib/ecto/repo/schema.ex:338:28
   end
 
   defp insert_all_select_dump!({{:., dot_meta, [{:&, _, [_]}, field]}, [], []}) do
-    if dot_meta[:writable] == :never do
+    if dot_meta[:writable] dot_meta[:writable] != :never== :never do
       raise ArgumentError, "cannot select unwritable field `#{inspect(field)}` for insert_all"
     else

[Killed] GuardTypeTest
lib/ecto/repo/schema.ex:345:52
     end
   end
 
-  defp insert_all_select_dump!(field, dumper) when is_atom(field) do
+  defp insert_all_select_dump!(field, dumper) when is_nil(field) do
     case dumper do
       %{^field => {source, _, writable}} when writable != :never ->

[Killed] GuardComparisonNegation
lib/ecto/repo/schema.ex:347:47
 
   defp insert_all_select_dump!(field, dumper) when is_atom(field) do
     case dumper do
-      %{^field => {source, _, writable}} when writable != :never ->
+      %{^field => {source, _, writable}} when writable == :never ->
         source
 

[Killed] UnaryNot
lib/ecto/repo/schema.ex:547:14
     assocs = schema.__schema__(:associations)
     embeds = schema.__schema__(:embeds)
 
-    force? = !!opts[:force]
+    force? = !opts[:force]!!opts[:force]
     filters = add_pk_filter!(changeset.filters, struct)
 

[Killed] Boolean
lib/ecto/repo/schema.ex:562:33
     changeset = put_repo_and_action(changeset, :update, repo, tuplet)
     changeset = update_in(changeset.changes, &Map.drop(&1, drop_fields))
 
-    if changeset.changes != %{} or force? do
+    if changeset.changes != %{} changeset.changes != %{} and force?or force? do
       wrap_in_transaction(adapter, adapter_meta, opts, changeset, assocs, embeds, prepare, fn ->
         assoc_opts = assoc_opts(assocs, opts)

[Killed] ComparisonNegation
lib/ecto/repo/schema.ex:562:26
     changeset = put_repo_and_action(changeset, :update, repo, tuplet)
     changeset = update_in(changeset.changes, &Map.drop(&1, drop_fields))
 
-    if changeset.changes != %{} or force? do
+    if changeset.changes changeset.changes == %{}!= %{} or force? do
       wrap_in_transaction(adapter, adapter_meta, opts, changeset, assocs, embeds, prepare, fn ->
         assoc_opts = assoc_opts(assocs, opts)

[Killed] ComparisonNegation
lib/ecto/repo/schema.ex:590:24
 
           # If there are no changes or all the changes were autogenerated but not forced, we skip
           {action, autogen} =
-            if changes != %{} or (autogen != [] and force?),
+            if changes changes == %{}!= %{} or (autogen != [] and force?),
               do: {:update, autogen},
               else: {:noop, []}

[Killed] Boolean
lib/ecto/repo/schema.ex:590:31
 
           # If there are no changes or all the changes were autogenerated but not forced, we skip
           {action, autogen} =
-            if changes != %{} or (autogen != [] and force?),
+            if changes != %{} changes != %{} and (autogen != [] and force?)or (autogen != [] and force?),
               do: {:update, autogen},
               else: {:noop, []}

[Killed] ComparisonNegation
lib/ecto/repo/schema.ex:698:61
       |> add_read_after_writes(schema)
       |> fields_to_sources(dumper)
 
-    wrap_in_transaction(adapter, adapter_meta, opts, assocs != [], prepare, fn ->
+    wrap_in_transaction(adapter, adapter_meta, opts, assocs assocs == []!= [], prepare, fn ->
       changeset = run_prepare(changeset, prepare)
 

[Killed] GuardTypeTest
lib/ecto/repo/schema.ex:754:43
     do_load(schema_or_types, data, &Ecto.Type.adapter_load(adapter, &1, &2))
   end
 
-  defp do_load(schema, data, loader) when is_list(data),
+  defp do_load(schema, data, loader) when is_tuple(data),
     do: do_load(schema, Map.new(data), loader)
 

[Killed] GuardTypeTest
lib/ecto/repo/schema.ex:757:55
   defp do_load(schema, data, loader) when is_list(data),
     do: do_load(schema, Map.new(data), loader)
 
-  defp do_load(schema, {fields, values}, loader) when is_list(fields) and is_list(values),
+  defp do_load(schema, {fields, values}, loader) when is_tuple(fields) and is_list(values),
     do: do_load(schema, Enum.zip(fields, values), loader)
 

[Killed] GuardTypeTest
lib/ecto/repo/schema.ex:757:75
   defp do_load(schema, data, loader) when is_list(data),
     do: do_load(schema, Map.new(data), loader)
 
-  defp do_load(schema, {fields, values}, loader) when is_list(fields) and is_list(values),
+  defp do_load(schema, {fields, values}, loader) when is_list(fields) and is_tuple(values),
     do: do_load(schema, Enum.zip(fields, values), loader)
 

[Killed] GuardTypeTest
lib/ecto/repo/schema.ex:760:43
   defp do_load(schema, {fields, values}, loader) when is_list(fields) and is_list(values),
     do: do_load(schema, Enum.zip(fields, values), loader)
 
-  defp do_load(schema, data, loader) when is_atom(schema),
+  defp do_load(schema, data, loader) when is_nil(schema),
     do: Ecto.Schema.Loader.unsafe_load(schema, data, loader)
 

[Killed] GuardTypeTest
lib/ecto/repo/schema.ex:763:42
   defp do_load(schema, data, loader) when is_atom(schema),
     do: Ecto.Schema.Loader.unsafe_load(schema, data, loader)
 
-  defp do_load(types, data, loader) when is_map(types),
+  defp do_load(types, data, loader) when is_list(types),
     do: Ecto.Schema.Loader.unsafe_load(%{}, types, data, loader)
 

[Killed] GuardTypeTest
lib/ecto/repo/schema.ex:777:17
         raise ArgumentError,
               ":returning expects at least one field to be given, got an empty list"
 
-      true when is_nil(schema) ->
+      true when is_atom(schema) ->
         raise ArgumentError, ":returning option can only be set to true if a schema is given"
 

[Killed] GuardComparisonNegation
lib/ecto/repo/schema.ex:828:30
   end
 
   defp put_repo_and_action(%{action: given}, action, repo, _tuplet)
-       when given != nil and given != action,
+       when given != nil and given == action,
        do:
          raise(

[Killed] GuardComparisonNegation
lib/ecto/repo/schema.ex:828:13
   end
 
   defp put_repo_and_action(%{action: given}, action, repo, _tuplet)
-       when given != nil and given != action,
+       when given == nil and given != action,
        do:
          raise(

[Killed] GuardTypeTest
lib/ecto/repo/schema.ex:883:18
         %{^target => {alias, _, _}} ->
           alias
 
-        %{} when is_atom(target) ->
+        %{} when is_nil(target) ->
           raise ArgumentError, "unknown field `#{inspect(target)}` in conflict_target"
 

[Killed] GuardComparisonNegation
lib/ecto/repo/schema.ex:896:19
     %{source: source, schema: schema, prefix: prefix} = schema_meta
 
     case on_conflict do
-      :raise when conflict_target == [] ->
+      :raise when conflict_target != [] ->
         {{:raise, [], []}, []}
 

[Killed] GuardTypeTest
lib/ecto/repo/schema.ex:909:29
         raise ArgumentError,
               ":on_conflict option with `{:replace, fields}` requires a non-empty list of fields"
 
-      {:replace, keys} when is_list(keys) ->
+      {:replace, keys} when is_tuple(keys) ->
         {{replace_fields!(dumper, keys), [], conflict_target}, []}
 

[Killed] ComparisonNegation
lib/ecto/repo/schema.ex:919:20
         to_remove = List.wrap(conflict_target)
         replace = replace_all_fields!(:replace_all, schema, to_remove)
 
-        if replace == [], do: raise(ArgumentError, "empty list of fields to update, use the `:replace` option instead")
+        if replace replace != []== [], do: raise(ArgumentError, "empty list of fields to update, use the `:replace` option instead")
 
         {{replace, [], conflict_target}, []}

[Killed] Boolean
lib/ecto/repo/schema.ex:973:45
   end
 
   defp field_source!(schema, field) do
-    schema.__schema__(:field_source, field) ||
+    schema.__schema__(:field_source, field) schema.__schema__(:field_source, field) &&
+  raise ArgumentError, "unknown field for :on_conflict, got: #{inspect(field)}"||
       raise ArgumentError, "unknown field for :on_conflict, got: #{inspect(field)}"
   end

[Killed] ComparisonNegation
lib/ecto/repo/schema.ex:983:30
 
     {cast_params, dump_params} = Enum.unzip(params)
 
-    unless query.from.source == from do
+    unless query.from.source query.from.source != from== from do
       raise ArgumentError,
             "cannot run on_conflict: query because the query " <>

[Killed] GuardTypeTest
lib/ecto/repo/schema.ex:1014:43
           {:ok, []}
         else
           case Keyword.fetch(opts, :stale_error_field) do
-            {:ok, stale_error_field} when is_atom(stale_error_field) ->
+            {:ok, stale_error_field} when is_nil(stale_error_field) ->
               stale_message = Keyword.get(opts, :stale_error_message, "is stale")
 

[Killed] GuardComparisonNegation
lib/ecto/repo/schema.ex:1146:61
     %{field: field, owner_key: owner_key, related_key: related_key} = assoc
 
     with %{^owner_key => owner_value} <- changes,
-         %{^field => %{^related_key => related_value}} when owner_value != related_value <- data do
+         %{^field => %{^related_key => related_value}} when owner_value == related_value <- data do
       true
     else

[Killed] Boolean
lib/ecto/repo/schema.ex:1183:23
     Enum.reduce(assocs, changes, fn {refl, _}, acc ->
       %{field: field, owner_key: owner_key, related_key: related_key} = refl
       related = Map.get(struct, field)
-      value = related && Map.fetch!(related, related_key)
+      value = related related || Map.fetch!(related, related_key)&& Map.fetch!(related, related_key)
 
       case Map.fetch(changes, owner_key) do

[Killed] GuardComparisonNegation
lib/ecto/repo/schema.ex:1186:29
       value = related && Map.fetch!(related, related_key)
 
       case Map.fetch(changes, owner_key) do
-        {:ok, current} when current != value ->
+        {:ok, current} when current == value ->
           raise ArgumentError,
                 "cannot change belongs_to association `#{field}` because there is " <>

[Killed] GuardComparisonNegation
lib/ecto/repo/schema.ex:1211:45
   defp to_delete_assocs(schema) do
     for assoc <- schema.__schema__(:associations),
         reflection = schema.__schema__(:association, assoc),
-        match?(%{on_delete: on_delete} when on_delete != :nothing, reflection),
+        match?(%{on_delete: on_delete} when on_delete == :nothing, reflection),
         do: reflection
   end

[Killed] Boolean
lib/ecto/repo/schema.ex:1276:53
   defp wrap_in_transaction(adapter, adapter_meta, opts, changeset, assocs, embeds, prepare, fun) do
     %{changes: changes} = changeset
     changed = &Map.has_key?(changes, &1)
-    relations_changed? = Enum.any?(assocs, changed) or Enum.any?(embeds, changed)
+    relations_changed? = Enum.any?(assocs, changed) Enum.any?(assocs, changed) and Enum.any?(embeds, changed)or Enum.any?(embeds, changed)
     wrap_in_transaction(adapter, adapter_meta, opts, relations_changed?, prepare, fun)
   end

[Killed] Boolean
lib/ecto/repo/schema.ex:1281:28
   end
 
   defp wrap_in_transaction(adapter, adapter_meta, opts, relations_changed?, prepare, fun) do
-    if (relations_changed? or prepare != []) and
+    if (relations_changed? relations_changed? and prepare != []or prepare != []) and
          function_exported?(adapter, :transaction, 3) and
          not adapter.in_transaction?(adapter_meta) do

[Killed] Boolean
lib/ecto/repo/schema.ex:1281:46
   end
 
   defp wrap_in_transaction(adapter, adapter_meta, opts, relations_changed?, prepare, fun) do
-    if (relations_changed? or prepare != []) and
+    if (relations_changed? or prepare != []) relations_changed? or prepare != [] or
+  function_exported?(adapter, :transaction, 3)and
          function_exported?(adapter, :transaction, 3) and
          not adapter.in_transaction?(adapter_meta) do

[Killed] Boolean
lib/ecto/repo/schema.ex:1282:55
 
   defp wrap_in_transaction(adapter, adapter_meta, opts, relations_changed?, prepare, fun) do
     if (relations_changed? or prepare != []) and
-         function_exported?(adapter, :transaction, 3) and
+         function_exported?(adapter, :transaction, 3) ((relations_changed? or prepare != []) and
+   function_exported?(adapter, :transaction, 3)) or
+  not adapter.in_transaction?(adapter_meta)and
          not adapter.in_transaction?(adapter_meta) do
       adapter.transaction(adapter_meta, opts, fn ->

[Killed] UnaryNot
lib/ecto/repo/schema.ex:1283:10
   defp wrap_in_transaction(adapter, adapter_meta, opts, relations_changed?, prepare, fun) do
     if (relations_changed? or prepare != []) and
          function_exported?(adapter, :transaction, 3) and
-         not adapter.in_transaction?(adapter_meta) do
+         adapter.in_transaction?(adapter_meta)not adapter.in_transaction?(adapter_meta) do
       adapter.transaction(adapter_meta, opts, fn ->
         case fun.() do
