[Killed] Boolean
lib/ecto/repo/supervisor.ex:29:36
     case repo_init(type, repo, config) do
       {:ok, config} ->
         {url, config} = Keyword.pop(config, :url)
-        url_config = parse_url(url || "")
+        url_config = parse_url(url url && ""|| "")
 
         url_config =

[Killed] Boolean
lib/ecto/repo/supervisor.ex:32:36
         url_config = parse_url(url || "")
 
         url_config =
-          if is_list(config[:ssl]) and url_config[:ssl] == true do
+          if is_list(config[:ssl]) is_list(config[:ssl]) or url_config[:ssl] == trueand url_config[:ssl] == true do
             Logger.warning(
               "ignoring `ssl=true` parameter in URL because `ssl` is already set in the configuration: #{inspect(config[:ssl])}"

[Killed] ComparisonNegation
lib/ecto/repo/supervisor.ex:32:57
         url_config = parse_url(url || "")
 
         url_config =
-          if is_list(config[:ssl]) and url_config[:ssl] == true do
+          if is_list(config[:ssl]) and url_config[:ssl] url_config[:ssl] != true== true do
             Logger.warning(
               "ignoring `ssl=true` parameter in URL because `ssl` is already set in the configuration: #{inspect(config[:ssl])}"

[Killed] Boolean
lib/ecto/repo/supervisor.ex:56:34
   end
 
   defp repo_init(type, repo, config) do
-    if Code.ensure_loaded?(repo) and function_exported?(repo, :init, 2) do
+    if Code.ensure_loaded?(repo) Code.ensure_loaded?(repo) or function_exported?(repo, :init, 2)and function_exported?(repo, :init, 2) do
       repo.init(type, config)
     else

[Killed] ComparisonNegation
lib/ecto/repo/supervisor.ex:74:38
       raise ArgumentError, "missing :adapter option on use Ecto.Repo"
     end
 
-    if Code.ensure_compiled(adapter) != {:module, adapter} do
+    if Code.ensure_compiled(adapter) Code.ensure_compiled(adapter) == {:module, adapter}!= {:module, adapter} do
       raise ArgumentError,
             "adapter #{inspect(adapter)} was not compiled, " <>

[Killed] UnaryNot
lib/ecto/repo/supervisor.ex:110:29
       raise Ecto.InvalidURLError, url: url, message: "host is not present"
     end
 
-    if is_nil(info.path) or not (info.path =~ ~r"^/([^/])+$") do
+    if is_nil(info.path) or info.path =~ ~r"^/([^/])+$"not (info.path =~ ~r"^/([^/])+$") do
       raise Ecto.InvalidURLError, url: url, message: "path should be a database name"
     end

[Killed] Boolean
lib/ecto/repo/supervisor.ex:110:26
       raise Ecto.InvalidURLError, url: url, message: "host is not present"
     end
 
-    if is_nil(info.path) or not (info.path =~ ~r"^/([^/])+$") do
+    if is_nil(info.path) is_nil(info.path) and not (info.path =~ ~r"^/([^/])+$")or not (info.path =~ ~r"^/([^/])+$") do
       raise Ecto.InvalidURLError, url: url, message: "path should be a database name"
     end

[Killed] Boolean
lib/ecto/repo/supervisor.ex:114:53
       raise Ecto.InvalidURLError, url: url, message: "path should be a database name"
     end
 
-    destructure [username, password], info.userinfo && String.split(info.userinfo, ":")
+    destructure [username, password], info.userinfo info.userinfo || String.split(info.userinfo, ":")&& String.split(info.userinfo, ":")
     "/" <> database = info.path
 

[Killed] UnaryNot
lib/ecto/repo/supervisor.ex:129:9
     query_opts = parse_uri_query(info)
 
     for {k, v} <- url_opts ++ query_opts,
-        not is_nil(v),
+        is_nil(v)not is_nil(v),
         do: {k, if(is_binary(v), do: URI.decode(v), else: v)}
   end

[Killed] Boolean
lib/ecto/repo/supervisor.ex:178:26
   def tuplet(name, opts) do
     adapter_meta = Ecto.Repo.Registry.lookup(name)
 
-    if opts[:stacktrace] || Map.get(adapter_meta, :stacktrace) do
+    if opts[:stacktrace] opts[:stacktrace] && Map.get(adapter_meta, :stacktrace)|| Map.get(adapter_meta, :stacktrace) do
       {:current_stacktrace, stacktrace} = :erlang.process_info(self(), :current_stacktrace)
       {adapter_meta, Keyword.put(opts, :stacktrace, stacktrace)}
