[Killed] UnaryNot
lib/ecto/schema.ex:1987:24
     # better to raise unknown type first than unsupported option.
     type = check_field_type!(mod, name, type, opts)
 
-    if type == :any && !opts[:virtual] do
+    if type == :any && opts[:virtual]!opts[:virtual] do
       raise ArgumentError,
             "only virtual fields can have type :any, " <>

[Killed] Boolean
lib/ecto/schema.ex:1987:21
     # better to raise unknown type first than unsupported option.
     type = check_field_type!(mod, name, type, opts)
 
-    if type == :any && !opts[:virtual] do
+    if type == :any type == :any || !opts[:virtual]&& !opts[:virtual] do
       raise ArgumentError,
             "only virtual fields can have type :any, " <>

[Survived] Boolean
lib/ecto/schema.ex:2000:31
   end
 
   defp define_field(mod, name, type, opts) do
-    virtual? = opts[:virtual] || false
+    virtual? = opts[:virtual] opts[:virtual] && false|| false
     pk? = opts[:primary_key] || false
     writable = opts[:writable] || :always

[Killed] Boolean
lib/ecto/schema.ex:2001:30
 
   defp define_field(mod, name, type, opts) do
     virtual? = opts[:virtual] || false
-    pk? = opts[:primary_key] || false
+    pk? = opts[:primary_key] opts[:primary_key] && false|| false
     writable = opts[:writable] || :always
     put_struct_field(mod, name, Keyword.get(opts, :default))

[Killed] Boolean
lib/ecto/schema.ex:2002:32
   defp define_field(mod, name, type, opts) do
     virtual? = opts[:virtual] || false
     pk? = opts[:primary_key] || false
-    writable = opts[:writable] || :always
+    writable = opts[:writable] opts[:writable] && :always|| :always
     put_struct_field(mod, name, Keyword.get(opts, :default))
 

[Survived] UnaryNot
lib/ecto/schema.ex:2008:39
     redact_field? =
       Keyword.get_lazy(opts, :redact, fn ->
         case Module.get_attribute(mod, :schema_redact, false) do
-          :all_except_primary_keys -> not pk?
+          :all_except_primary_keys -> pk?not pk?
           false -> false
         end

[Killed] Boolean
lib/ecto/schema.ex:2021:23
       Module.put_attribute(mod, :ecto_virtual_fields, {name, type})
     else
       source =
-        opts[:source] ||
+        opts[:source] opts[:source] &&
+  Module.get_attribute(mod, :field_source_mapper, &Function.identity/1).(name)||
           Module.get_attribute(mod, :field_source_mapper, &Function.identity/1).(name)
 

[Killed] UnaryNot
lib/ecto/schema.ex:2024:10
         opts[:source] ||
           Module.get_attribute(mod, :field_source_mapper, &Function.identity/1).(name)
 
-      if not is_atom(source) do
+      if is_atom(source)not is_atom(source) do
         raise ArgumentError,
               "the :source for field `#{name}` must be an atom, got: #{inspect(source)}"

[Survived] ComparisonNegation
lib/ecto/schema.ex:2029:15
               "the :source for field `#{name}` must be an atom, got: #{inspect(source)}"
       end
 
-      if name != source do
+      if name name == source!= source do
         Module.put_attribute(mod, :ecto_field_sources, {name, source})
       end

[Survived] Boolean
lib/ecto/schema.ex:2042:54
           store_mfa_autogenerate!(mod, name, type, gen)
 
         true ->
-          store_type_autogenerate!(mod, name, source || name, type, pk?)
+          store_type_autogenerate!(mod, name, source source && name|| name, type, pk?)
 
         _ ->

[Killed] Boolean
lib/ecto/schema.ex:2048:14
           :ok
       end
 
-      if raw && gen do
+      if raw raw || gen&& gen do
         raise ArgumentError, "cannot mark the same field as autogenerate and read_after_writes"
       end

[Killed] Boolean
lib/ecto/schema.ex:2052:30
         raise ArgumentError, "cannot mark the same field as autogenerate and read_after_writes"
       end
 
-      if writable != :always && gen do
+      if writable != :always writable != :always || gen&& gen do
         raise ArgumentError, "autogenerated fields must always be writable"
       end

[Killed] ComparisonNegation
lib/ecto/schema.ex:2052:19
         raise ArgumentError, "cannot mark the same field as autogenerate and read_after_writes"
       end
 
-      if writable != :always && gen do
+      if writable writable == :always!= :always && gen do
         raise ArgumentError, "autogenerated fields must always be writable"
       end

[Survived] Boolean
lib/ecto/schema.ex:2072:41
   def __define_timestamps__(mod, opts) do
     timestamps = Keyword.merge(Module.get_attribute(mod, :timestamps_opts, []), opts)
     type = Keyword.get(timestamps, :type, :naive_datetime)
-    autogen = timestamps[:autogenerate] || {Ecto.Schema, :__timestamps__, [type]}
+    autogen = timestamps[:autogenerate] timestamps[:autogenerate] && {Ecto.Schema, :__timestamps__, [type]}|| {Ecto.Schema, :__timestamps__, [type]}
 
     inserted_at = Keyword.get(timestamps, :inserted_at, :inserted_at)

[Killed] Boolean
lib/ecto/schema.ex:2108:27
 
   @doc false
   def __has_many__(mod, name, queryable, opts) do
-    if is_list(queryable) and Keyword.has_key?(queryable, :through) do
+    if is_list(queryable) is_list(queryable) or Keyword.has_key?(queryable, :through)and Keyword.has_key?(queryable, :through) do
       check_options!(queryable, @valid_has_options, "has_many/3")
       association(mod, :many, name, Ecto.Association.HasThrough, queryable)

[Killed] Boolean
lib/ecto/schema.ex:2120:27
 
   @doc false
   def __has_one__(mod, name, queryable, opts) do
-    if is_list(queryable) and Keyword.has_key?(queryable, :through) do
+    if is_list(queryable) is_list(queryable) or Keyword.has_key?(queryable, :through)and Keyword.has_key?(queryable, :through) do
       check_options!(queryable, @valid_has_options, "has_one/3")
       association(mod, :one, name, Ecto.Association.HasThrough, queryable)

[Killed] Boolean
lib/ecto/schema.ex:2149:36
     opts = Keyword.put_new(opts, :foreign_key, :"#{name}_id")
 
     foreign_key_name = opts[:foreign_key]
-    foreign_key_type = opts[:type] || Module.get_attribute(mod, :foreign_key_type, :id)
+    foreign_key_type = opts[:type] opts[:type] && Module.get_attribute(mod, :foreign_key_type, :id)|| Module.get_attribute(mod, :foreign_key_type, :id)
     foreign_key_type = check_field_type!(mod, name, foreign_key_type, opts)
     check_options!(foreign_key_type, opts, @valid_belongs_to_options, "belongs_to/3")

[Killed] ComparisonNegation
lib/ecto/schema.ex:2153:25
     foreign_key_type = check_field_type!(mod, name, foreign_key_type, opts)
     check_options!(foreign_key_type, opts, @valid_belongs_to_options, "belongs_to/3")
 
-    if foreign_key_name == name do
+    if foreign_key_name foreign_key_name != name== name do
       raise ArgumentError,
             "foreign_key #{inspect(name)} must be distinct from corresponding association name"

[Killed] GuardTypeTest
lib/ecto/schema.ex:2195:52
   @valid_embeds_one_options [:on_replace, :source, :load_in_query, :defaults_to_struct]
 
   @doc false
-  def __embeds_one__(mod, name, schema, opts) when is_atom(schema) do
+  def __embeds_one__(mod, name, schema, opts) when is_nil(schema) do
     check_options!(opts, @valid_embeds_one_options, "embeds_one/3")
 

[Killed] GuardTypeTest
lib/ecto/schema.ex:2216:53
   @valid_embeds_many_options [:on_replace, :source, :load_in_query]
 
   @doc false
-  def __embeds_many__(mod, name, schema, opts) when is_atom(schema) do
+  def __embeds_many__(mod, name, schema, opts) when is_nil(schema) do
     check_options!(opts, @valid_embeds_many_options, "embeds_many/3")
     opts = Keyword.put(opts, :default, [])

[Survived] Boolean
lib/ecto/schema.ex:2262:64
           IO.warn(
             "invalid association `#{assoc.field}` in schema #{inspect(module)}: #{message}",
             module: module,
-            file: to_string(module.__info__(:compile)[:source] || "nofile")
+            file: to_string(module.__info__(:compile)[:source] module.__info__(:compile)[:source] && "nofile"|| "nofile")
           )
       end

[Killed] ComparisonNegation
lib/ecto/schema.ex:2309:51
       Module.put_attribute(module, :ecto_struct_fields, {:__meta__, meta})
     end
 
-    if Module.get_attribute(module, :primary_key) == nil do
+    if Module.get_attribute(module, :primary_key) Module.get_attribute(module, :primary_key) != nil== nil do
       Module.put_attribute(module, :primary_key, {:id, type, autogenerate: true})
     end

[Survived] ComparisonNegation
lib/ecto/schema.ex:2346:24
     struct_fields = Module.get_attribute(module, :ecto_struct_fields) |> Enum.reverse()
     derive = Module.get_attribute(module, :derive)
 
-    if redacted_fields != [] and not List.keymember?(derive, Inspect, 0) and
+    if redacted_fields redacted_fields == []!= [] and not List.keymember?(derive, Inspect, 0) and
          derive_inspect?(module) do
       Module.put_attribute(module, :derive, {Inspect, except: redacted_fields})

[Survived] Boolean
lib/ecto/schema.ex:2346:30
     struct_fields = Module.get_attribute(module, :ecto_struct_fields) |> Enum.reverse()
     derive = Module.get_attribute(module, :derive)
 
-    if redacted_fields != [] and not List.keymember?(derive, Inspect, 0) and
+    if redacted_fields != [] redacted_fields != [] or not List.keymember?(derive, Inspect, 0)and not List.keymember?(derive, Inspect, 0) and
          derive_inspect?(module) do
       Module.put_attribute(module, :derive, {Inspect, except: redacted_fields})

[Survived] Boolean
lib/ecto/schema.ex:2368:37
 
     dump =
       for {name, {type, writable}} <- fields do
-        {name, {field_sources[name] || name, type, writable}}
+        {name, {field_sources[name] field_sources[name] && name|| name, type, writable}}
       end
 

[Survived] Boolean
lib/ecto/schema.ex:2373:53
 
     field_sources_quoted =
       for {name, {_type, _writable}} <- fields do
-        {[:field_source, name], field_sources[name] || name}
+        {[:field_source, name], field_sources[name] field_sources[name] && name|| name}
       end
 

[Killed] UnaryNot
lib/ecto/schema.ex:2511:41
   end
 
   defp check_options!(opts, valid, fun_arity) do
-    case Enum.find(opts, fn {k, _} -> k not in valid end) do
+    case Enum.find(opts, fn {k, _} -> k k in validnot in valid end) do
       {k, _} -> raise ArgumentError, "invalid option #{inspect(k)} for #{fun_arity}"
       nil -> :ok

[Killed] UnaryNot
lib/ecto/schema.ex:2542:7
         {outer_type, inner_type} = type
         {outer_type, check_field_type!(mod, name, inner_type, opts)}
 
-      not is_atom(type) ->
+      is_atom(type)not is_atom(type) ->
         raise ArgumentError, "invalid type #{Ecto.Type.format(type)} for field #{inspect(name)}"
 

[Killed] ComparisonNegation
lib/ecto/schema.ex:2548:34
       Ecto.Type.base?(type) ->
         type
 
-      Code.ensure_compiled(type) == {:module, type} ->
+      Code.ensure_compiled(type) Code.ensure_compiled(type) != {:module, type}== {:module, type} ->
         cond do
           function_exported?(type, :type, 0) ->

[Survived] UnaryNot
lib/ecto/schema.ex:2598:7
       store_autogenerate_id!(mod, name, source, type, pk?) ->
         :ok
 
-      not function_exported?(typemod, :autogenerate, 1) ->
+      function_exported?(typemod, :autogenerate, 1)not function_exported?(typemod, :autogenerate, 1) ->
         raise ArgumentError,
               "field #{inspect(name)} does not support :autogenerate because it uses a " <>

[Killed] UnaryNot
lib/ecto/schema.ex:2623:7
                 "primitive type #{Ecto.Type.format(type)}"
 
       # Note the custom type has already been loaded in check_type!/3
-      not function_exported?(type, :autogenerate, 0) ->
+      function_exported?(type, :autogenerate, 0)not function_exported?(type, :autogenerate, 0) ->
         raise ArgumentError,
               "field #{inspect(name)} does not support :autogenerate because it uses a " <>

[Killed] UnaryNot
lib/ecto/schema.ex:2635:7
 
   defp store_autogenerate_id!(mod, name, source, type, pk?) do
     cond do
-      not autogenerate_id?(type) ->
+      autogenerate_id?(type)not autogenerate_id?(type) ->
         false
 

[Killed] UnaryNot
lib/ecto/schema.ex:2638:7
       not autogenerate_id?(type) ->
         false
 
-      not pk? ->
+      pk?not pk? ->
         raise ArgumentError,
               "only primary keys allow :autogenerate for type #{Ecto.Type.format(type)}, " <>

[Survived] GuardTypeTest
lib/ecto/schema.ex:2670:73
   defp expand_nested_module_alias({:__aliases__, _, [Elixir, _ | _] = alias}, _env),
     do: Module.concat(alias)
 
-  defp expand_nested_module_alias({:__aliases__, _, [h | t]}, env) when is_atom(h),
+  defp expand_nested_module_alias({:__aliases__, _, [h | t]}, env) when is_nil(h),
     do: Module.concat([env.module, h | t])
 
