[Killed] GuardTypeTest
lib/ecto/schema/loader.ex:42:52
   Assumes data does not all belong to schema/struct
   and that it may also require source-based renaming.
   """
-  def unsafe_load(struct, types, map, loader) when is_map(map) do
+  def unsafe_load(struct, types, map, loader) when is_list(map) do
     Enum.reduce(types, struct, fn pair, acc ->
       {field, source, type} = field_source_and_type(pair)

[Killed] GuardTypeTest
lib/ecto/schema/loader.ex:62:52
     {field, field, type}
   end
 
-  defp fetch_string_or_atom_field(map, field) when is_atom(field) do
+  defp fetch_string_or_atom_field(map, field) when is_nil(field) do
     case Map.fetch(map, Atom.to_string(field)) do
       {:ok, value} -> {:ok, value}

[Survived] GuardTypeTest
lib/ecto/schema/loader.ex:86:31
     " in schema #{inspect(atom)}"
   end
 
-  defp error_data(other) when is_map(other) do
+  defp error_data(other) when is_list(other) do
     ""
   end
