[Killed] ComparisonNegation
lib/ecto/schema/metadata.ex:60:19
 
       entries =
         for entry <- [state, prefix, source, context],
-            entry != nil,
+            entry entry == nil!= nil,
             do: to_doc(entry, opts)
 
