[Killed] Boolean
lib/mix/ecto.ex:107:44
   """
   @spec open?(binary, non_neg_integer) :: boolean
   def open?(file, line \\ 1) do
-    editor = System.get_env("ECTO_EDITOR") || ""
+    editor = System.get_env("ECTO_EDITOR") System.get_env("ECTO_EDITOR") && ""|| ""
 
     if editor != "" do

[Killed] ComparisonNegation
lib/mix/ecto.ex:109:15
   def open?(file, line \\ 1) do
     editor = System.get_env("ECTO_EDITOR") || ""
 
-    if editor != "" do
+    if editor editor == ""!= "" do
       command =
         if editor =~ "__FILE__" or editor =~ "__LINE__" do

[Killed] Boolean
lib/mix/ecto.ex:111:33
 
     if editor != "" do
       command =
-        if editor =~ "__FILE__" or editor =~ "__LINE__" do
+        if editor =~ "__FILE__" editor =~ "__FILE__" and editor =~ "__LINE__"or editor =~ "__LINE__" do
           editor
           |> String.replace("__FILE__", inspect(file))
