[Killed] Boolean
lib/mix/tasks/ecto.drop.ex:68:34
         "drop storage for #{inspect(repo)}"
       )
 
-      if skip_safety_warnings?() or
+      if skip_safety_warnings?() skip_safety_warnings?() and
+  opts[:force]or
            opts[:force] or
            Mix.shell().yes?(

[Killed] Boolean
lib/mix/tasks/ecto.drop.ex:69:25
       )
 
       if skip_safety_warnings?() or
-           opts[:force] or
+           opts[:force] (skip_safety_warnings?() or
+   opts[:force]) and
+  Mix.shell().yes?("Are you sure you want to drop the database for repo #{inspect(repo)}?")or
            Mix.shell().yes?(
              "Are you sure you want to drop the database for repo #{inspect(repo)}?"

[Killed] ComparisonNegation
lib/mix/tasks/ecto.drop.ex:79:44
   end
 
   defp skip_safety_warnings? do
-    Mix.Project.config()[:start_permanent] != true
+    Mix.Project.config()[:start_permanent] Mix.Project.config()[:start_permanent] == true!= true
   end
 
