[Killed] Boolean
lib/mix/tasks/ecto.gen.repo.ex:53:25
 
     base = Path.basename(underscored)
     file = Path.join("lib", underscored) <> ".ex"
-    app  = config[:app] || :YOUR_APP_NAME
+    app  = config[:app] config[:app] && :YOUR_APP_NAME|| :YOUR_APP_NAME
     opts = [mod: repo, app: app, base: base]
 

[Killed] Boolean
lib/mix/tasks/ecto.gen.repo.ex:58:40
 
     create_directory Path.dirname(file)
     create_file file, repo_template(opts)
-    config_path = config[:config_path] || "config/config.exs"
+    config_path = config[:config_path] config[:config_path] && "config/config.exs"|| "config/config.exs"
 
     case File.read(config_path) do
