[Survived] GuardTypeTest
lib/codegen.ex:97:28
   defp ranges_to_orddict(ranges) do
     ranges
     |> Enum.flat_map(fn
-         {int, value} when is_integer(int) ->
+         {int, value} when is_float(int) ->
            [{int, value}]
 
