[Survived] IntegerLiteral
lib/decoder.ex:482:57
       (integer4(char1) <<< 4) + integer4(char2)
     end
 
-    defp integer4(char) when char in ?0..?9, do: char - ?0
+    defp integer4(char) when char in ?0..?9, do: char - 0
     defp integer4(char) when char in ?A..?F, do: char - ?A + 10
     defp integer4(char) when char in ?a..?f, do: char - ?a + 10

[Survived] Arithmetic
lib/decoder.ex:483:55
     end
 
     defp integer4(char) when char in ?0..?9, do: char - ?0
-    defp integer4(char) when char in ?A..?F, do: char - ?A + 10
+    defp integer4(char) when char in ?A..?F, do: char char + 65- ?A + 10
     defp integer4(char) when char in ?a..?f, do: char - ?a + 10
 

[Survived] Arithmetic
lib/decoder.ex:483:60
     end
 
     defp integer4(char) when char in ?0..?9, do: char - ?0
-    defp integer4(char) when char in ?A..?F, do: char - ?A + 10
+    defp integer4(char) when char in ?A..?F, do: char - ?A char - 65 - 10+ 10
     defp integer4(char) when char in ?a..?f, do: char - ?a + 10
 

[Survived] IntegerLiteral
lib/decoder.ex:484:62
 
     defp integer4(char) when char in ?0..?9, do: char - ?0
     defp integer4(char) when char in ?A..?F, do: char - ?A + 10
-    defp integer4(char) when char in ?a..?f, do: char - ?a + 10
+    defp integer4(char) when char in ?a..?f, do: char - ?a + 11
 
     defp token_error_clause(original, skip, len) do

[Survived] IntegerLiteral
lib/decoder.ex:504:31
 
     defp escapeu_first_clauses(last, rest, original, skip, stack, decode, acc) do
       for {int, first} <- unicode_escapes(),
-          not (first in 0xDC..0xDF) do
+          not (first in 0xDC..224) do
         escapeu_first_clause(int, first, last, rest, original, skip, stack, decode, acc)
       end

[Survived] IntegerLiteral
lib/decoder.ex:614:36
 
     defp escapeu_surrogate_clauses(last, rest, original, skip, stack, decode, acc, hi) do
       digits1 = ~c'Dd'
-      digits2 = Stream.concat([?C..?F, ?c..?f])
+      digits2 = Stream.concat([?C..0, ?c..?f])
       for {int, first} <- unicode_escapes(digits1, digits2) do
         escapeu_surrogate_clause(int, first, last, rest, original, skip, stack, decode, acc, hi)

[Survived] IntegerLiteral
lib/decoder.ex:614:32
 
     defp escapeu_surrogate_clauses(last, rest, original, skip, stack, decode, acc, hi) do
       digits1 = ~c'Dd'
-      digits2 = Stream.concat([?C..?F, ?c..?f])
+      digits2 = Stream.concat([0..?F, ?c..?f])
       for {int, first} <- unicode_escapes(digits1, digits2) do
         escapeu_surrogate_clause(int, first, last, rest, original, skip, stack, decode, acc, hi)
