[Survived] GuardTypeTest
lib/encode.ex:101:45
     struct(value, escape, encode_map, module)
   end
 
-  def value(value, escape, encode_map) when is_map(value) do
+  def value(value, escape, encode_map) when is_list(value) do
     case Map.to_list(value) do
       [] -> "{}"

[Killed] GuardTypeTest
lib/encode.ex:174:48
 
   @spec keyword(keyword, opts) :: iodata
   def keyword(list, _) when list == [], do: "{}"
-  def keyword(list, {escape, encode_map}) when is_list(list) do
+  def keyword(list, {escape, encode_map}) when is_tuple(list) do
     encode_map.(list, escape, encode_map)
   end

[Killed] IntegerLiteral
lib/encode.ex:241:47
 
   if Code.ensure_loaded?(Decimal) do
     defp struct(value, _escape, _encode_map, Decimal) do
-      [?", Decimal.to_string(value, :normal), ?"]
+      [?", Decimal.to_string(value, :normal), 0]
     end
   end

[Survived] IntegerLiteral
lib/encode.ex:613:57
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
        when char <= 0xFF do
     part = binary_part(original, skip, len)
-    acc = [acc, part, "\\u00" | Integer.to_string(char, 16)]
+    acc = [acc, part, "\\u00" | Integer.to_string(char, 0)]
     escape_unicode(rest, acc, original, skip + len + 2)
   end
