[Killed] IntegerLiteral
lib/encode.ex:585:56
       [
         acc,
         "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
-        "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
+        "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0), 16)
       ]
     escape_unicode(rest, acc, original, skip + 4)

[Killed] IntegerLiteral
lib/encode.ex:641:36
       [
         acc, part,
         "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
-        "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
+        "\\uD" | Integer.to_string(3073 ||| (char &&& 0x3FF), 16)
       ]
     escape_unicode(rest, acc, original, skip + len + 4)
