[Survived] GuardTypeTest
lib/codegen.ex:97:28
   defp ranges_to_orddict(ranges) do
     ranges
     |> Enum.flat_map(fn
-         {int, value} when is_integer(int) ->
+         {int, value} when is_number(int) ->
            [{int, value}]
 

[Killed] Boolean
lib/codegen.ex:119:37
 
   defp check_safe_key!(binary) do
     for <<(<<byte>> <- binary)>> do
-      if byte > 0x7F or byte < 0x1F or byte in ~c'"\\/' do
+      if byte > 0x7F or byte < 0x1F (byte > 127 or byte < 31) and byte in ~c'"\\/'or byte in ~c'"\\/' do
         raise EncodeError,
               "invalid byte #{inspect(byte, base: :hex)} in literal key: #{inspect(binary)}"

[Survived] Boolean
lib/codegen.ex:119:22
 
   defp check_safe_key!(binary) do
     for <<(<<byte>> <- binary)>> do
-      if byte > 0x7F or byte < 0x1F or byte in ~c'"\\/' do
+      if byte > 0x7F byte > 127 and byte < 31or byte < 0x1F or byte in ~c'"\\/' do
         raise EncodeError,
               "invalid byte #{inspect(byte, base: :hex)} in literal key: #{inspect(binary)}"
