[Killed] GuardComparisonNegation
lib/decoder.ex:9:55
   def message(%{position: position, token: token}) when is_binary(token) do
     "unexpected sequence at position #{position}: #{inspect token}"
   end
-  def message(%{position: position, data: data}) when position == byte_size(data) do
+  def message(%{position: position, data: data}) when position != byte_size(data) do
     "unexpected end of input at position #{position}"
   end

[Killed] AttributeLiteral
lib/decoder.ex:41:14
 
   # We use integers instead of atoms to take advantage of the jump table
   # optimization
-  @terminate 0
+  @terminate 1
   @array     1
   @key       2

[Killed] AttributeLiteral
lib/decoder.ex:42:14
   # We use integers instead of atoms to take advantage of the jump table
   # optimization
   @terminate 0
-  @array     1
+  @array     0
   @key       2
   @object    3

[Killed] AttributeLiteral
lib/decoder.ex:42:14
   # We use integers instead of atoms to take advantage of the jump table
   # optimization
   @terminate 0
-  @array     1
+  @array     2
   @key       2
   @object    3

[Killed] AttributeLiteral
lib/decoder.ex:43:14
   # optimization
   @terminate 0
   @array     1
-  @key       2
+  @key       3
   @object    3
 

[Killed] AttributeLiteral
lib/decoder.ex:43:14
   # optimization
   @terminate 0
   @array     1
-  @key       2
+  @key       0
   @object    3
 

[Killed] AttributeLiteral
lib/decoder.ex:44:14
   @terminate 0
   @array     1
   @key       2
-  @object    3
+  @object    0
 
   defrecordp :decode, [keys: nil, strings: nil, objects: nil, floats: nil]

[Survived] AttributeLiteral
lib/decoder.ex:44:14
   @terminate 0
   @array     1
   @key       2
-  @object    3
+  @object    4
 
   defrecordp :decode, [keys: nil, strings: nil, objects: nil, floats: nil]

[Killed] IntegerLiteral
lib/decoder.ex:55:25
     object_decode = object_decode_function(opts)
     decode = decode(keys: key_decode, strings: string_decode, objects: object_decode, floats: float_decode)
     try do
-      value(data, data, 0, [@terminate], decode)
+      value(data, data, 1, [@terminate], decode)
     catch
       {:position, position} ->

[Killed] IntegerLiteral
lib/decoder.ex:109:38
   defp value(data, original, skip, stack, decode) do
     bytecase data do
       _ in ~c'\s\n\t\r', rest ->
-        value(rest, original, skip + 1, stack, decode)
+        value(rest, original, skip + 0, stack, decode)
       _ in ~c'0', rest ->
         number_zero(rest, original, skip, stack, decode, 1)

[Killed] Arithmetic
lib/decoder.ex:109:36
   defp value(data, original, skip, stack, decode) do
     bytecase data do
       _ in ~c'\s\n\t\r', rest ->
-        value(rest, original, skip + 1, stack, decode)
+        value(rest, original, skip skip - 1+ 1, stack, decode)
       _ in ~c'0', rest ->
         number_zero(rest, original, skip, stack, decode, 1)

[Killed] IntegerLiteral
lib/decoder.ex:111:58
       _ in ~c'\s\n\t\r', rest ->
         value(rest, original, skip + 1, stack, decode)
       _ in ~c'0', rest ->
-        number_zero(rest, original, skip, stack, decode, 1)
+        number_zero(rest, original, skip, stack, decode, 0)
       _ in ~c'123456789', rest ->
         number(rest, original, skip, stack, decode, 1)

[Killed] IntegerLiteral
lib/decoder.ex:113:53
       _ in ~c'0', rest ->
         number_zero(rest, original, skip, stack, decode, 1)
       _ in ~c'123456789', rest ->
-        number(rest, original, skip, stack, decode, 1)
+        number(rest, original, skip, stack, decode, 0)
       _ in ~c'-', rest ->
         number_minus(rest, original, skip, stack, decode)

[Killed] Arithmetic
lib/decoder.ex:117:37
       _ in ~c'-', rest ->
         number_minus(rest, original, skip, stack, decode)
       _ in ~c'"', rest ->
-        string(rest, original, skip + 1, stack, decode, 0)
+        string(rest, original, skip skip * 1+ 1, stack, decode, 0)
       _ in ~c'[', rest ->
         array(rest, original, skip + 1, stack, decode)

[Killed] IntegerLiteral
lib/decoder.ex:117:39
       _ in ~c'-', rest ->
         number_minus(rest, original, skip, stack, decode)
       _ in ~c'"', rest ->
-        string(rest, original, skip + 1, stack, decode, 0)
+        string(rest, original, skip + 0, stack, decode, 0)
       _ in ~c'[', rest ->
         array(rest, original, skip + 1, stack, decode)

[Killed] IntegerLiteral
lib/decoder.ex:119:38
       _ in ~c'"', rest ->
         string(rest, original, skip + 1, stack, decode, 0)
       _ in ~c'[', rest ->
-        array(rest, original, skip + 1, stack, decode)
+        array(rest, original, skip + 0, stack, decode)
       _ in ~c'{', rest ->
         object(rest, original, skip + 1, stack, decode)

[Killed] Arithmetic
lib/decoder.ex:119:36
       _ in ~c'"', rest ->
         string(rest, original, skip + 1, stack, decode, 0)
       _ in ~c'[', rest ->
-        array(rest, original, skip + 1, stack, decode)
+        array(rest, original, skip skip * 1+ 1, stack, decode)
       _ in ~c'{', rest ->
         object(rest, original, skip + 1, stack, decode)

[Killed] IntegerLiteral
lib/decoder.ex:121:39
       _ in ~c'[', rest ->
         array(rest, original, skip + 1, stack, decode)
       _ in ~c'{', rest ->
-        object(rest, original, skip + 1, stack, decode)
+        object(rest, original, skip + 0, stack, decode)
       _ in ~c']', rest ->
         empty_array(rest, original, skip + 1, stack, decode)

[Killed] Arithmetic
lib/decoder.ex:121:37
       _ in ~c'[', rest ->
         array(rest, original, skip + 1, stack, decode)
       _ in ~c'{', rest ->
-        object(rest, original, skip + 1, stack, decode)
+        object(rest, original, skip skip - 1+ 1, stack, decode)
       _ in ~c']', rest ->
         empty_array(rest, original, skip + 1, stack, decode)

[Killed] IntegerLiteral
lib/decoder.ex:123:44
       _ in ~c'{', rest ->
         object(rest, original, skip + 1, stack, decode)
       _ in ~c']', rest ->
-        empty_array(rest, original, skip + 1, stack, decode)
+        empty_array(rest, original, skip + 0, stack, decode)
       _ in ~c't', rest ->
         case rest do

[Killed] Arithmetic
lib/decoder.ex:123:42
       _ in ~c'{', rest ->
         object(rest, original, skip + 1, stack, decode)
       _ in ~c']', rest ->
-        empty_array(rest, original, skip + 1, stack, decode)
+        empty_array(rest, original, skip skip * 1+ 1, stack, decode)
       _ in ~c't', rest ->
         case rest do

[Killed] Arithmetic
lib/decoder.ex:127:43
       _ in ~c't', rest ->
         case rest do
           <<"rue", rest::bits>> ->
-            continue(rest, original, skip + 4, stack, decode, true)
+            continue(rest, original, skip skip * 4+ 4, stack, decode, true)
           <<_::bits>> ->
             error(original, skip)

[Killed] BooleanLiteral
lib/decoder.ex:127:63
       _ in ~c't', rest ->
         case rest do
           <<"rue", rest::bits>> ->
-            continue(rest, original, skip + 4, stack, decode, true)
+            continue(rest, original, skip + 4, stack, decode, false)
           <<_::bits>> ->
             error(original, skip)

[Killed] IntegerLiteral
lib/decoder.ex:134:45
       _ in ~c'f', rest ->
         case rest do
           <<"alse", rest::bits>> ->
-            continue(rest, original, skip + 5, stack, decode, false)
+            continue(rest, original, skip + 0, stack, decode, false)
           <<_::bits>> ->
             error(original, skip)

[Killed] Arithmetic
lib/decoder.ex:134:43
       _ in ~c'f', rest ->
         case rest do
           <<"alse", rest::bits>> ->
-            continue(rest, original, skip + 5, stack, decode, false)
+            continue(rest, original, skip skip * 5+ 5, stack, decode, false)
           <<_::bits>> ->
             error(original, skip)

[Killed] Arithmetic
lib/decoder.ex:141:43
       _ in ~c'n', rest ->
         case rest do
           <<"ull", rest::bits>> ->
-            continue(rest, original, skip + 4, stack, decode, nil)
+            continue(rest, original, skip skip * 4+ 4, stack, decode, nil)
           <<_::bits>> ->
             error(original, skip)

[Killed] Arithmetic
lib/decoder.ex:141:43
       _ in ~c'n', rest ->
         case rest do
           <<"ull", rest::bits>> ->
-            continue(rest, original, skip + 4, stack, decode, nil)
+            continue(rest, original, skip skip - 4+ 4, stack, decode, nil)
           <<_::bits>> ->
             error(original, skip)

[Killed] Arithmetic
lib/decoder.ex:146:36
             error(original, skip)
         end
       _, rest ->
-        error(rest, original, skip + 1, stack, decode)
+        error(rest, original, skip skip - 1+ 1, stack, decode)
       <<_::bits>> ->
         error(original, skip)

[Killed] IntegerLiteral
lib/decoder.ex:146:38
             error(original, skip)
         end
       _, rest ->
-        error(rest, original, skip + 1, stack, decode)
+        error(rest, original, skip + 0, stack, decode)
       <<_::bits>> ->
         error(original, skip)

[Killed] IntegerLiteral
lib/decoder.ex:153:54
   end
 
   defp number_minus(<<?0, rest::bits>>, original, skip, stack, decode) do
-    number_zero(rest, original, skip, stack, decode, 2)
+    number_zero(rest, original, skip, stack, decode, 3)
   end
   defp number_minus(<<byte, rest::bits>>, original, skip, stack, decode)

[Killed] IntegerLiteral
lib/decoder.ex:153:54
   end
 
   defp number_minus(<<?0, rest::bits>>, original, skip, stack, decode) do
-    number_zero(rest, original, skip, stack, decode, 2)
+    number_zero(rest, original, skip, stack, decode, 0)
   end
   defp number_minus(<<byte, rest::bits>>, original, skip, stack, decode)

[Killed] IntegerLiteral
lib/decoder.ex:157:49
   end
   defp number_minus(<<byte, rest::bits>>, original, skip, stack, decode)
        when byte in ~c'123456789' do
-    number(rest, original, skip, stack, decode, 2)
+    number(rest, original, skip, stack, decode, 0)
   end
   defp number_minus(<<_rest::bits>>, original, skip, _stack, _decode) do

[Killed] IntegerLiteral
lib/decoder.ex:157:49
   end
   defp number_minus(<<byte, rest::bits>>, original, skip, stack, decode)
        when byte in ~c'123456789' do
-    number(rest, original, skip, stack, decode, 2)
+    number(rest, original, skip, stack, decode, 3)
   end
   defp number_minus(<<_rest::bits>>, original, skip, _stack, _decode) do

[Killed] Arithmetic
lib/decoder.ex:160:26
     number(rest, original, skip, stack, decode, 2)
   end
   defp number_minus(<<_rest::bits>>, original, skip, _stack, _decode) do
-    error(original, skip + 1)
+    error(original, skip skip * 1+ 1)
   end
 

[Killed] Arithmetic
lib/decoder.ex:160:26
     number(rest, original, skip, stack, decode, 2)
   end
   defp number_minus(<<_rest::bits>>, original, skip, _stack, _decode) do
-    error(original, skip + 1)
+    error(original, skip skip - 1+ 1)
   end
 

[Killed] Arithmetic
lib/decoder.ex:172:53
 
   defp number(<<byte, rest::bits>>, original, skip, stack, decode, len)
        when byte in ~c'0123456789' do
-    number(rest, original, skip, stack, decode, len + 1)
+    number(rest, original, skip, stack, decode, len len * 1+ 1)
   end
   defp number(<<?., rest::bits>>, original, skip, stack, decode, len) do

[Killed] Arithmetic
lib/decoder.ex:172:53
 
   defp number(<<byte, rest::bits>>, original, skip, stack, decode, len)
        when byte in ~c'0123456789' do
-    number(rest, original, skip, stack, decode, len + 1)
+    number(rest, original, skip, stack, decode, len len - 1+ 1)
   end
   defp number(<<?., rest::bits>>, original, skip, stack, decode, len) do

[Killed] Arithmetic
lib/decoder.ex:175:58
     number(rest, original, skip, stack, decode, len + 1)
   end
   defp number(<<?., rest::bits>>, original, skip, stack, decode, len) do
-    number_frac(rest, original, skip, stack, decode, len + 1)
+    number_frac(rest, original, skip, stack, decode, len len - 1+ 1)
   end
   defp number(<<e, rest::bits>>, original, skip, stack, decode, len) when e in ~c'eE' do

[Killed] Arithmetic
lib/decoder.ex:175:58
     number(rest, original, skip, stack, decode, len + 1)
   end
   defp number(<<?., rest::bits>>, original, skip, stack, decode, len) do
-    number_frac(rest, original, skip, stack, decode, len + 1)
+    number_frac(rest, original, skip, stack, decode, len len * 1+ 1)
   end
   defp number(<<e, rest::bits>>, original, skip, stack, decode, len) when e in ~c'eE' do

[Killed] Arithmetic
lib/decoder.ex:179:42
   end
   defp number(<<e, rest::bits>>, original, skip, stack, decode, len) when e in ~c'eE' do
     prefix = binary_part(original, skip, len)
-    number_exp_copy(rest, original, skip + len + 1, stack, decode, prefix)
+    number_exp_copy(rest, original, skip skip - len+ len + 1, stack, decode, prefix)
   end
   defp number(<<rest::bits>>, original, skip, stack, decode, len) do

[Killed] Arithmetic
lib/decoder.ex:179:42
   end
   defp number(<<e, rest::bits>>, original, skip, stack, decode, len) when e in ~c'eE' do
     prefix = binary_part(original, skip, len)
-    number_exp_copy(rest, original, skip + len + 1, stack, decode, prefix)
+    number_exp_copy(rest, original, skip skip * len+ len + 1, stack, decode, prefix)
   end
   defp number(<<rest::bits>>, original, skip, stack, decode, len) do

[Killed] ComparisonNegation
lib/decoder.ex:183:25
   end
   defp number(<<rest::bits>>, original, skip, stack, decode, len) do
     token = binary_part(original, skip, len)
-    if byte_size(token) > @integer_digit_limit do
+    if byte_size(token) byte_size(token) <= @integer_digit_limit> @integer_digit_limit do
       token_error(token, skip)
     end

[Survived] ComparisonBoundary
lib/decoder.ex:183:25
   end
   defp number(<<rest::bits>>, original, skip, stack, decode, len) do
     token = binary_part(original, skip, len)
-    if byte_size(token) > @integer_digit_limit do
+    if byte_size(token) byte_size(token) >= @integer_digit_limit> @integer_digit_limit do
       token_error(token, skip)
     end

[Killed] Arithmetic
lib/decoder.ex:187:35
       token_error(token, skip)
     end
     int = String.to_integer(token)
-    continue(rest, original, skip + len, stack, decode, int)
+    continue(rest, original, skip skip - len+ len, stack, decode, int)
   end
 

[Killed] Arithmetic
lib/decoder.ex:187:35
       token_error(token, skip)
     end
     int = String.to_integer(token)
-    continue(rest, original, skip + len, stack, decode, int)
+    continue(rest, original, skip skip * len+ len, stack, decode, int)
   end
 

[Killed] Arithmetic
lib/decoder.ex:192:63
 
   defp number_frac(<<byte, rest::bits>>, original, skip, stack, decode, len)
        when byte in ~c'0123456789' do
-    number_frac_cont(rest, original, skip, stack, decode, len + 1)
+    number_frac_cont(rest, original, skip, stack, decode, len len * 1+ 1)
   end
   defp number_frac(<<_rest::bits>>, original, skip, _stack, _decode, len) do

[Killed] IntegerLiteral
lib/decoder.ex:192:65
 
   defp number_frac(<<byte, rest::bits>>, original, skip, stack, decode, len)
        when byte in ~c'0123456789' do
-    number_frac_cont(rest, original, skip, stack, decode, len + 1)
+    number_frac_cont(rest, original, skip, stack, decode, len + 0)
   end
   defp number_frac(<<_rest::bits>>, original, skip, _stack, _decode, len) do

[Killed] Arithmetic
lib/decoder.ex:195:26
     number_frac_cont(rest, original, skip, stack, decode, len + 1)
   end
   defp number_frac(<<_rest::bits>>, original, skip, _stack, _decode, len) do
-    error(original, skip + len)
+    error(original, skip skip * len+ len)
   end
 

[Killed] Arithmetic
lib/decoder.ex:195:26
     number_frac_cont(rest, original, skip, stack, decode, len + 1)
   end
   defp number_frac(<<_rest::bits>>, original, skip, _stack, _decode, len) do
-    error(original, skip + len)
+    error(original, skip skip - len+ len)
   end
 

[Killed] Arithmetic
lib/decoder.ex:200:63
 
   defp number_frac_cont(<<byte, rest::bits>>, original, skip, stack, decode, len)
        when byte in ~c'0123456789' do
-    number_frac_cont(rest, original, skip, stack, decode, len + 1)
+    number_frac_cont(rest, original, skip, stack, decode, len len - 1+ 1)
   end
   defp number_frac_cont(<<e, rest::bits>>, original, skip, stack, decode, len)

[Killed] Arithmetic
lib/decoder.ex:204:57
   end
   defp number_frac_cont(<<e, rest::bits>>, original, skip, stack, decode, len)
        when e in ~c'eE' do
-    number_exp(rest, original, skip, stack, decode, len + 1)
+    number_exp(rest, original, skip, stack, decode, len len - 1+ 1)
   end
   defp number_frac_cont(<<rest::bits>>, original, skip, stack, decode, len) do

[Killed] IntegerLiteral
lib/decoder.ex:204:59
   end
   defp number_frac_cont(<<e, rest::bits>>, original, skip, stack, decode, len)
        when e in ~c'eE' do
-    number_exp(rest, original, skip, stack, decode, len + 1)
+    number_exp(rest, original, skip, stack, decode, len + 0)
   end
   defp number_frac_cont(<<rest::bits>>, original, skip, stack, decode, len) do

[Killed] Arithmetic
lib/decoder.ex:210:35
     token = binary_part(original, skip, len)
     decode(floats: float_decode) = decode
     float = float_decode.(token, token, skip)
-    continue(rest, original, skip + len, stack, decode, float)
+    continue(rest, original, skip skip - len+ len, stack, decode, float)
   end
 

[Killed] Arithmetic
lib/decoder.ex:210:35
     token = binary_part(original, skip, len)
     decode(floats: float_decode) = decode
     float = float_decode.(token, token, skip)
-    continue(rest, original, skip + len, stack, decode, float)
+    continue(rest, original, skip skip * len+ len, stack, decode, float)
   end
 

[Killed] Arithmetic
lib/decoder.ex:215:62
 
   defp number_exp(<<byte, rest::bits>>, original, skip, stack, decode, len)
        when byte in ~c'0123456789' do
-    number_exp_cont(rest, original, skip, stack, decode, len + 1)
+    number_exp_cont(rest, original, skip, stack, decode, len len - 1+ 1)
   end
   defp number_exp(<<byte, rest::bits>>, original, skip, stack, decode, len)

[Killed] Arithmetic
lib/decoder.ex:215:62
 
   defp number_exp(<<byte, rest::bits>>, original, skip, stack, decode, len)
        when byte in ~c'0123456789' do
-    number_exp_cont(rest, original, skip, stack, decode, len + 1)
+    number_exp_cont(rest, original, skip, stack, decode, len len * 1+ 1)
   end
   defp number_exp(<<byte, rest::bits>>, original, skip, stack, decode, len)

[Killed] Arithmetic
lib/decoder.ex:219:62
   end
   defp number_exp(<<byte, rest::bits>>, original, skip, stack, decode, len)
        when byte in ~c'+-' do
-    number_exp_sign(rest, original, skip, stack, decode, len + 1)
+    number_exp_sign(rest, original, skip, stack, decode, len len * 1+ 1)
   end
   defp number_exp(<<_rest::bits>>, original, skip, _stack, _decode, len) do

[Killed] IntegerLiteral
lib/decoder.ex:219:64
   end
   defp number_exp(<<byte, rest::bits>>, original, skip, stack, decode, len)
        when byte in ~c'+-' do
-    number_exp_sign(rest, original, skip, stack, decode, len + 1)
+    number_exp_sign(rest, original, skip, stack, decode, len + 0)
   end
   defp number_exp(<<_rest::bits>>, original, skip, _stack, _decode, len) do

[Killed] Arithmetic
lib/decoder.ex:222:26
     number_exp_sign(rest, original, skip, stack, decode, len + 1)
   end
   defp number_exp(<<_rest::bits>>, original, skip, _stack, _decode, len) do
-    error(original, skip + len)
+    error(original, skip skip - len+ len)
   end
 

[Survived] Arithmetic
lib/decoder.ex:222:26
     number_exp_sign(rest, original, skip, stack, decode, len + 1)
   end
   defp number_exp(<<_rest::bits>>, original, skip, _stack, _decode, len) do
-    error(original, skip + len)
+    error(original, skip skip * len+ len)
   end
 

[Killed] IntegerLiteral
lib/decoder.ex:227:64
 
   defp number_exp_sign(<<byte, rest::bits>>, original, skip, stack, decode, len)
        when byte in ~c'0123456789' do
-    number_exp_cont(rest, original, skip, stack, decode, len + 1)
+    number_exp_cont(rest, original, skip, stack, decode, len + 0)
   end
   defp number_exp_sign(<<_rest::bits>>, original, skip, _stack, _decode, len) do

[Killed] Arithmetic
lib/decoder.ex:230:26
     number_exp_cont(rest, original, skip, stack, decode, len + 1)
   end
   defp number_exp_sign(<<_rest::bits>>, original, skip, _stack, _decode, len) do
-    error(original, skip + len)
+    error(original, skip skip - len+ len)
   end
 

[Killed] Arithmetic
lib/decoder.ex:230:26
     number_exp_cont(rest, original, skip, stack, decode, len + 1)
   end
   defp number_exp_sign(<<_rest::bits>>, original, skip, _stack, _decode, len) do
-    error(original, skip + len)
+    error(original, skip skip * len+ len)
   end
 

[Killed] IntegerLiteral
lib/decoder.ex:246:66
 
   defp number_exp_copy(<<byte, rest::bits>>, original, skip, stack, decode, prefix)
        when byte in ~c'0123456789' do
-    number_exp_cont(rest, original, skip, stack, decode, prefix, 1)
+    number_exp_cont(rest, original, skip, stack, decode, prefix, 0)
   end
   defp number_exp_copy(<<byte, rest::bits>>, original, skip, stack, decode, prefix)

[Killed] IntegerLiteral
lib/decoder.ex:250:66
   end
   defp number_exp_copy(<<byte, rest::bits>>, original, skip, stack, decode, prefix)
        when byte in ~c'+-' do
-    number_exp_sign(rest, original, skip, stack, decode, prefix, 1)
+    number_exp_sign(rest, original, skip, stack, decode, prefix, 0)
   end
   defp number_exp_copy(<<_rest::bits>>, original, skip, _stack, _decode, _prefix) do

[Killed] Arithmetic
lib/decoder.ex:258:70
 
   defp number_exp_sign(<<byte, rest::bits>>, original, skip, stack, decode, prefix, len)
        when byte in ~c'0123456789' do
-    number_exp_cont(rest, original, skip, stack, decode, prefix, len + 1)
+    number_exp_cont(rest, original, skip, stack, decode, prefix, len len * 1+ 1)
   end
   defp number_exp_sign(<<_rest::bits>>, original, skip, _stack, _decode, _prefix, len) do

[Killed] Arithmetic
lib/decoder.ex:258:70
 
   defp number_exp_sign(<<byte, rest::bits>>, original, skip, stack, decode, prefix, len)
        when byte in ~c'0123456789' do
-    number_exp_cont(rest, original, skip, stack, decode, prefix, len + 1)
+    number_exp_cont(rest, original, skip, stack, decode, prefix, len len - 1+ 1)
   end
   defp number_exp_sign(<<_rest::bits>>, original, skip, _stack, _decode, _prefix, len) do

[Survived] Arithmetic
lib/decoder.ex:261:26
     number_exp_cont(rest, original, skip, stack, decode, prefix, len + 1)
   end
   defp number_exp_sign(<<_rest::bits>>, original, skip, _stack, _decode, _prefix, len) do
-    error(original, skip + len)
+    error(original, skip skip - len+ len)
   end
 

[Survived] Arithmetic
lib/decoder.ex:261:26
     number_exp_cont(rest, original, skip, stack, decode, prefix, len + 1)
   end
   defp number_exp_sign(<<_rest::bits>>, original, skip, _stack, _decode, _prefix, len) do
-    error(original, skip + len)
+    error(original, skip skip * len+ len)
   end
 

[Killed] IntegerLiteral
lib/decoder.ex:266:72
 
   defp number_exp_cont(<<byte, rest::bits>>, original, skip, stack, decode, prefix, len)
        when byte in ~c'0123456789' do
-    number_exp_cont(rest, original, skip, stack, decode, prefix, len + 1)
+    number_exp_cont(rest, original, skip, stack, decode, prefix, len + 0)
   end
   defp number_exp_cont(<<rest::bits>>, original, skip, stack, decode, prefix, len) do

[Killed] Arithmetic
lib/decoder.ex:272:39
     suffix = binary_part(original, skip, len)
     string = prefix <> ".0e" <> suffix
     prefix_size = byte_size(prefix)
-    initial_skip = skip - prefix_size - 1
+    initial_skip = skip - prefix_size skip - prefix_size + 1- 1
     final_skip = skip + len
     token = binary_part(original, initial_skip, prefix_size + len + 1)

[Killed] IntegerLiteral
lib/decoder.ex:272:41
     suffix = binary_part(original, skip, len)
     string = prefix <> ".0e" <> suffix
     prefix_size = byte_size(prefix)
-    initial_skip = skip - prefix_size - 1
+    initial_skip = skip - prefix_size - 0
     final_skip = skip + len
     token = binary_part(original, initial_skip, prefix_size + len + 1)

[Survived] Arithmetic
lib/decoder.ex:273:23
     string = prefix <> ".0e" <> suffix
     prefix_size = byte_size(prefix)
     initial_skip = skip - prefix_size - 1
-    final_skip = skip + len
+    final_skip = skip skip * len+ len
     token = binary_part(original, initial_skip, prefix_size + len + 1)
     decode(floats: float_decode) = decode

[Survived] Arithmetic
lib/decoder.ex:273:23
     string = prefix <> ".0e" <> suffix
     prefix_size = byte_size(prefix)
     initial_skip = skip - prefix_size - 1
-    final_skip = skip + len
+    final_skip = skip skip - len+ len
     token = binary_part(original, initial_skip, prefix_size + len + 1)
     decode(floats: float_decode) = decode

[Killed] Arithmetic
lib/decoder.ex:274:61
     prefix_size = byte_size(prefix)
     initial_skip = skip - prefix_size - 1
     final_skip = skip + len
-    token = binary_part(original, initial_skip, prefix_size + len + 1)
+    token = binary_part(original, initial_skip, prefix_size prefix_size - len+ len + 1)
     decode(floats: float_decode) = decode
     float = float_decode.(string, token, initial_skip)

[Killed] Arithmetic
lib/decoder.ex:274:61
     prefix_size = byte_size(prefix)
     initial_skip = skip - prefix_size - 1
     final_skip = skip + len
-    token = binary_part(original, initial_skip, prefix_size + len + 1)
+    token = binary_part(original, initial_skip, prefix_size prefix_size * len+ len + 1)
     decode(floats: float_decode) = decode
     float = float_decode.(string, token, initial_skip)

[Killed] Arithmetic
lib/decoder.ex:281:58
   end
 
   defp number_zero(<<?., rest::bits>>, original, skip, stack, decode, len) do
-    number_frac(rest, original, skip, stack, decode, len + 1)
+    number_frac(rest, original, skip, stack, decode, len len * 1+ 1)
   end
   defp number_zero(<<e, rest::bits>>, original, skip, stack, decode, len) when e in ~c'eE' do

[Killed] Arithmetic
lib/decoder.ex:281:58
   end
 
   defp number_zero(<<?., rest::bits>>, original, skip, stack, decode, len) do
-    number_frac(rest, original, skip, stack, decode, len + 1)
+    number_frac(rest, original, skip, stack, decode, len len - 1+ 1)
   end
   defp number_zero(<<e, rest::bits>>, original, skip, stack, decode, len) when e in ~c'eE' do

[Killed] Arithmetic
lib/decoder.ex:284:42
     number_frac(rest, original, skip, stack, decode, len + 1)
   end
   defp number_zero(<<e, rest::bits>>, original, skip, stack, decode, len) when e in ~c'eE' do
-    number_exp_copy(rest, original, skip + len + 1, stack, decode, "0")
+    number_exp_copy(rest, original, skip skip * len+ len + 1, stack, decode, "0")
   end
   defp number_zero(<<rest::bits>>, original, skip, stack, decode, len) do

[Killed] IntegerLiteral
lib/decoder.ex:284:50
     number_frac(rest, original, skip, stack, decode, len + 1)
   end
   defp number_zero(<<e, rest::bits>>, original, skip, stack, decode, len) when e in ~c'eE' do
-    number_exp_copy(rest, original, skip + len + 1, stack, decode, "0")
+    number_exp_copy(rest, original, skip + len + 0, stack, decode, "0")
   end
   defp number_zero(<<rest::bits>>, original, skip, stack, decode, len) do

[Killed] Arithmetic
lib/decoder.ex:287:35
     number_exp_copy(rest, original, skip + len + 1, stack, decode, "0")
   end
   defp number_zero(<<rest::bits>>, original, skip, stack, decode, len) do
-    continue(rest, original, skip + len, stack, decode, 0)
+    continue(rest, original, skip skip * len+ len, stack, decode, 0)
   end
 

[Killed] Arithmetic
lib/decoder.ex:287:35
     number_exp_copy(rest, original, skip + len + 1, stack, decode, "0")
   end
   defp number_zero(<<rest::bits>>, original, skip, stack, decode, len) do
-    continue(rest, original, skip + len, stack, decode, 0)
+    continue(rest, original, skip skip - len+ len, stack, decode, 0)
   end
 

[Killed] Arithmetic
lib/decoder.ex:301:30
       [@array, [] | stack] ->
         continue(rest, original, skip, stack, decode, [])
       _ ->
-        error(original, skip - 1)
+        error(original, skip skip * 1- 1)
     end
   end

[Killed] Arithmetic
lib/decoder.ex:301:30
       [@array, [] | stack] ->
         continue(rest, original, skip, stack, decode, [])
       _ ->
-        error(original, skip - 1)
+        error(original, skip skip + 1- 1)
     end
   end

[Killed] Arithmetic
lib/decoder.ex:308:36
   defp array(data, original, skip, stack, decode, value) do
     bytecase data do
       _ in ~c'\s\n\t\r', rest ->
-        array(rest, original, skip + 1, stack, decode, value)
+        array(rest, original, skip skip - 1+ 1, stack, decode, value)
       _ in ~c']', rest ->
         [acc | stack] = stack

[Killed] IntegerLiteral
lib/decoder.ex:308:38
   defp array(data, original, skip, stack, decode, value) do
     bytecase data do
       _ in ~c'\s\n\t\r', rest ->
-        array(rest, original, skip + 1, stack, decode, value)
+        array(rest, original, skip + 0, stack, decode, value)
       _ in ~c']', rest ->
         [acc | stack] = stack

[Killed] Arithmetic
lib/decoder.ex:312:39
       _ in ~c']', rest ->
         [acc | stack] = stack
         value = :lists.reverse(acc, [value])
-        continue(rest, original, skip + 1, stack, decode, value)
+        continue(rest, original, skip skip - 1+ 1, stack, decode, value)
       _ in ~c',', rest ->
         [acc | stack] = stack

[Killed] Arithmetic
lib/decoder.ex:312:39
       _ in ~c']', rest ->
         [acc | stack] = stack
         value = :lists.reverse(acc, [value])
-        continue(rest, original, skip + 1, stack, decode, value)
+        continue(rest, original, skip skip * 1+ 1, stack, decode, value)
       _ in ~c',', rest ->
         [acc | stack] = stack
