[Killed] IntegerLiteral
lib/decoder.ex:315:38
         continue(rest, original, skip + 1, stack, decode, value)
       _ in ~c',', rest ->
         [acc | stack] = stack
-        value(rest, original, skip + 1, [@array, [value | acc] | stack], decode)
+        value(rest, original, skip + 0, [@array, [value | acc] | stack], decode)
       _, _rest ->
         error(original, skip)

[Killed] Arithmetic
lib/decoder.ex:315:36
         continue(rest, original, skip + 1, stack, decode, value)
       _ in ~c',', rest ->
         [acc | stack] = stack
-        value(rest, original, skip + 1, [@array, [value | acc] | stack], decode)
+        value(rest, original, skip skip * 1+ 1, [@array, [value | acc] | stack], decode)
       _, _rest ->
         error(original, skip)

[Killed] Arithmetic
lib/decoder.ex:332:37
   defp object(data, original, skip, stack, decode, value) do
     bytecase data do
       _ in ~c'\s\n\t\r', rest ->
-        object(rest, original, skip + 1, stack, decode, value)
+        object(rest, original, skip skip - 1+ 1, stack, decode, value)
       _ in ~c'}', rest ->
         skip = skip + 1

[Killed] IntegerLiteral
lib/decoder.ex:332:39
   defp object(data, original, skip, stack, decode, value) do
     bytecase data do
       _ in ~c'\s\n\t\r', rest ->
-        object(rest, original, skip + 1, stack, decode, value)
+        object(rest, original, skip + 0, stack, decode, value)
       _ in ~c'}', rest ->
         skip = skip + 1

[Killed] Arithmetic
lib/decoder.ex:334:21
       _ in ~c'\s\n\t\r', rest ->
         object(rest, original, skip + 1, stack, decode, value)
       _ in ~c'}', rest ->
-        skip = skip + 1
+        skip = skip skip * 1+ 1
         [key, acc | stack] = stack
         decode(keys: key_decode) = decode

[Killed] Arithmetic
lib/decoder.ex:334:21
       _ in ~c'\s\n\t\r', rest ->
         object(rest, original, skip + 1, stack, decode, value)
       _ in ~c'}', rest ->
-        skip = skip + 1
+        skip = skip skip - 1+ 1
         [key, acc | stack] = stack
         decode(keys: key_decode) = decode

[Killed] Arithmetic
lib/decoder.ex:341:21
         decode(objects: object_decode) = decode
         continue(rest, original, skip, stack, decode, object_decode.(final))
       _ in ~c',', rest ->
-        skip = skip + 1
+        skip = skip skip * 1+ 1
         [key, acc | stack] = stack
         decode(keys: key_decode) = decode

[Killed] IntegerLiteral
lib/decoder.ex:341:23
         decode(objects: object_decode) = decode
         continue(rest, original, skip, stack, decode, object_decode.(final))
       _ in ~c',', rest ->
-        skip = skip + 1
+        skip = skip + 0
         [key, acc | stack] = stack
         decode(keys: key_decode) = decode

[Killed] IntegerLiteral
lib/decoder.ex:356:36
   defp key(data, original, skip, stack, decode) do
     bytecase data do
       _ in ~c'\s\n\t\r', rest ->
-        key(rest, original, skip + 1, stack, decode)
+        key(rest, original, skip + 0, stack, decode)
       _ in ~c'}', rest ->
         case stack do

[Killed] Arithmetic
lib/decoder.ex:356:34
   defp key(data, original, skip, stack, decode) do
     bytecase data do
       _ in ~c'\s\n\t\r', rest ->
-        key(rest, original, skip + 1, stack, decode)
+        key(rest, original, skip skip * 1+ 1, stack, decode)
       _ in ~c'}', rest ->
         case stack do

[Killed] IntegerLiteral
lib/decoder.ex:361:45
         case stack do
           [[] | stack] ->
             decode(objects: object_decode) = decode
-            continue(rest, original, skip + 1, stack, decode, object_decode.([]))
+            continue(rest, original, skip + 0, stack, decode, object_decode.([]))
           _ ->
             error(original, skip)

[Killed] Arithmetic
lib/decoder.ex:361:43
         case stack do
           [[] | stack] ->
             decode(objects: object_decode) = decode
-            continue(rest, original, skip + 1, stack, decode, object_decode.([]))
+            continue(rest, original, skip skip * 1+ 1, stack, decode, object_decode.([]))
           _ ->
             error(original, skip)

[Killed] Arithmetic
lib/decoder.ex:366:37
             error(original, skip)
         end
       _ in ~c'"', rest ->
-        string(rest, original, skip + 1, [@key | stack], decode, 0)
+        string(rest, original, skip skip * 1+ 1, [@key | stack], decode, 0)
       _, _rest ->
         error(original, skip)

[Killed] Arithmetic
lib/decoder.ex:366:37
             error(original, skip)
         end
       _ in ~c'"', rest ->
-        string(rest, original, skip + 1, [@key | stack], decode, 0)
+        string(rest, original, skip skip - 1+ 1, [@key | stack], decode, 0)
       _, _rest ->
         error(original, skip)

[Killed] Arithmetic
lib/decoder.ex:377:34
   defp key(data, original, skip, stack, decode, value) do
     bytecase data do
       _ in ~c'\s\n\t\r', rest ->
-        key(rest, original, skip + 1, stack, decode, value)
+        key(rest, original, skip skip - 1+ 1, stack, decode, value)
       _ in ~c':', rest ->
         value(rest, original, skip + 1, [@object, value | stack], decode)

[Killed] Arithmetic
lib/decoder.ex:377:34
   defp key(data, original, skip, stack, decode, value) do
     bytecase data do
       _ in ~c'\s\n\t\r', rest ->
-        key(rest, original, skip + 1, stack, decode, value)
+        key(rest, original, skip skip * 1+ 1, stack, decode, value)
       _ in ~c':', rest ->
         value(rest, original, skip + 1, [@object, value | stack], decode)

[Killed] IntegerLiteral
lib/decoder.ex:379:38
       _ in ~c'\s\n\t\r', rest ->
         key(rest, original, skip + 1, stack, decode, value)
       _ in ~c':', rest ->
-        value(rest, original, skip + 1, [@object, value | stack], decode)
+        value(rest, original, skip + 0, [@object, value | stack], decode)
       _, _rest ->
         error(original, skip)

[Killed] Arithmetic
lib/decoder.ex:379:36
       _ in ~c'\s\n\t\r', rest ->
         key(rest, original, skip + 1, stack, decode, value)
       _ in ~c':', rest ->
-        value(rest, original, skip + 1, [@object, value | stack], decode)
+        value(rest, original, skip skip * 1+ 1, [@object, value | stack], decode)
       _, _rest ->
         error(original, skip)

[Killed] IntegerLiteral
lib/decoder.ex:391:20
   # https://git.ninenines.eu/cowlib.git/tree/src/cow_ws.erl#n469
   # http://bjoern.hoehrmann.de/utf-8/decoder/dfa/
   defp string(data, original, skip, stack, decode, len) do
-    bytecase data, 128 do
+    bytecase data, 0 do
       _ in ~c'"', rest ->
         decode(strings: string_decode) = decode

[Killed] IntegerLiteral
lib/decoder.ex:391:20
   # https://git.ninenines.eu/cowlib.git/tree/src/cow_ws.erl#n469
   # http://bjoern.hoehrmann.de/utf-8/decoder/dfa/
   defp string(data, original, skip, stack, decode, len) do
-    bytecase data, 128 do
+    bytecase data, 129 do
       _ in ~c'"', rest ->
         decode(strings: string_decode) = decode

[Killed] Arithmetic
lib/decoder.ex:395:39
       _ in ~c'"', rest ->
         decode(strings: string_decode) = decode
         string = string_decode.(binary_part(original, skip, len))
-        continue(rest, original, skip + len + 1, stack, decode, string)
+        continue(rest, original, skip skip * len+ len + 1, stack, decode, string)
       _ in ~c'\\', rest ->
         part = binary_part(original, skip, len)

[Killed] IntegerLiteral
lib/decoder.ex:395:47
       _ in ~c'"', rest ->
         decode(strings: string_decode) = decode
         string = string_decode.(binary_part(original, skip, len))
-        continue(rest, original, skip + len + 1, stack, decode, string)
+        continue(rest, original, skip + len + 0, stack, decode, string)
       _ in ~c'\\', rest ->
         part = binary_part(original, skip, len)

[Killed] Arithmetic
lib/decoder.ex:398:37
         continue(rest, original, skip + len + 1, stack, decode, string)
       _ in ~c'\\', rest ->
         part = binary_part(original, skip, len)
-        escape(rest, original, skip + len, stack, decode, part)
+        escape(rest, original, skip skip * len+ len, stack, decode, part)
       _ in unquote(0x00..0x1F), _rest ->
         error(original, skip + len)

[Killed] Arithmetic
lib/decoder.ex:398:37
         continue(rest, original, skip + len + 1, stack, decode, string)
       _ in ~c'\\', rest ->
         part = binary_part(original, skip, len)
-        escape(rest, original, skip + len, stack, decode, part)
+        escape(rest, original, skip skip - len+ len, stack, decode, part)
       _ in unquote(0x00..0x1F), _rest ->
         error(original, skip + len)

[Killed] Arithmetic
lib/decoder.ex:400:30
         part = binary_part(original, skip, len)
         escape(rest, original, skip + len, stack, decode, part)
       _ in unquote(0x00..0x1F), _rest ->
-        error(original, skip + len)
+        error(original, skip skip * len+ len)
       _, rest ->
         string(rest, original, skip, stack, decode, len + 1)

[Killed] Arithmetic
lib/decoder.ex:400:30
         part = binary_part(original, skip, len)
         escape(rest, original, skip + len, stack, decode, part)
       _ in unquote(0x00..0x1F), _rest ->
-        error(original, skip + len)
+        error(original, skip skip - len+ len)
       _, rest ->
         string(rest, original, skip, stack, decode, len + 1)

[Killed] Arithmetic
lib/decoder.ex:402:57
       _ in unquote(0x00..0x1F), _rest ->
         error(original, skip + len)
       _, rest ->
-        string(rest, original, skip, stack, decode, len + 1)
+        string(rest, original, skip, stack, decode, len len - 1+ 1)
       <<char::utf8, rest::bits>> when char <= 0x7FF ->
         string(rest, original, skip, stack, decode, len + 2)

[Killed] Arithmetic
lib/decoder.ex:402:57
       _ in unquote(0x00..0x1F), _rest ->
         error(original, skip + len)
       _, rest ->
-        string(rest, original, skip, stack, decode, len + 1)
+        string(rest, original, skip, stack, decode, len len * 1+ 1)
       <<char::utf8, rest::bits>> when char <= 0x7FF ->
         string(rest, original, skip, stack, decode, len + 2)

[Killed] Arithmetic
lib/decoder.ex:404:57
       _, rest ->
         string(rest, original, skip, stack, decode, len + 1)
       <<char::utf8, rest::bits>> when char <= 0x7FF ->
-        string(rest, original, skip, stack, decode, len + 2)
+        string(rest, original, skip, stack, decode, len len * 2+ 2)
       <<char::utf8, rest::bits>> when char <= 0xFFFF ->
         string(rest, original, skip, stack, decode, len + 3)

[Killed] IntegerLiteral
lib/decoder.ex:404:59
       _, rest ->
         string(rest, original, skip, stack, decode, len + 1)
       <<char::utf8, rest::bits>> when char <= 0x7FF ->
-        string(rest, original, skip, stack, decode, len + 2)
+        string(rest, original, skip, stack, decode, len + 3)
       <<char::utf8, rest::bits>> when char <= 0xFFFF ->
         string(rest, original, skip, stack, decode, len + 3)

[Killed] Arithmetic
lib/decoder.ex:406:57
       <<char::utf8, rest::bits>> when char <= 0x7FF ->
         string(rest, original, skip, stack, decode, len + 2)
       <<char::utf8, rest::bits>> when char <= 0xFFFF ->
-        string(rest, original, skip, stack, decode, len + 3)
+        string(rest, original, skip, stack, decode, len len * 3+ 3)
       <<_char::utf8, rest::bits>> ->
         string(rest, original, skip, stack, decode, len + 4)

[Killed] Arithmetic
lib/decoder.ex:406:57
       <<char::utf8, rest::bits>> when char <= 0x7FF ->
         string(rest, original, skip, stack, decode, len + 2)
       <<char::utf8, rest::bits>> when char <= 0xFFFF ->
-        string(rest, original, skip, stack, decode, len + 3)
+        string(rest, original, skip, stack, decode, len len - 3+ 3)
       <<_char::utf8, rest::bits>> ->
         string(rest, original, skip, stack, decode, len + 4)

[Killed] IntegerLiteral
lib/decoder.ex:408:59
       <<char::utf8, rest::bits>> when char <= 0xFFFF ->
         string(rest, original, skip, stack, decode, len + 3)
       <<_char::utf8, rest::bits>> ->
-        string(rest, original, skip, stack, decode, len + 4)
+        string(rest, original, skip, stack, decode, len + 5)
       <<_::bits>> ->
         empty_error(original, skip + len)

[Killed] IntegerLiteral
lib/decoder.ex:408:59
       <<char::utf8, rest::bits>> when char <= 0xFFFF ->
         string(rest, original, skip, stack, decode, len + 3)
       <<_char::utf8, rest::bits>> ->
-        string(rest, original, skip, stack, decode, len + 4)
+        string(rest, original, skip, stack, decode, len + 0)
       <<_::bits>> ->
         empty_error(original, skip + len)

[Killed] Arithmetic
lib/decoder.ex:410:36
       <<_char::utf8, rest::bits>> ->
         string(rest, original, skip, stack, decode, len + 4)
       <<_::bits>> ->
-        empty_error(original, skip + len)
+        empty_error(original, skip skip - len+ len)
     end
   end

[Killed] Arithmetic
lib/decoder.ex:410:36
       <<_char::utf8, rest::bits>> ->
         string(rest, original, skip, stack, decode, len + 4)
       <<_::bits>> ->
-        empty_error(original, skip + len)
+        empty_error(original, skip skip * len+ len)
     end
   end

[Killed] IntegerLiteral
lib/decoder.ex:415:20
   end
 
   defp string(data, original, skip, stack, decode, acc, len) do
-    bytecase data, 128 do
+    bytecase data, 0 do
       _ in ~c'"', rest ->
         last = binary_part(original, skip, len)

[Survived] IntegerLiteral
lib/decoder.ex:415:20
   end
 
   defp string(data, original, skip, stack, decode, acc, len) do
-    bytecase data, 128 do
+    bytecase data, 129 do
       _ in ~c'"', rest ->
         last = binary_part(original, skip, len)

[Killed] Arithmetic
lib/decoder.ex:419:39
       _ in ~c'"', rest ->
         last = binary_part(original, skip, len)
         string = IO.iodata_to_binary([acc | last])
-        continue(rest, original, skip + len + 1, stack, decode, string)
+        continue(rest, original, skip skip - len+ len + 1, stack, decode, string)
       _ in ~c'\\', rest ->
         part = binary_part(original, skip, len)

[Killed] Arithmetic
lib/decoder.ex:419:45
       _ in ~c'"', rest ->
         last = binary_part(original, skip, len)
         string = IO.iodata_to_binary([acc | last])
-        continue(rest, original, skip + len + 1, stack, decode, string)
+        continue(rest, original, skip + len skip + len - 1+ 1, stack, decode, string)
       _ in ~c'\\', rest ->
         part = binary_part(original, skip, len)

[Killed] Arithmetic
lib/decoder.ex:422:37
         continue(rest, original, skip + len + 1, stack, decode, string)
       _ in ~c'\\', rest ->
         part = binary_part(original, skip, len)
-        escape(rest, original, skip + len, stack, decode, [acc | part])
+        escape(rest, original, skip skip * len+ len, stack, decode, [acc | part])
       _ in unquote(0x00..0x1F), _rest ->
         error(original, skip + len)

[Survived] Arithmetic
lib/decoder.ex:422:37
         continue(rest, original, skip + len + 1, stack, decode, string)
       _ in ~c'\\', rest ->
         part = binary_part(original, skip, len)
-        escape(rest, original, skip + len, stack, decode, [acc | part])
+        escape(rest, original, skip skip - len+ len, stack, decode, [acc | part])
       _ in unquote(0x00..0x1F), _rest ->
         error(original, skip + len)

[Killed] Arithmetic
lib/decoder.ex:426:62
       _ in unquote(0x00..0x1F), _rest ->
         error(original, skip + len)
       _, rest ->
-        string(rest, original, skip, stack, decode, acc, len + 1)
+        string(rest, original, skip, stack, decode, acc, len len - 1+ 1)
       <<char::utf8, rest::bits>> when char <= 0x7FF ->
         string(rest, original, skip, stack, decode, acc, len + 2)

[Killed] Arithmetic
lib/decoder.ex:426:62
       _ in unquote(0x00..0x1F), _rest ->
         error(original, skip + len)
       _, rest ->
-        string(rest, original, skip, stack, decode, acc, len + 1)
+        string(rest, original, skip, stack, decode, acc, len len * 1+ 1)
       <<char::utf8, rest::bits>> when char <= 0x7FF ->
         string(rest, original, skip, stack, decode, acc, len + 2)

[Survived] IntegerLiteral
lib/decoder.ex:428:64
       _, rest ->
         string(rest, original, skip, stack, decode, acc, len + 1)
       <<char::utf8, rest::bits>> when char <= 0x7FF ->
-        string(rest, original, skip, stack, decode, acc, len + 2)
+        string(rest, original, skip, stack, decode, acc, len + 0)
       <<char::utf8, rest::bits>> when char <= 0xFFFF ->
         string(rest, original, skip, stack, decode, acc, len + 3)

[Survived] Arithmetic
lib/decoder.ex:428:62
       _, rest ->
         string(rest, original, skip, stack, decode, acc, len + 1)
       <<char::utf8, rest::bits>> when char <= 0x7FF ->
-        string(rest, original, skip, stack, decode, acc, len + 2)
+        string(rest, original, skip, stack, decode, acc, len len - 2+ 2)
       <<char::utf8, rest::bits>> when char <= 0xFFFF ->
         string(rest, original, skip, stack, decode, acc, len + 3)

[Survived] Arithmetic
lib/decoder.ex:430:62
       <<char::utf8, rest::bits>> when char <= 0x7FF ->
         string(rest, original, skip, stack, decode, acc, len + 2)
       <<char::utf8, rest::bits>> when char <= 0xFFFF ->
-        string(rest, original, skip, stack, decode, acc, len + 3)
+        string(rest, original, skip, stack, decode, acc, len len - 3+ 3)
       <<_char::utf8, rest::bits>> ->
         string(rest, original, skip, stack, decode, acc, len + 4)

[Survived] Arithmetic
lib/decoder.ex:430:62
       <<char::utf8, rest::bits>> when char <= 0x7FF ->
         string(rest, original, skip, stack, decode, acc, len + 2)
       <<char::utf8, rest::bits>> when char <= 0xFFFF ->
-        string(rest, original, skip, stack, decode, acc, len + 3)
+        string(rest, original, skip, stack, decode, acc, len len * 3+ 3)
       <<_char::utf8, rest::bits>> ->
         string(rest, original, skip, stack, decode, acc, len + 4)

[Survived] IntegerLiteral
lib/decoder.ex:432:64
       <<char::utf8, rest::bits>> when char <= 0xFFFF ->
         string(rest, original, skip, stack, decode, acc, len + 3)
       <<_char::utf8, rest::bits>> ->
-        string(rest, original, skip, stack, decode, acc, len + 4)
+        string(rest, original, skip, stack, decode, acc, len + 0)
       <<_::bits>> ->
         empty_error(original, skip + len)

[Survived] Arithmetic
lib/decoder.ex:432:62
       <<char::utf8, rest::bits>> when char <= 0xFFFF ->
         string(rest, original, skip, stack, decode, acc, len + 3)
       <<_char::utf8, rest::bits>> ->
-        string(rest, original, skip, stack, decode, acc, len + 4)
+        string(rest, original, skip, stack, decode, acc, len len * 4+ 4)
       <<_::bits>> ->
         empty_error(original, skip + len)

[Killed] Arithmetic
lib/decoder.ex:441:37
   defp escape(data, original, skip, stack, decode, acc) do
     bytecase data do
       _ in ~c'b', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\b'], 0)
+        string(rest, original, skip skip * 2+ 2, stack, decode, [acc | ~c'\b'], 0)
       _ in ~c't', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\t'], 0)

[Killed] IntegerLiteral
lib/decoder.ex:441:73
   defp escape(data, original, skip, stack, decode, acc) do
     bytecase data do
       _ in ~c'b', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\b'], 0)
+        string(rest, original, skip + 2, stack, decode, [acc | ~c'\b'], 1)
       _ in ~c't', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\t'], 0)

[Killed] Arithmetic
lib/decoder.ex:443:37
       _ in ~c'b', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\b'], 0)
       _ in ~c't', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\t'], 0)
+        string(rest, original, skip skip * 2+ 2, stack, decode, [acc | ~c'\t'], 0)
       _ in ~c'n', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\n'], 0)

[Killed] IntegerLiteral
lib/decoder.ex:443:73
       _ in ~c'b', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\b'], 0)
       _ in ~c't', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\t'], 0)
+        string(rest, original, skip + 2, stack, decode, [acc | ~c'\t'], 1)
       _ in ~c'n', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\n'], 0)

[Killed] IntegerLiteral
lib/decoder.ex:445:73
       _ in ~c't', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\t'], 0)
       _ in ~c'n', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\n'], 0)
+        string(rest, original, skip + 2, stack, decode, [acc | ~c'\n'], 1)
       _ in ~c'f', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\f'], 0)

[Killed] Arithmetic
lib/decoder.ex:445:37
       _ in ~c't', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\t'], 0)
       _ in ~c'n', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\n'], 0)
+        string(rest, original, skip skip * 2+ 2, stack, decode, [acc | ~c'\n'], 0)
       _ in ~c'f', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\f'], 0)

[Killed] IntegerLiteral
lib/decoder.ex:447:73
       _ in ~c'n', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\n'], 0)
       _ in ~c'f', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\f'], 0)
+        string(rest, original, skip + 2, stack, decode, [acc | ~c'\f'], 1)
       _ in ~c'r', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\r'], 0)

[Killed] Arithmetic
lib/decoder.ex:447:37
       _ in ~c'n', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\n'], 0)
       _ in ~c'f', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\f'], 0)
+        string(rest, original, skip skip * 2+ 2, stack, decode, [acc | ~c'\f'], 0)
       _ in ~c'r', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\r'], 0)

[Killed] Arithmetic
lib/decoder.ex:449:37
       _ in ~c'f', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\f'], 0)
       _ in ~c'r', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\r'], 0)
+        string(rest, original, skip skip * 2+ 2, stack, decode, [acc | ~c'\r'], 0)
       _ in ~c'"', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\"'], 0)

[Killed] IntegerLiteral
lib/decoder.ex:449:73
       _ in ~c'f', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\f'], 0)
       _ in ~c'r', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\r'], 0)
+        string(rest, original, skip + 2, stack, decode, [acc | ~c'\r'], 1)
       _ in ~c'"', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\"'], 0)

[Killed] IntegerLiteral
lib/decoder.ex:451:39
       _ in ~c'r', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\r'], 0)
       _ in ~c'"', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\"'], 0)
+        string(rest, original, skip + 3, stack, decode, [acc | ~c'\"'], 0)
       _ in ~c'/', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'/'], 0)

[Killed] IntegerLiteral
lib/decoder.ex:451:39
       _ in ~c'r', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\r'], 0)
       _ in ~c'"', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\"'], 0)
+        string(rest, original, skip + 0, stack, decode, [acc | ~c'\"'], 0)
       _ in ~c'/', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'/'], 0)

[Killed] Arithmetic
lib/decoder.ex:453:37
       _ in ~c'"', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\"'], 0)
       _ in ~c'/', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'/'], 0)
+        string(rest, original, skip skip * 2+ 2, stack, decode, [acc | ~c'/'], 0)
       _ in ~c'\\', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\\'], 0)

[Killed] IntegerLiteral
lib/decoder.ex:453:72
       _ in ~c'"', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\"'], 0)
       _ in ~c'/', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'/'], 0)
+        string(rest, original, skip + 2, stack, decode, [acc | ~c'/'], 1)
       _ in ~c'\\', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'\\'], 0)

[Killed] IntegerLiteral
lib/decoder.ex:455:39
       _ in ~c'/', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'/'], 0)
       _ in ~c'\\', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\\'], 0)
+        string(rest, original, skip + 3, stack, decode, [acc | ~c'\\'], 0)
       _ in ~c'u', rest ->
         escapeu(rest, original, skip, stack, decode, acc)

[Killed] IntegerLiteral
lib/decoder.ex:455:73
       _ in ~c'/', rest ->
         string(rest, original, skip + 2, stack, decode, [acc | ~c'/'], 0)
       _ in ~c'\\', rest ->
-        string(rest, original, skip + 2, stack, decode, [acc | ~c'\\'], 0)
+        string(rest, original, skip + 2, stack, decode, [acc | ~c'\\'], 1)
       _ in ~c'u', rest ->
         escapeu(rest, original, skip, stack, decode, acc)

[Killed] Arithmetic
lib/decoder.ex:459:30
       _ in ~c'u', rest ->
         escapeu(rest, original, skip, stack, decode, acc)
       _, _rest ->
-        error(original, skip + 1)
+        error(original, skip skip - 1+ 1)
       <<_::bits>> ->
         empty_error(original, skip)

[Killed] Arithmetic
lib/decoder.ex:459:30
       _ in ~c'u', rest ->
         escapeu(rest, original, skip, stack, decode, acc)
       _, _rest ->
-        error(original, skip + 1)
+        error(original, skip skip * 1+ 1)
       <<_::bits>> ->
         empty_error(original, skip)

[Killed] IntegerLiteral
lib/decoder.ex:474:21
 
     def unicode_escapes(chars1 \\ @digits, chars2 \\ @digits) do
       for char1 <- chars1, char2 <- chars2 do
-        {(char1 <<< 8) + char2, integer8(char1, char2)}
+        {(char1 <<< 9) + char2, integer8(char1, char2)}
       end
     end

[Killed] IntegerLiteral
lib/decoder.ex:474:21
 
     def unicode_escapes(chars1 \\ @digits, chars2 \\ @digits) do
       for char1 <- chars1, char2 <- chars2 do
-        {(char1 <<< 8) + char2, integer8(char1, char2)}
+        {(char1 <<< 0) + char2, integer8(char1, char2)}
       end
     end

[Killed] IntegerLiteral
lib/decoder.ex:479:28
     end
 
     defp integer8(char1, char2) do
-      (integer4(char1) <<< 4) + integer4(char2)
+      (integer4(char1) <<< 0) + integer4(char2)
     end
 

[Survived] Arithmetic
lib/decoder.ex:479:31
     end
 
     defp integer8(char1, char2) do
-      (integer4(char1) <<< 4) + integer4(char2)
+      (integer4(char1) <<< 4) (integer4(char1) <<< 4) * integer4(char2)+ integer4(char2)
     end
 

[Killed] IntegerLiteral
lib/decoder.ex:482:57
       (integer4(char1) <<< 4) + integer4(char2)
     end
 
-    defp integer4(char) when char in ?0..?9, do: char - ?0
+    defp integer4(char) when char in ?0..?9, do: char - 49
     defp integer4(char) when char in ?A..?F, do: char - ?A + 10
     defp integer4(char) when char in ?a..?f, do: char - ?a + 10

[Survived] Arithmetic
lib/decoder.ex:482:55
       (integer4(char1) <<< 4) + integer4(char2)
     end
 
-    defp integer4(char) when char in ?0..?9, do: char - ?0
+    defp integer4(char) when char in ?0..?9, do: char char * 48- ?0
     defp integer4(char) when char in ?A..?F, do: char - ?A + 10
     defp integer4(char) when char in ?a..?f, do: char - ?a + 10

[Killed] IntegerLiteral
lib/decoder.ex:483:57
     end
 
     defp integer4(char) when char in ?0..?9, do: char - ?0
-    defp integer4(char) when char in ?A..?F, do: char - ?A + 10
+    defp integer4(char) when char in ?A..?F, do: char - 66 + 10
     defp integer4(char) when char in ?a..?f, do: char - ?a + 10
 

[Killed] IntegerLiteral
lib/decoder.ex:483:62
     end
 
     defp integer4(char) when char in ?0..?9, do: char - ?0
-    defp integer4(char) when char in ?A..?F, do: char - ?A + 10
+    defp integer4(char) when char in ?A..?F, do: char - ?A + 0
     defp integer4(char) when char in ?a..?f, do: char - ?a + 10
 

[Killed] IntegerLiteral
lib/decoder.ex:484:57
 
     defp integer4(char) when char in ?0..?9, do: char - ?0
     defp integer4(char) when char in ?A..?F, do: char - ?A + 10
-    defp integer4(char) when char in ?a..?f, do: char - ?a + 10
+    defp integer4(char) when char in ?a..?f, do: char - 98 + 10
 
     defp token_error_clause(original, skip, len) do

[Killed] IntegerLiteral
lib/decoder.ex:484:62
 
     defp integer4(char) when char in ?0..?9, do: char - ?0
     defp integer4(char) when char in ?A..?F, do: char - ?A + 10
-    defp integer4(char) when char in ?a..?f, do: char - ?a + 10
+    defp integer4(char) when char in ?a..?f, do: char - ?a + 0
 
     defp token_error_clause(original, skip, len) do

[Killed] IntegerLiteral
lib/decoder.ex:504:31
 
     defp escapeu_first_clauses(last, rest, original, skip, stack, decode, acc) do
       for {int, first} <- unicode_escapes(),
-          not (first in 0xDC..0xDF) do
+          not (first in 0xDC..0) do
         escapeu_first_clause(int, first, last, rest, original, skip, stack, decode, acc)
       end
