[Killed] IntegerLiteral
lib/decoder.ex:504:25
 
     defp escapeu_first_clauses(last, rest, original, skip, stack, decode, acc) do
       for {int, first} <- unicode_escapes(),
-          not (first in 0xDC..0xDF) do
+          not (first in 0..0xDF) do
         escapeu_first_clause(int, first, last, rest, original, skip, stack, decode, acc)
       end

[Killed] GuardComparisonNegation
lib/decoder.ex:524:15
     end
 
     defp escapeu_first_clause(int, first, last, rest, original, skip, stack, decode, acc)
-         when first <= 0x00 do
+         when first > 0x00 do
       skip = quote do: (unquote(skip) + 6)
       acc =

[Survived] GuardComparisonBoundary
lib/decoder.ex:524:15
     end
 
     defp escapeu_first_clause(int, first, last, rest, original, skip, stack, decode, acc)
-         when first <= 0x00 do
+         when first < 0x00 do
       skip = quote do: (unquote(skip) + 6)
       acc =

[Killed] IntegerLiteral
lib/decoder.ex:538:57
             [acc, byte1, byte2]
           end
         end
-      args = [rest, original, skip, stack, decode, acc, 0]
+      args = [rest, original, skip, stack, decode, acc, 1]
       [clause] =
         quote location: :keep do

[Killed] IntegerLiteral
lib/decoder.ex:614:32
 
     defp escapeu_surrogate_clauses(last, rest, original, skip, stack, decode, acc, hi) do
       digits1 = ~c'Dd'
-      digits2 = Stream.concat([?C..?F, ?c..?f])
+      digits2 = Stream.concat([68..?F, ?c..?f])
       for {int, first} <- unicode_escapes(digits1, digits2) do
         escapeu_surrogate_clause(int, first, last, rest, original, skip, stack, decode, acc, hi)

[Killed] IntegerLiteral
lib/decoder.ex:614:40
 
     defp escapeu_surrogate_clauses(last, rest, original, skip, stack, decode, acc, hi) do
       digits1 = ~c'Dd'
-      digits2 = Stream.concat([?C..?F, ?c..?f])
+      digits2 = Stream.concat([?C..?F, 100..?f])
       for {int, first} <- unicode_escapes(digits1, digits2) do
         escapeu_surrogate_clause(int, first, last, rest, original, skip, stack, decode, acc, hi)

[Killed] IntegerLiteral
lib/decoder.ex:656:48
   defp escape_surrogate(<<?\\, ?u, int1::16, int2::16, rest::bits>>, original,
        skip, stack, decode, acc, hi) do
     require Unescape
-    last = escapeu_last(int2, original, skip + 6)
+    last = escapeu_last(int2, original, skip + 0)
     Unescape.escapeu_surrogate(int1, last, rest, original, skip, stack, decode, acc, hi)
   end

[Killed] Arithmetic
lib/decoder.ex:656:46
   defp escape_surrogate(<<?\\, ?u, int1::16, int2::16, rest::bits>>, original,
        skip, stack, decode, acc, hi) do
     require Unescape
-    last = escapeu_last(int2, original, skip + 6)
+    last = escapeu_last(int2, original, skip skip * 6+ 6)
     Unescape.escapeu_surrogate(int1, last, rest, original, skip, stack, decode, acc, hi)
   end

[Killed] Arithmetic
lib/decoder.ex:660:26
     Unescape.escapeu_surrogate(int1, last, rest, original, skip, stack, decode, acc, hi)
   end
   defp escape_surrogate(<<_rest::bits>>, original, skip, _stack, _decode, _acc, _hi) do
-    error(original, skip + 6)
+    error(original, skip skip * 6+ 6)
   end
 

[Killed] Arithmetic
lib/decoder.ex:660:26
     Unescape.escapeu_surrogate(int1, last, rest, original, skip, stack, decode, acc, hi)
   end
   defp escape_surrogate(<<_rest::bits>>, original, skip, _stack, _decode, _acc, _hi) do
-    error(original, skip + 6)
+    error(original, skip skip - 6+ 6)
   end
 

[Killed] Arithmetic
lib/decoder.ex:664:28
   end
 
   defp error(<<_rest::bits>>, _original, skip, _stack, _decode) do
-    throw {:position, skip - 1}
+    throw {:position, skip skip + 1- 1}
   end
 

[Killed] Arithmetic
lib/decoder.ex:664:28
   end
 
   defp error(<<_rest::bits>>, _original, skip, _stack, _decode) do
-    throw {:position, skip - 1}
+    throw {:position, skip skip * 1- 1}
   end
 

[Survived] IntegerLiteral
lib/decoder.ex:700:38
 
   defp terminate(<<byte, rest::bits>>, original, skip, stack, decode, value)
        when byte in ~c'\s\n\r\t' do
-    terminate(rest, original, skip + 1, stack, decode, value)
+    terminate(rest, original, skip + 0, stack, decode, value)
   end
   defp terminate(<<>>, _original, _skip, _stack, _decode, value) do

[Survived] Arithmetic
lib/decoder.ex:700:36
 
   defp terminate(<<byte, rest::bits>>, original, skip, stack, decode, value)
        when byte in ~c'\s\n\r\t' do
-    terminate(rest, original, skip + 1, stack, decode, value)
+    terminate(rest, original, skip skip - 1+ 1, stack, decode, value)
   end
   defp terminate(<<>>, _original, _skip, _stack, _decode, value) do
