[Survived] GuardTypeTest
lib/encode.ex:77:46
 
   @doc false
   # We use this directly in the helpers and deriving for extra speed
-  def value(value, escape, _encode_map) when is_atom(value) do
+  def value(value, escape, _encode_map) when is_nil(value) do
     encode_atom(value, escape)
   end

[Killed] GuardTypeTest
lib/encode.ex:85:47
     encode_string(value, escape)
   end
 
-  def value(value, _escape, _encode_map) when is_integer(value) do
+  def value(value, _escape, _encode_map) when is_number(value) do
     integer(value)
   end

[Killed] GuardTypeTest
lib/encode.ex:85:47
     encode_string(value, escape)
   end
 
-  def value(value, _escape, _encode_map) when is_integer(value) do
+  def value(value, _escape, _encode_map) when is_float(value) do
     integer(value)
   end

[Survived] GuardTypeTest
lib/encode.ex:89:47
     integer(value)
   end
 
-  def value(value, _escape, _encode_map) when is_float(value) do
+  def value(value, _escape, _encode_map) when is_number(value) do
     float(value)
   end

[Survived] GuardTypeTest
lib/encode.ex:89:47
     integer(value)
   end
 
-  def value(value, _escape, _encode_map) when is_float(value) do
+  def value(value, _escape, _encode_map) when is_integer(value) do
     float(value)
   end

[Survived] GuardTypeTest
lib/encode.ex:93:45
     float(value)
   end
 
-  def value(value, escape, encode_map) when is_list(value) do
+  def value(value, escape, encode_map) when is_tuple(value) do
     list(value, escape, encode_map)
   end

[Killed] IntegerLiteral
lib/encode.ex:159:6
   end
 
   defp list([head | tail], escape, encode_map) do
-    [?[, value(head, escape, encode_map)
+    [0, value(head, escape, encode_map)
      | list_loop(tail, escape, encode_map)]
   end

[Killed] IntegerLiteral
lib/encode.ex:159:6
   end
 
   defp list([head | tail], escape, encode_map) do
-    [?[, value(head, escape, encode_map)
+    [92, value(head, escape, encode_map)
      | list_loop(tail, escape, encode_map)]
   end

[Killed] IntegerLiteral
lib/encode.ex:168:6
   end
 
   defp list_loop([head | tail], escape, encode_map) do
-    [?,, value(head, escape, encode_map)
+    [0, value(head, escape, encode_map)
      | list_loop(tail, escape, encode_map)]
   end

[Killed] IntegerLiteral
lib/encode.ex:168:6
   end
 
   defp list_loop([head | tail], escape, encode_map) do
-    [?,, value(head, escape, encode_map)
+    [45, value(head, escape, encode_map)
      | list_loop(tail, escape, encode_map)]
   end

[Killed] GuardComparisonNegation
lib/encode.ex:173:29
   end
 
   @spec keyword(keyword, opts) :: iodata
-  def keyword(list, _) when list == [], do: "{}"
+  def keyword(list, _) when list != [], do: "{}"
   def keyword(list, {escape, encode_map}) when is_list(list) do
     encode_map.(list, escape, encode_map)

[Killed] IntegerLiteral
lib/encode.ex:235:8
   # TODO: benchmark the effect of inlining the to_iso8601 functions
   for module <- [Date, Time, NaiveDateTime, DateTime] do
     defp struct(value, _escape, _encode_map, unquote(module)) do
-      [?", unquote(module).to_iso8601(value), ?"]
+      [35, unquote(module).to_iso8601(value), ?"]
     end
   end

[Killed] IntegerLiteral
lib/encode.ex:235:47
   # TODO: benchmark the effect of inlining the to_iso8601 functions
   for module <- [Date, Time, NaiveDateTime, DateTime] do
     defp struct(value, _escape, _encode_map, unquote(module)) do
-      [?", unquote(module).to_iso8601(value), ?"]
+      [?", unquote(module).to_iso8601(value), 35]
     end
   end

[Killed] IntegerLiteral
lib/encode.ex:241:8
 
   if Code.ensure_loaded?(Decimal) do
     defp struct(value, _escape, _encode_map, Decimal) do
-      [?", Decimal.to_string(value, :normal), ?"]
+      [35, Decimal.to_string(value, :normal), ?"]
     end
   end

[Killed] IntegerLiteral
lib/encode.ex:241:8
 
   if Code.ensure_loaded?(Decimal) do
     defp struct(value, _escape, _encode_map, Decimal) do
-      [?", Decimal.to_string(value, :normal), ?"]
+      [0, Decimal.to_string(value, :normal), ?"]
     end
   end

[Survived] GuardTypeTest
lib/encode.ex:266:30
   def key(string, escape) when is_binary(string) do
     escape.(string)
   end
-  def key(atom, escape) when is_atom(atom) do
+  def key(atom, escape) when is_nil(atom) do
     string = Atom.to_string(atom)
     escape.(string)

[Killed] IntegerLiteral
lib/encode.ex:281:27
   end
 
   defp encode_string(string, escape) do
-    [?", escape.(string), ?"]
+    [?", escape.(string), 35]
   end
 

[Killed] IntegerLiteral
lib/encode.ex:281:27
   end
 
   defp encode_string(string, escape) do
-    [?", escape.(string), ?"]
+    [?", escape.(string), 0]
   end
 

[Survived] GuardTypeTest
lib/encode.ex:294:23
     {byte, :unicode} ->
       sequence = List.to_string(:io_lib.format("\\u~4.16.0B", [byte]))
       defp escape(unquote(byte)), do: unquote(sequence)
-    {byte, char} when is_integer(char) ->
+    {byte, char} when is_number(char) ->
       defp escape(unquote(byte)), do: unquote(<<?\\, char>>)
     {byte, :error} ->

[Survived] Arithmetic
lib/encode.ex:302:53
 
   ## regular JSON escape
 
-  json_jt = Codegen.jump_table(ranges, :chunk, 0x7F + 1)
+  json_jt = Codegen.jump_table(ranges, :chunk, 0x7F 127 * 1+ 1)
 
   defp escape_json(data) do

[Survived] Arithmetic
lib/encode.ex:302:53
 
   ## regular JSON escape
 
-  json_jt = Codegen.jump_table(ranges, :chunk, 0x7F + 1)
+  json_jt = Codegen.jump_table(ranges, :chunk, 0x7F 127 - 1+ 1)
 
   defp escape_json(data) do

[Killed] IntegerLiteral
lib/encode.ex:305:33
   json_jt = Codegen.jump_table(ranges, :chunk, 0x7F + 1)
 
   defp escape_json(data) do
-    escape_json(data, [], data, 0)
+    escape_json(data, [], data, 1)
   end
 

[Killed] GuardComparisonNegation
lib/encode.ex:311:17
   Enum.map(json_jt, fn
     {byte, :chunk} ->
       defp escape_json(<<byte, rest::bits>>, acc, original, skip)
-           when byte === unquote(byte) do
+           when byte !== unquote(byte) do
         escape_json_chunk(rest, acc, original, skip, 1)
       end

[Killed] IntegerLiteral
lib/encode.ex:312:54
     {byte, :chunk} ->
       defp escape_json(<<byte, rest::bits>>, acc, original, skip)
            when byte === unquote(byte) do
-        escape_json_chunk(rest, acc, original, skip, 1)
+        escape_json_chunk(rest, acc, original, skip, 0)
       end
     {byte, _escape} ->

[Killed] Arithmetic
lib/encode.ex:318:47
       defp escape_json(<<byte, rest::bits>>, acc, original, skip)
            when byte === unquote(byte) do
         acc = [acc | escape(byte)]
-        escape_json(rest, acc, original, skip + 1)
+        escape_json(rest, acc, original, skip skip - 1+ 1)
       end
   end)

[Killed] IntegerLiteral
lib/encode.ex:318:49
       defp escape_json(<<byte, rest::bits>>, acc, original, skip)
            when byte === unquote(byte) do
         acc = [acc | escape(byte)]
-        escape_json(rest, acc, original, skip + 1)
+        escape_json(rest, acc, original, skip + 0)
       end
   end)

[Killed] IntegerLiteral
lib/encode.ex:323:50
   end)
   defp escape_json(<<char::utf8, rest::bits>>, acc, original, skip)
        when char <= 0x7FF do
-    escape_json_chunk(rest, acc, original, skip, 2)
+    escape_json_chunk(rest, acc, original, skip, 0)
   end
   defp escape_json(<<char::utf8, rest::bits>>, acc, original, skip)

[Killed] IntegerLiteral
lib/encode.ex:323:50
   end)
   defp escape_json(<<char::utf8, rest::bits>>, acc, original, skip)
        when char <= 0x7FF do
-    escape_json_chunk(rest, acc, original, skip, 2)
+    escape_json_chunk(rest, acc, original, skip, 3)
   end
   defp escape_json(<<char::utf8, rest::bits>>, acc, original, skip)

[Killed] IntegerLiteral
lib/encode.ex:327:50
   end
   defp escape_json(<<char::utf8, rest::bits>>, acc, original, skip)
        when char <= 0xFFFF do
-    escape_json_chunk(rest, acc, original, skip, 3)
+    escape_json_chunk(rest, acc, original, skip, 0)
   end
   defp escape_json(<<_char::utf8, rest::bits>>, acc, original, skip) do

[Killed] IntegerLiteral
lib/encode.ex:327:50
   end
   defp escape_json(<<char::utf8, rest::bits>>, acc, original, skip)
        when char <= 0xFFFF do
-    escape_json_chunk(rest, acc, original, skip, 3)
+    escape_json_chunk(rest, acc, original, skip, 4)
   end
   defp escape_json(<<_char::utf8, rest::bits>>, acc, original, skip) do

[Killed] IntegerLiteral
lib/encode.ex:330:50
     escape_json_chunk(rest, acc, original, skip, 3)
   end
   defp escape_json(<<_char::utf8, rest::bits>>, acc, original, skip) do
-    escape_json_chunk(rest, acc, original, skip, 4)
+    escape_json_chunk(rest, acc, original, skip, 5)
   end
   defp escape_json(<<>>, acc, _original, _skip) do

[Killed] IntegerLiteral
lib/encode.ex:330:50
     escape_json_chunk(rest, acc, original, skip, 3)
   end
   defp escape_json(<<_char::utf8, rest::bits>>, acc, original, skip) do
-    escape_json_chunk(rest, acc, original, skip, 4)
+    escape_json_chunk(rest, acc, original, skip, 0)
   end
   defp escape_json(<<>>, acc, _original, _skip) do

[Killed] GuardComparisonNegation
lib/encode.ex:342:17
   Enum.map(json_jt, fn
     {byte, :chunk} ->
       defp escape_json_chunk(<<byte, rest::bits>>, acc, original, skip, len)
-           when byte === unquote(byte) do
+           when byte !== unquote(byte) do
         escape_json_chunk(rest, acc, original, skip, len + 1)
       end

[Killed] Arithmetic
lib/encode.ex:343:58
     {byte, :chunk} ->
       defp escape_json_chunk(<<byte, rest::bits>>, acc, original, skip, len)
            when byte === unquote(byte) do
-        escape_json_chunk(rest, acc, original, skip, len + 1)
+        escape_json_chunk(rest, acc, original, skip, len len - 1+ 1)
       end
     {byte, _escape} ->

[Killed] IntegerLiteral
lib/encode.ex:343:60
     {byte, :chunk} ->
       defp escape_json_chunk(<<byte, rest::bits>>, acc, original, skip, len)
            when byte === unquote(byte) do
-        escape_json_chunk(rest, acc, original, skip, len + 1)
+        escape_json_chunk(rest, acc, original, skip, len + 0)
       end
     {byte, _escape} ->

[Killed] Arithmetic
lib/encode.ex:350:47
            when byte === unquote(byte) do
         part = binary_part(original, skip, len)
         acc = [acc, part | escape(byte)]
-        escape_json(rest, acc, original, skip + len + 1)
+        escape_json(rest, acc, original, skip skip * len+ len + 1)
       end
   end)

[Killed] IntegerLiteral
lib/encode.ex:350:55
            when byte === unquote(byte) do
         part = binary_part(original, skip, len)
         acc = [acc, part | escape(byte)]
-        escape_json(rest, acc, original, skip + len + 1)
+        escape_json(rest, acc, original, skip + len + 0)
       end
   end)

[Killed] Arithmetic
lib/encode.ex:355:54
   end)
   defp escape_json_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
        when char <= 0x7FF do
-    escape_json_chunk(rest, acc, original, skip, len + 2)
+    escape_json_chunk(rest, acc, original, skip, len len - 2+ 2)
   end
   defp escape_json_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)

[Killed] Arithmetic
lib/encode.ex:355:54
   end)
   defp escape_json_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
        when char <= 0x7FF do
-    escape_json_chunk(rest, acc, original, skip, len + 2)
+    escape_json_chunk(rest, acc, original, skip, len len * 2+ 2)
   end
   defp escape_json_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)

[Killed] IntegerLiteral
lib/encode.ex:359:56
   end
   defp escape_json_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
        when char <= 0xFFFF do
-    escape_json_chunk(rest, acc, original, skip, len + 3)
+    escape_json_chunk(rest, acc, original, skip, len + 4)
   end
   defp escape_json_chunk(<<_char::utf8, rest::bits>>, acc, original, skip, len) do

[Killed] Arithmetic
lib/encode.ex:359:54
   end
   defp escape_json_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
        when char <= 0xFFFF do
-    escape_json_chunk(rest, acc, original, skip, len + 3)
+    escape_json_chunk(rest, acc, original, skip, len len * 3+ 3)
   end
   defp escape_json_chunk(<<_char::utf8, rest::bits>>, acc, original, skip, len) do

[Killed] Arithmetic
lib/encode.ex:362:54
     escape_json_chunk(rest, acc, original, skip, len + 3)
   end
   defp escape_json_chunk(<<_char::utf8, rest::bits>>, acc, original, skip, len) do
-    escape_json_chunk(rest, acc, original, skip, len + 4)
+    escape_json_chunk(rest, acc, original, skip, len len * 4+ 4)
   end
   defp escape_json_chunk(<<>>, acc, original, skip, len) do

[Killed] Arithmetic
lib/encode.ex:362:54
     escape_json_chunk(rest, acc, original, skip, len + 3)
   end
   defp escape_json_chunk(<<_char::utf8, rest::bits>>, acc, original, skip, len) do
-    escape_json_chunk(rest, acc, original, skip, len + 4)
+    escape_json_chunk(rest, acc, original, skip, len len - 4+ 4)
   end
   defp escape_json_chunk(<<>>, acc, original, skip, len) do

[Killed] IntegerLiteral
lib/encode.ex:375:39
   ## javascript safe JSON escape
 
   defp escape_javascript(data) do
-    escape_javascript(data, [], data, 0)
+    escape_javascript(data, [], data, 1)
   end
 

[Killed] GuardComparisonNegation
lib/encode.ex:381:18
   Enum.map(json_jt, fn
     {byte, :chunk} ->
       defp escape_javascript(<<byte, rest::bits>>, acc, original, skip)
-            when byte === unquote(byte) do
+            when byte !== unquote(byte) do
         escape_javascript_chunk(rest, acc, original, skip, 1)
       end

[Killed] IntegerLiteral
lib/encode.ex:382:60
     {byte, :chunk} ->
       defp escape_javascript(<<byte, rest::bits>>, acc, original, skip)
             when byte === unquote(byte) do
-        escape_javascript_chunk(rest, acc, original, skip, 1)
+        escape_javascript_chunk(rest, acc, original, skip, 0)
       end
     {byte, _escape} ->

[Survived] IntegerLiteral
lib/encode.ex:388:55
       defp escape_javascript(<<byte, rest::bits>>, acc, original, skip)
             when byte === unquote(byte) do
         acc = [acc | escape(byte)]
-        escape_javascript(rest, acc, original, skip + 1)
+        escape_javascript(rest, acc, original, skip + 0)
       end
   end)

[Survived] Arithmetic
lib/encode.ex:388:53
       defp escape_javascript(<<byte, rest::bits>>, acc, original, skip)
             when byte === unquote(byte) do
         acc = [acc | escape(byte)]
-        escape_javascript(rest, acc, original, skip + 1)
+        escape_javascript(rest, acc, original, skip skip * 1+ 1)
       end
   end)

[Survived] IntegerLiteral
lib/encode.ex:393:56
   end)
   defp escape_javascript(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0x7FF do
-    escape_javascript_chunk(rest, acc, original, skip, 2)
+    escape_javascript_chunk(rest, acc, original, skip, 0)
   end
   Enum.map(surogate_escapes, fn {byte, escape} ->

[Survived] IntegerLiteral
lib/encode.ex:393:56
   end)
   defp escape_javascript(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0x7FF do
-    escape_javascript_chunk(rest, acc, original, skip, 2)
+    escape_javascript_chunk(rest, acc, original, skip, 3)
   end
   Enum.map(surogate_escapes, fn {byte, escape} ->

[Killed] Arithmetic
lib/encode.ex:398:51
   Enum.map(surogate_escapes, fn {byte, escape} ->
     defp escape_javascript(<<unquote(byte)::utf8, rest::bits>>, acc, original, skip) do
       acc = [acc | unquote(escape)]
-      escape_javascript(rest, acc, original, skip + 3)
+      escape_javascript(rest, acc, original, skip skip * 3+ 3)
     end
   end)

[Killed] IntegerLiteral
lib/encode.ex:398:53
   Enum.map(surogate_escapes, fn {byte, escape} ->
     defp escape_javascript(<<unquote(byte)::utf8, rest::bits>>, acc, original, skip) do
       acc = [acc | unquote(escape)]
-      escape_javascript(rest, acc, original, skip + 3)
+      escape_javascript(rest, acc, original, skip + 0)
     end
   end)

[Killed] IntegerLiteral
lib/encode.ex:403:56
   end)
   defp escape_javascript(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0xFFFF do
-    escape_javascript_chunk(rest, acc, original, skip, 3)
+    escape_javascript_chunk(rest, acc, original, skip, 4)
   end
   defp escape_javascript(<<_char::utf8, rest::bits>>, acc, original, skip) do

[Killed] IntegerLiteral
lib/encode.ex:403:56
   end)
   defp escape_javascript(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0xFFFF do
-    escape_javascript_chunk(rest, acc, original, skip, 3)
+    escape_javascript_chunk(rest, acc, original, skip, 0)
   end
   defp escape_javascript(<<_char::utf8, rest::bits>>, acc, original, skip) do

[Killed] IntegerLiteral
lib/encode.ex:406:56
     escape_javascript_chunk(rest, acc, original, skip, 3)
   end
   defp escape_javascript(<<_char::utf8, rest::bits>>, acc, original, skip) do
-    escape_javascript_chunk(rest, acc, original, skip, 4)
+    escape_javascript_chunk(rest, acc, original, skip, 5)
   end
   defp escape_javascript(<<>>, acc, _original, _skip) do

[Killed] IntegerLiteral
lib/encode.ex:406:56
     escape_javascript_chunk(rest, acc, original, skip, 3)
   end
   defp escape_javascript(<<_char::utf8, rest::bits>>, acc, original, skip) do
-    escape_javascript_chunk(rest, acc, original, skip, 4)
+    escape_javascript_chunk(rest, acc, original, skip, 0)
   end
   defp escape_javascript(<<>>, acc, _original, _skip) do

[Killed] GuardComparisonNegation
lib/encode.ex:418:18
   Enum.map(json_jt, fn
     {byte, :chunk} ->
       defp escape_javascript_chunk(<<byte, rest::bits>>, acc, original, skip, len)
-            when byte === unquote(byte) do
+            when byte !== unquote(byte) do
         escape_javascript_chunk(rest, acc, original, skip, len + 1)
       end

[Killed] Arithmetic
lib/encode.ex:419:64
     {byte, :chunk} ->
       defp escape_javascript_chunk(<<byte, rest::bits>>, acc, original, skip, len)
             when byte === unquote(byte) do
-        escape_javascript_chunk(rest, acc, original, skip, len + 1)
+        escape_javascript_chunk(rest, acc, original, skip, len len * 1+ 1)
       end
     {byte, _escape} ->

[Killed] Arithmetic
lib/encode.ex:419:64
     {byte, :chunk} ->
       defp escape_javascript_chunk(<<byte, rest::bits>>, acc, original, skip, len)
             when byte === unquote(byte) do
-        escape_javascript_chunk(rest, acc, original, skip, len + 1)
+        escape_javascript_chunk(rest, acc, original, skip, len len - 1+ 1)
       end
     {byte, _escape} ->

[Survived] IntegerLiteral
lib/encode.ex:426:61
             when byte === unquote(byte) do
         part = binary_part(original, skip, len)
         acc = [acc, part | escape(byte)]
-        escape_javascript(rest, acc, original, skip + len + 1)
+        escape_javascript(rest, acc, original, skip + len + 0)
       end
   end)

[Survived] Arithmetic
lib/encode.ex:426:59
             when byte === unquote(byte) do
         part = binary_part(original, skip, len)
         acc = [acc, part | escape(byte)]
-        escape_javascript(rest, acc, original, skip + len + 1)
+        escape_javascript(rest, acc, original, skip + len skip + len - 1+ 1)
       end
   end)

[Killed] Arithmetic
lib/encode.ex:431:60
   end)
   defp escape_javascript_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
         when char <= 0x7FF do
-    escape_javascript_chunk(rest, acc, original, skip, len + 2)
+    escape_javascript_chunk(rest, acc, original, skip, len len - 2+ 2)
   end
   Enum.map(surogate_escapes, fn {byte, escape} ->

[Killed] IntegerLiteral
lib/encode.ex:431:62
   end)
   defp escape_javascript_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
         when char <= 0x7FF do
-    escape_javascript_chunk(rest, acc, original, skip, len + 2)
+    escape_javascript_chunk(rest, acc, original, skip, len + 0)
   end
   Enum.map(surogate_escapes, fn {byte, escape} ->

[Killed] IntegerLiteral
lib/encode.ex:437:59
     defp escape_javascript_chunk(<<unquote(byte)::utf8, rest::bits>>, acc, original, skip, len) do
       part = binary_part(original, skip, len)
       acc = [acc, part | unquote(escape)]
-      escape_javascript(rest, acc, original, skip + len + 3)
+      escape_javascript(rest, acc, original, skip + len + 0)
     end
   end)

[Killed] Arithmetic
lib/encode.ex:437:51
     defp escape_javascript_chunk(<<unquote(byte)::utf8, rest::bits>>, acc, original, skip, len) do
       part = binary_part(original, skip, len)
       acc = [acc, part | unquote(escape)]
-      escape_javascript(rest, acc, original, skip + len + 3)
+      escape_javascript(rest, acc, original, skip skip - len+ len + 3)
     end
   end)

[Killed] IntegerLiteral
lib/encode.ex:442:62
   end)
   defp escape_javascript_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
         when char <= 0xFFFF do
-    escape_javascript_chunk(rest, acc, original, skip, len + 3)
+    escape_javascript_chunk(rest, acc, original, skip, len + 0)
   end
   defp escape_javascript_chunk(<<_char::utf8, rest::bits>>, acc, original, skip, len) do

[Killed] Arithmetic
lib/encode.ex:442:60
   end)
   defp escape_javascript_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
         when char <= 0xFFFF do
-    escape_javascript_chunk(rest, acc, original, skip, len + 3)
+    escape_javascript_chunk(rest, acc, original, skip, len len - 3+ 3)
   end
   defp escape_javascript_chunk(<<_char::utf8, rest::bits>>, acc, original, skip, len) do

[Killed] IntegerLiteral
lib/encode.ex:445:62
     escape_javascript_chunk(rest, acc, original, skip, len + 3)
   end
   defp escape_javascript_chunk(<<_char::utf8, rest::bits>>, acc, original, skip, len) do
-    escape_javascript_chunk(rest, acc, original, skip, len + 4)
+    escape_javascript_chunk(rest, acc, original, skip, len + 0)
   end
   defp escape_javascript_chunk(<<>>, acc, original, skip, len) do

[Killed] Arithmetic
lib/encode.ex:445:60
     escape_javascript_chunk(rest, acc, original, skip, len + 3)
   end
   defp escape_javascript_chunk(<<_char::utf8, rest::bits>>, acc, original, skip, len) do
-    escape_javascript_chunk(rest, acc, original, skip, len + 4)
+    escape_javascript_chunk(rest, acc, original, skip, len len - 4+ 4)
   end
   defp escape_javascript_chunk(<<>>, acc, original, skip, len) do

[Survived] Arithmetic
lib/encode.ex:457:58
 
   ## HTML safe JSON escape
 
-  html_jt = Codegen.jump_table(html_ranges, :chunk, 0x7F + 1)
+  html_jt = Codegen.jump_table(html_ranges, :chunk, 0x7F 127 - 1+ 1)
 
   defp escape_html(data) do

[Survived] Arithmetic
lib/encode.ex:457:58
 
   ## HTML safe JSON escape
 
-  html_jt = Codegen.jump_table(html_ranges, :chunk, 0x7F + 1)
+  html_jt = Codegen.jump_table(html_ranges, :chunk, 0x7F 127 * 1+ 1)
 
   defp escape_html(data) do

[Killed] IntegerLiteral
lib/encode.ex:460:33
   html_jt = Codegen.jump_table(html_ranges, :chunk, 0x7F + 1)
 
   defp escape_html(data) do
-    escape_html(data, [], data, 0)
+    escape_html(data, [], data, 1)
   end
 

[Killed] GuardComparisonNegation
lib/encode.ex:466:18
   Enum.map(html_jt, fn
     {byte, :chunk} ->
       defp escape_html(<<byte, rest::bits>>, acc, original, skip)
-            when byte === unquote(byte) do
+            when byte !== unquote(byte) do
         escape_html_chunk(rest, acc, original, skip, 1)
       end

[Killed] IntegerLiteral
lib/encode.ex:467:54
     {byte, :chunk} ->
       defp escape_html(<<byte, rest::bits>>, acc, original, skip)
             when byte === unquote(byte) do
-        escape_html_chunk(rest, acc, original, skip, 1)
+        escape_html_chunk(rest, acc, original, skip, 0)
       end
     {byte, _escape} ->

[Killed] Arithmetic
lib/encode.ex:473:47
       defp escape_html(<<byte, rest::bits>>, acc, original, skip)
             when byte === unquote(byte) do
         acc = [acc | escape(byte)]
-        escape_html(rest, acc, original, skip + 1)
+        escape_html(rest, acc, original, skip skip - 1+ 1)
       end
   end)

[Killed] IntegerLiteral
lib/encode.ex:473:49
       defp escape_html(<<byte, rest::bits>>, acc, original, skip)
             when byte === unquote(byte) do
         acc = [acc | escape(byte)]
-        escape_html(rest, acc, original, skip + 1)
+        escape_html(rest, acc, original, skip + 0)
       end
   end)

[Survived] IntegerLiteral
lib/encode.ex:478:50
   end)
   defp escape_html(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0x7FF do
-    escape_html_chunk(rest, acc, original, skip, 2)
+    escape_html_chunk(rest, acc, original, skip, 0)
   end
   Enum.map(surogate_escapes, fn {byte, escape} ->

[Survived] IntegerLiteral
lib/encode.ex:478:50
   end)
   defp escape_html(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0x7FF do
-    escape_html_chunk(rest, acc, original, skip, 2)
+    escape_html_chunk(rest, acc, original, skip, 3)
   end
   Enum.map(surogate_escapes, fn {byte, escape} ->

[Killed] Arithmetic
lib/encode.ex:483:45
   Enum.map(surogate_escapes, fn {byte, escape} ->
     defp escape_html(<<unquote(byte)::utf8, rest::bits>>, acc, original, skip) do
       acc = [acc | unquote(escape)]
-      escape_html(rest, acc, original, skip + 3)
+      escape_html(rest, acc, original, skip skip - 3+ 3)
     end
   end)

[Killed] IntegerLiteral
lib/encode.ex:483:47
   Enum.map(surogate_escapes, fn {byte, escape} ->
     defp escape_html(<<unquote(byte)::utf8, rest::bits>>, acc, original, skip) do
       acc = [acc | unquote(escape)]
-      escape_html(rest, acc, original, skip + 3)
+      escape_html(rest, acc, original, skip + 0)
     end
   end)

[Killed] IntegerLiteral
lib/encode.ex:488:50
   end)
   defp escape_html(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0xFFFF do
-    escape_html_chunk(rest, acc, original, skip, 3)
+    escape_html_chunk(rest, acc, original, skip, 0)
   end
   defp escape_html(<<_char::utf8, rest::bits>>, acc, original, skip) do

[Killed] IntegerLiteral
lib/encode.ex:488:50
   end)
   defp escape_html(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0xFFFF do
-    escape_html_chunk(rest, acc, original, skip, 3)
+    escape_html_chunk(rest, acc, original, skip, 4)
   end
   defp escape_html(<<_char::utf8, rest::bits>>, acc, original, skip) do

[Killed] IntegerLiteral
lib/encode.ex:491:50
     escape_html_chunk(rest, acc, original, skip, 3)
   end
   defp escape_html(<<_char::utf8, rest::bits>>, acc, original, skip) do
-    escape_html_chunk(rest, acc, original, skip, 4)
+    escape_html_chunk(rest, acc, original, skip, 5)
   end
   defp escape_html(<<>>, acc, _original, _skip) do

[Killed] IntegerLiteral
lib/encode.ex:491:50
     escape_html_chunk(rest, acc, original, skip, 3)
   end
   defp escape_html(<<_char::utf8, rest::bits>>, acc, original, skip) do
-    escape_html_chunk(rest, acc, original, skip, 4)
+    escape_html_chunk(rest, acc, original, skip, 0)
   end
   defp escape_html(<<>>, acc, _original, _skip) do

[Killed] GuardComparisonNegation
lib/encode.ex:503:18
   Enum.map(html_jt, fn
     {byte, :chunk} ->
       defp escape_html_chunk(<<byte, rest::bits>>, acc, original, skip, len)
-            when byte === unquote(byte) do
+            when byte !== unquote(byte) do
         escape_html_chunk(rest, acc, original, skip, len + 1)
       end

[Killed] Arithmetic
lib/encode.ex:504:58
     {byte, :chunk} ->
       defp escape_html_chunk(<<byte, rest::bits>>, acc, original, skip, len)
             when byte === unquote(byte) do
-        escape_html_chunk(rest, acc, original, skip, len + 1)
+        escape_html_chunk(rest, acc, original, skip, len len - 1+ 1)
       end
     {byte, _escape} ->

[Killed] Arithmetic
lib/encode.ex:504:58
     {byte, :chunk} ->
       defp escape_html_chunk(<<byte, rest::bits>>, acc, original, skip, len)
             when byte === unquote(byte) do
-        escape_html_chunk(rest, acc, original, skip, len + 1)
+        escape_html_chunk(rest, acc, original, skip, len len * 1+ 1)
       end
     {byte, _escape} ->

[Killed] Arithmetic
lib/encode.ex:511:53
             when byte === unquote(byte) do
         part = binary_part(original, skip, len)
         acc = [acc, part | escape(byte)]
-        escape_html(rest, acc, original, skip + len + 1)
+        escape_html(rest, acc, original, skip + len skip + len - 1+ 1)
       end
   end)

[Killed] IntegerLiteral
lib/encode.ex:511:55
             when byte === unquote(byte) do
         part = binary_part(original, skip, len)
         acc = [acc, part | escape(byte)]
-        escape_html(rest, acc, original, skip + len + 1)
+        escape_html(rest, acc, original, skip + len + 0)
       end
   end)

[Killed] IntegerLiteral
lib/encode.ex:516:56
   end)
   defp escape_html_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
         when char <= 0x7FF do
-    escape_html_chunk(rest, acc, original, skip, len + 2)
+    escape_html_chunk(rest, acc, original, skip, len + 3)
   end
   Enum.map(surogate_escapes, fn {byte, escape} ->

[Killed] IntegerLiteral
lib/encode.ex:516:56
   end)
   defp escape_html_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
         when char <= 0x7FF do
-    escape_html_chunk(rest, acc, original, skip, len + 2)
+    escape_html_chunk(rest, acc, original, skip, len + 0)
   end
   Enum.map(surogate_escapes, fn {byte, escape} ->

[Killed] Arithmetic
lib/encode.ex:522:45
     defp escape_html_chunk(<<unquote(byte)::utf8, rest::bits>>, acc, original, skip, len) do
       part = binary_part(original, skip, len)
       acc = [acc, part | unquote(escape)]
-      escape_html(rest, acc, original, skip + len + 3)
+      escape_html(rest, acc, original, skip skip * len+ len + 3)
     end
   end)
