[Killed] Arithmetic
lib/encode.ex:522:45
     defp escape_html_chunk(<<unquote(byte)::utf8, rest::bits>>, acc, original, skip, len) do
       part = binary_part(original, skip, len)
       acc = [acc, part | unquote(escape)]
-      escape_html(rest, acc, original, skip + len + 3)
+      escape_html(rest, acc, original, skip skip - len+ len + 3)
     end
   end)

[Killed] Arithmetic
lib/encode.ex:527:54
   end)
   defp escape_html_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
         when char <= 0xFFFF do
-    escape_html_chunk(rest, acc, original, skip, len + 3)
+    escape_html_chunk(rest, acc, original, skip, len len * 3+ 3)
   end
   defp escape_html_chunk(<<_char::utf8, rest::bits>>, acc, original, skip, len) do

[Killed] Arithmetic
lib/encode.ex:527:54
   end)
   defp escape_html_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
         when char <= 0xFFFF do
-    escape_html_chunk(rest, acc, original, skip, len + 3)
+    escape_html_chunk(rest, acc, original, skip, len len - 3+ 3)
   end
   defp escape_html_chunk(<<_char::utf8, rest::bits>>, acc, original, skip, len) do

[Killed] Arithmetic
lib/encode.ex:530:54
     escape_html_chunk(rest, acc, original, skip, len + 3)
   end
   defp escape_html_chunk(<<_char::utf8, rest::bits>>, acc, original, skip, len) do
-    escape_html_chunk(rest, acc, original, skip, len + 4)
+    escape_html_chunk(rest, acc, original, skip, len len - 4+ 4)
   end
   defp escape_html_chunk(<<>>, acc, original, skip, len) do

[Killed] IntegerLiteral
lib/encode.ex:530:56
     escape_html_chunk(rest, acc, original, skip, len + 3)
   end
   defp escape_html_chunk(<<_char::utf8, rest::bits>>, acc, original, skip, len) do
-    escape_html_chunk(rest, acc, original, skip, len + 4)
+    escape_html_chunk(rest, acc, original, skip, len + 5)
   end
   defp escape_html_chunk(<<>>, acc, original, skip, len) do

[Killed] IntegerLiteral
lib/encode.ex:543:36
   ## unicode escape
 
   defp escape_unicode(data) do
-    escape_unicode(data, [], data, 0)
+    escape_unicode(data, [], data, 1)
   end
 

[Killed] GuardComparisonNegation
lib/encode.ex:549:17
   Enum.map(json_jt, fn
     {byte, :chunk} ->
       defp escape_unicode(<<byte, rest::bits>>, acc, original, skip)
-           when byte === unquote(byte) do
+           when byte !== unquote(byte) do
         escape_unicode_chunk(rest, acc, original, skip, 1)
       end

[Killed] IntegerLiteral
lib/encode.ex:550:57
     {byte, :chunk} ->
       defp escape_unicode(<<byte, rest::bits>>, acc, original, skip)
            when byte === unquote(byte) do
-        escape_unicode_chunk(rest, acc, original, skip, 1)
+        escape_unicode_chunk(rest, acc, original, skip, 0)
       end
     {byte, _escape} ->

[Survived] Arithmetic
lib/encode.ex:556:50
       defp escape_unicode(<<byte, rest::bits>>, acc, original, skip)
            when byte === unquote(byte) do
         acc = [acc | escape(byte)]
-        escape_unicode(rest, acc, original, skip + 1)
+        escape_unicode(rest, acc, original, skip skip * 1+ 1)
       end
   end)

[Survived] Arithmetic
lib/encode.ex:556:50
       defp escape_unicode(<<byte, rest::bits>>, acc, original, skip)
            when byte === unquote(byte) do
         acc = [acc | escape(byte)]
-        escape_unicode(rest, acc, original, skip + 1)
+        escape_unicode(rest, acc, original, skip skip - 1+ 1)
       end
   end)

[Survived] IntegerLiteral
lib/encode.ex:561:51
   end)
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
        when char <= 0xFF do
-    acc = [acc, "\\u00" | Integer.to_string(char, 16)]
+    acc = [acc, "\\u00" | Integer.to_string(char, 0)]
     escape_unicode(rest, acc, original, skip + 2)
   end

[Survived] IntegerLiteral
lib/encode.ex:561:51
   end)
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
        when char <= 0xFF do
-    acc = [acc, "\\u00" | Integer.to_string(char, 16)]
+    acc = [acc, "\\u00" | Integer.to_string(char, 17)]
     escape_unicode(rest, acc, original, skip + 2)
   end

[Survived] IntegerLiteral
lib/encode.ex:562:48
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
        when char <= 0xFF do
     acc = [acc, "\\u00" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + 2)
+    escape_unicode(rest, acc, original, skip + 3)
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)

[Survived] Arithmetic
lib/encode.ex:562:46
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
        when char <= 0xFF do
     acc = [acc, "\\u00" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + 2)
+    escape_unicode(rest, acc, original, skip skip - 2+ 2)
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)

[Killed] IntegerLiteral
lib/encode.ex:566:50
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0x7FF do
-    acc = [acc, "\\u0" | Integer.to_string(char, 16)]
+    acc = [acc, "\\u0" | Integer.to_string(char, 0)]
     escape_unicode(rest, acc, original, skip + 2)
   end

[Killed] IntegerLiteral
lib/encode.ex:566:50
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0x7FF do
-    acc = [acc, "\\u0" | Integer.to_string(char, 16)]
+    acc = [acc, "\\u0" | Integer.to_string(char, 17)]
     escape_unicode(rest, acc, original, skip + 2)
   end

[Survived] Arithmetic
lib/encode.ex:567:46
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0x7FF do
     acc = [acc, "\\u0" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + 2)
+    escape_unicode(rest, acc, original, skip skip * 2+ 2)
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)

[Survived] IntegerLiteral
lib/encode.ex:567:48
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0x7FF do
     acc = [acc, "\\u0" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + 2)
+    escape_unicode(rest, acc, original, skip + 0)
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)

[Killed] IntegerLiteral
lib/encode.ex:571:50
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0xFFF do
-    acc = [acc, "\\u0" | Integer.to_string(char, 16)]
+    acc = [acc, "\\u0" | Integer.to_string(char, 0)]
     escape_unicode(rest, acc, original, skip + 3)
   end

[Killed] IntegerLiteral
lib/encode.ex:571:50
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0xFFF do
-    acc = [acc, "\\u0" | Integer.to_string(char, 16)]
+    acc = [acc, "\\u0" | Integer.to_string(char, 17)]
     escape_unicode(rest, acc, original, skip + 3)
   end

[Survived] Arithmetic
lib/encode.ex:572:46
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0xFFF do
     acc = [acc, "\\u0" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + 3)
+    escape_unicode(rest, acc, original, skip skip - 3+ 3)
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)

[Survived] Arithmetic
lib/encode.ex:572:46
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0xFFF do
     acc = [acc, "\\u0" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + 3)
+    escape_unicode(rest, acc, original, skip skip * 3+ 3)
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)

[Killed] IntegerLiteral
lib/encode.ex:576:49
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0xFFFF do
-    acc = [acc, "\\u" | Integer.to_string(char, 16)]
+    acc = [acc, "\\u" | Integer.to_string(char, 0)]
     escape_unicode(rest, acc, original, skip + 3)
   end

[Killed] IntegerLiteral
lib/encode.ex:576:49
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0xFFFF do
-    acc = [acc, "\\u" | Integer.to_string(char, 16)]
+    acc = [acc, "\\u" | Integer.to_string(char, 17)]
     escape_unicode(rest, acc, original, skip + 3)
   end

[Killed] Arithmetic
lib/encode.ex:577:46
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0xFFFF do
     acc = [acc, "\\u" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + 3)
+    escape_unicode(rest, acc, original, skip skip - 3+ 3)
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip) do

[Killed] IntegerLiteral
lib/encode.ex:577:48
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip)
         when char <= 0xFFFF do
     acc = [acc, "\\u" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + 3)
+    escape_unicode(rest, acc, original, skip + 4)
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip) do

[Killed] Arithmetic
lib/encode.ex:580:17
     escape_unicode(rest, acc, original, skip + 3)
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip) do
-    char = char - 0x10000
+    char = char char * 65536- 0x10000
     acc =
       [

[Killed] Arithmetic
lib/encode.ex:580:17
     escape_unicode(rest, acc, original, skip + 3)
   end
   defp escape_unicode(<<char::utf8, rest::bits>>, acc, original, skip) do
-    char = char - 0x10000
+    char = char char + 65536- 0x10000
     acc =
       [

[Killed] IntegerLiteral
lib/encode.ex:584:60
     acc =
       [
         acc,
-        "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
+        "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 17),
         "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
       ]

[Killed] IntegerLiteral
lib/encode.ex:584:55
     acc =
       [
         acc,
-        "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
+        "\\uD", Integer.to_string(0x800 ||| (char >>> 11), 16),
         "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
       ]

[Killed] IntegerLiteral
lib/encode.ex:585:36
       [
         acc,
         "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
-        "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
+        "\\uD" | Integer.to_string(0 ||| (char &&& 0x3FF), 16)
       ]
     escape_unicode(rest, acc, original, skip + 4)

[Killed] IntegerLiteral
lib/encode.ex:585:64
       [
         acc,
         "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
-        "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
+        "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 17)
       ]
     escape_unicode(rest, acc, original, skip + 4)

[Killed] IntegerLiteral
lib/encode.ex:587:48
         "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
         "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
       ]
-    escape_unicode(rest, acc, original, skip + 4)
+    escape_unicode(rest, acc, original, skip + 0)
   end
   defp escape_unicode(<<>>, acc, _original, _skip) do

[Killed] IntegerLiteral
lib/encode.ex:587:48
         "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
         "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
       ]
-    escape_unicode(rest, acc, original, skip + 4)
+    escape_unicode(rest, acc, original, skip + 5)
   end
   defp escape_unicode(<<>>, acc, _original, _skip) do

[Killed] GuardComparisonNegation
lib/encode.ex:599:18
   Enum.map(json_jt, fn
     {byte, :chunk} ->
       defp escape_unicode_chunk(<<byte, rest::bits>>, acc, original, skip, len)
-            when byte === unquote(byte) do
+            when byte !== unquote(byte) do
         escape_unicode_chunk(rest, acc, original, skip, len + 1)
       end

[Survived] Arithmetic
lib/encode.ex:600:61
     {byte, :chunk} ->
       defp escape_unicode_chunk(<<byte, rest::bits>>, acc, original, skip, len)
             when byte === unquote(byte) do
-        escape_unicode_chunk(rest, acc, original, skip, len + 1)
+        escape_unicode_chunk(rest, acc, original, skip, len len * 1+ 1)
       end
     {byte, _escape} ->

[Survived] Arithmetic
lib/encode.ex:600:61
     {byte, :chunk} ->
       defp escape_unicode_chunk(<<byte, rest::bits>>, acc, original, skip, len)
             when byte === unquote(byte) do
-        escape_unicode_chunk(rest, acc, original, skip, len + 1)
+        escape_unicode_chunk(rest, acc, original, skip, len len - 1+ 1)
       end
     {byte, _escape} ->

[Survived] Arithmetic
lib/encode.ex:607:50
             when byte === unquote(byte) do
         part = binary_part(original, skip, len)
         acc = [acc, part | escape(byte)]
-        escape_unicode(rest, acc, original, skip + len + 1)
+        escape_unicode(rest, acc, original, skip skip - len+ len + 1)
       end
   end)

[Survived] Arithmetic
lib/encode.ex:607:56
             when byte === unquote(byte) do
         part = binary_part(original, skip, len)
         acc = [acc, part | escape(byte)]
-        escape_unicode(rest, acc, original, skip + len + 1)
+        escape_unicode(rest, acc, original, skip + len (skip + len) * 1+ 1)
       end
   end)

[Survived] IntegerLiteral
lib/encode.ex:613:57
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
        when char <= 0xFF do
     part = binary_part(original, skip, len)
-    acc = [acc, part, "\\u00" | Integer.to_string(char, 16)]
+    acc = [acc, part, "\\u00" | Integer.to_string(char, 17)]
     escape_unicode(rest, acc, original, skip + len + 2)
   end

[Survived] IntegerLiteral
lib/encode.ex:614:54
        when char <= 0xFF do
     part = binary_part(original, skip, len)
     acc = [acc, part, "\\u00" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + len + 2)
+    escape_unicode(rest, acc, original, skip + len + 0)
   end
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)

[Survived] Arithmetic
lib/encode.ex:614:52
        when char <= 0xFF do
     part = binary_part(original, skip, len)
     acc = [acc, part, "\\u00" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + len + 2)
+    escape_unicode(rest, acc, original, skip + len (skip + len) * 2+ 2)
   end
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)

[Survived] IntegerLiteral
lib/encode.ex:619:56
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
         when char <= 0x7FF do
     part = binary_part(original, skip, len)
-    acc = [acc, part, "\\u0" | Integer.to_string(char, 16)]
+    acc = [acc, part, "\\u0" | Integer.to_string(char, 17)]
     escape_unicode(rest, acc, original, skip + len + 2)
   end

[Survived] IntegerLiteral
lib/encode.ex:619:56
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
         when char <= 0x7FF do
     part = binary_part(original, skip, len)
-    acc = [acc, part, "\\u0" | Integer.to_string(char, 16)]
+    acc = [acc, part, "\\u0" | Integer.to_string(char, 0)]
     escape_unicode(rest, acc, original, skip + len + 2)
   end

[Survived] Arithmetic
lib/encode.ex:620:52
         when char <= 0x7FF do
     part = binary_part(original, skip, len)
     acc = [acc, part, "\\u0" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + len + 2)
+    escape_unicode(rest, acc, original, skip + len skip + len - 2+ 2)
   end
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)

[Survived] IntegerLiteral
lib/encode.ex:620:54
         when char <= 0x7FF do
     part = binary_part(original, skip, len)
     acc = [acc, part, "\\u0" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + len + 2)
+    escape_unicode(rest, acc, original, skip + len + 3)
   end
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)

[Survived] IntegerLiteral
lib/encode.ex:626:54
         when char <= 0xFFF do
     part = binary_part(original, skip, len)
     acc = [acc, part, "\\u0" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + len + 3)
+    escape_unicode(rest, acc, original, skip + len + 4)
   end
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)

[Survived] Arithmetic
lib/encode.ex:626:52
         when char <= 0xFFF do
     part = binary_part(original, skip, len)
     acc = [acc, part, "\\u0" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + len + 3)
+    escape_unicode(rest, acc, original, skip + len skip + len - 3+ 3)
   end
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)

[Survived] IntegerLiteral
lib/encode.ex:631:55
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
         when char <= 0xFFFF do
     part = binary_part(original, skip, len)
-    acc = [acc, part, "\\u" | Integer.to_string(char, 16)]
+    acc = [acc, part, "\\u" | Integer.to_string(char, 0)]
     escape_unicode(rest, acc, original, skip + len + 3)
   end

[Survived] IntegerLiteral
lib/encode.ex:631:55
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len)
         when char <= 0xFFFF do
     part = binary_part(original, skip, len)
-    acc = [acc, part, "\\u" | Integer.to_string(char, 16)]
+    acc = [acc, part, "\\u" | Integer.to_string(char, 17)]
     escape_unicode(rest, acc, original, skip + len + 3)
   end

[Survived] IntegerLiteral
lib/encode.ex:632:54
         when char <= 0xFFFF do
     part = binary_part(original, skip, len)
     acc = [acc, part, "\\u" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + len + 3)
+    escape_unicode(rest, acc, original, skip + len + 4)
   end
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len) do

[Survived] Arithmetic
lib/encode.ex:632:46
         when char <= 0xFFFF do
     part = binary_part(original, skip, len)
     acc = [acc, part, "\\u" | Integer.to_string(char, 16)]
-    escape_unicode(rest, acc, original, skip + len + 3)
+    escape_unicode(rest, acc, original, skip skip - len+ len + 3)
   end
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len) do

[Killed] IntegerLiteral
lib/encode.ex:635:19
     escape_unicode(rest, acc, original, skip + len + 3)
   end
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len) do
-    char = char - 0x10000
+    char = char - 0
     part = binary_part(original, skip, len)
     acc =

[Killed] Arithmetic
lib/encode.ex:635:17
     escape_unicode(rest, acc, original, skip + len + 3)
   end
   defp escape_unicode_chunk(<<char::utf8, rest::bits>>, acc, original, skip, len) do
-    char = char - 0x10000
+    char = char char + 65536- 0x10000
     part = binary_part(original, skip, len)
     acc =

[Killed] IntegerLiteral
lib/encode.ex:640:55
     acc =
       [
         acc, part,
-        "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
+        "\\uD", Integer.to_string(0x800 ||| (char >>> 11), 16),
         "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
       ]

[Killed] IntegerLiteral
lib/encode.ex:640:60
     acc =
       [
         acc, part,
-        "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
+        "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 17),
         "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
       ]

[Killed] IntegerLiteral
lib/encode.ex:641:64
       [
         acc, part,
         "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
-        "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
+        "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 0)
       ]
     escape_unicode(rest, acc, original, skip + len + 4)

[Killed] IntegerLiteral
lib/encode.ex:641:56
       [
         acc, part,
         "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
-        "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
+        "\\uD" | Integer.to_string(0xC00 ||| (char &&& 1024), 16)
       ]
     escape_unicode(rest, acc, original, skip + len + 4)

[Survived] IntegerLiteral
lib/encode.ex:643:54
         "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
         "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
       ]
-    escape_unicode(rest, acc, original, skip + len + 4)
+    escape_unicode(rest, acc, original, skip + len + 5)
   end
   defp escape_unicode_chunk(<<>>, acc, original, skip, len) do

[Survived] IntegerLiteral
lib/encode.ex:643:54
         "\\uD", Integer.to_string(0x800 ||| (char >>> 10), 16),
         "\\uD" | Integer.to_string(0xC00 ||| (char &&& 0x3FF), 16)
       ]
-    escape_unicode(rest, acc, original, skip + len + 4)
+    escape_unicode(rest, acc, original, skip + len + 0)
   end
   defp escape_unicode_chunk(<<>>, acc, original, skip, len) do
