[Survived] BooleanLiteral
lib/encoder.ex:99:23
 
   # The same as Macro.var/2 except it sets generated: true and handles _ key
   defp generated_var(:_) do
-    {:__, [generated: true], __MODULE__.Underscore}
+    {:__, [generated: false], __MODULE__.Underscore}
   end
   defp generated_var(name) do

[Survived] BooleanLiteral
lib/encoder.ex:102:24
     {:__, [generated: true], __MODULE__.Underscore}
   end
   defp generated_var(name) do
-    {name, [generated: true], __MODULE__}
+    {name, [generated: false], __MODULE__}
   end
 

[Survived] BooleanLiteral
lib/encoder.ex:168:7
 
         end
 
-      true ->
+      false ->
         fields -- [:__struct__]
     end

[Survived] IntegerLiteral
lib/encoder.ex:223:6
 
 defimpl Jason.Encoder, for: [Date, Time, NaiveDateTime, DateTime] do
   def encode(value, _opts) do
-    [?", @for.to_iso8601(value), ?"]
+    [0, @for.to_iso8601(value), ?"]
   end
 end

[Survived] IntegerLiteral
lib/encoder.ex:223:34
 
 defimpl Jason.Encoder, for: [Date, Time, NaiveDateTime, DateTime] do
   def encode(value, _opts) do
-    [?", @for.to_iso8601(value), ?"]
+    [?", @for.to_iso8601(value), 35]
   end
 end

[Survived] IntegerLiteral
lib/encoder.ex:230:38
 if Code.ensure_loaded?(Decimal) do
   defimpl Jason.Encoder, for: Decimal do
     def encode(value, _opts) do
-      [?", Decimal.to_string(value), ?"]
+      [?", Decimal.to_string(value), 0]
     end
   end

[Survived] IntegerLiteral
lib/encoder.ex:230:8
 if Code.ensure_loaded?(Decimal) do
   defimpl Jason.Encoder, for: Decimal do
     def encode(value, _opts) do
-      [?", Decimal.to_string(value), ?"]
+      [0, Decimal.to_string(value), ?"]
     end
   end
