[Killed] BooleanLiteral
lib/formatter.ex:71:13
     opts = parse_opts(opts, "  ", "\n", nil, " ")
 
     depth = :first
-    empty = false
+    empty = true
 
     {output, _state} = pp_iodata(input, [], depth, empty, opts)

[Survived] Boolean
lib/formatter.ex:130:65
       :indent -> parse_opts(opts, value, line, record, colon)
       :record_separator -> parse_opts(opts, indent, line, value, colon)
       :after_colon -> parse_opts(opts, indent, line, record, value)
-      :line_separator -> parse_opts(opts, indent, value, record || value, colon)
+      :line_separator -> parse_opts(opts, indent, value, record record && value|| value, colon)
     end
   end

[Killed] Boolean
lib/formatter.ex:135:53
   end
 
   defp parse_opts([], indent, line, record, colon) do
-    opts(indent: indent, line: line, record: record || line, colon: colon)
+    opts(indent: indent, line: line, record: record record && line|| line, colon: colon)
   end
 

[Killed] GuardTypeTest
lib/formatter.ex:157:70
     {output_acc, &pp_iodata(&1, &2, depth, empty, opts)}
   end
 
-  defp pp_iodata([byte | rest], output_acc, depth, empty, opts) when is_integer(byte) do
+  defp pp_iodata([byte | rest], output_acc, depth, empty, opts) when is_float(byte) do
     pp_byte(byte, rest, output_acc, depth, empty, opts)
   end

[Survived] GuardTypeTest
lib/formatter.ex:157:70
     {output_acc, &pp_iodata(&1, &2, depth, empty, opts)}
   end
 
-  defp pp_iodata([byte | rest], output_acc, depth, empty, opts) when is_integer(byte) do
+  defp pp_iodata([byte | rest], output_acc, depth, empty, opts) when is_number(byte) do
     pp_byte(byte, rest, output_acc, depth, empty, opts)
   end

[Killed] IntegerLiteral
lib/formatter.ex:173:35
   defp pp_byte(byte, rest, output, depth, empty, opts) when byte in ~c'{[' do
     {out, depth} =
       cond do
-        depth == :first -> {byte, 1}
+        depth == :first -> {byte, 0}
         depth == 0 -> {[opts(opts, :record), byte], 1}
         empty -> {[opts(opts, :line), tab(opts(opts, :indent), depth), byte], depth + 1}

[Killed] ComparisonNegation
lib/formatter.ex:173:15
   defp pp_byte(byte, rest, output, depth, empty, opts) when byte in ~c'{[' do
     {out, depth} =
       cond do
-        depth == :first -> {byte, 1}
+        depth depth != :first== :first -> {byte, 1}
         depth == 0 -> {[opts(opts, :record), byte], 1}
         empty -> {[opts(opts, :line), tab(opts(opts, :indent), depth), byte], depth + 1}

[Killed] ComparisonNegation
lib/formatter.ex:174:15
     {out, depth} =
       cond do
         depth == :first -> {byte, 1}
-        depth == 0 -> {[opts(opts, :record), byte], 1}
+        depth depth != 0== 0 -> {[opts(opts, :record), byte], 1}
         empty -> {[opts(opts, :line), tab(opts(opts, :indent), depth), byte], depth + 1}
         true -> {byte, depth + 1}

[Killed] IntegerLiteral
lib/formatter.ex:174:18
     {out, depth} =
       cond do
         depth == :first -> {byte, 1}
-        depth == 0 -> {[opts(opts, :record), byte], 1}
+        depth == 1 -> {[opts(opts, :record), byte], 1}
         empty -> {[opts(opts, :line), tab(opts(opts, :indent), depth), byte], depth + 1}
         true -> {byte, depth + 1}

[Killed] Arithmetic
lib/formatter.ex:175:85
       cond do
         depth == :first -> {byte, 1}
         depth == 0 -> {[opts(opts, :record), byte], 1}
-        empty -> {[opts(opts, :line), tab(opts(opts, :indent), depth), byte], depth + 1}
+        empty -> {[opts(opts, :line), tab(opts(opts, :indent), depth), byte], depth depth - 1+ 1}
         true -> {byte, depth + 1}
       end

[Killed] IntegerLiteral
lib/formatter.ex:175:87
       cond do
         depth == :first -> {byte, 1}
         depth == 0 -> {[opts(opts, :record), byte], 1}
-        empty -> {[opts(opts, :line), tab(opts(opts, :indent), depth), byte], depth + 1}
+        empty -> {[opts(opts, :line), tab(opts(opts, :indent), depth), byte], depth + 0}
         true -> {byte, depth + 1}
       end

[Killed] BooleanLiteral
lib/formatter.ex:176:9
         depth == :first -> {byte, 1}
         depth == 0 -> {[opts(opts, :record), byte], 1}
         empty -> {[opts(opts, :line), tab(opts(opts, :indent), depth), byte], depth + 1}
-        true -> {byte, depth + 1}
+        false -> {byte, depth + 1}
       end
 

[Killed] Arithmetic
lib/formatter.ex:176:30
         depth == :first -> {byte, 1}
         depth == 0 -> {[opts(opts, :record), byte], 1}
         empty -> {[opts(opts, :line), tab(opts(opts, :indent), depth), byte], depth + 1}
-        true -> {byte, depth + 1}
+        true -> {byte, depth depth - 1+ 1}
       end
 

[Killed] BooleanLiteral
lib/formatter.ex:179:13
         true -> {byte, depth + 1}
       end
 
-    empty = true
+    empty = false
     pp_iodata(rest, [output, out], depth, empty, opts)
   end

[Killed] BooleanLiteral
lib/formatter.ex:184:13
   end
 
   defp pp_byte(byte, rest, output, depth, true = _empty, opts) when byte in ~c'}]' do
-    empty = false
+    empty = true
     depth = depth - 1
     pp_iodata(rest, [output, byte], depth, empty, opts)

[Killed] IntegerLiteral
lib/formatter.ex:185:21
 
   defp pp_byte(byte, rest, output, depth, true = _empty, opts) when byte in ~c'}]' do
     empty = false
-    depth = depth - 1
+    depth = depth - 0
     pp_iodata(rest, [output, byte], depth, empty, opts)
   end

[Killed] Arithmetic
lib/formatter.ex:185:19
 
   defp pp_byte(byte, rest, output, depth, true = _empty, opts) when byte in ~c'}]' do
     empty = false
-    depth = depth - 1
+    depth = depth depth + 1- 1
     pp_iodata(rest, [output, byte], depth, empty, opts)
   end

[Killed] IntegerLiteral
lib/formatter.ex:190:21
   end
 
   defp pp_byte(byte, rest, output, depth, false = empty, opts) when byte in ~c'}]' do
-    depth = depth - 1
+    depth = depth - 0
     out = [opts(opts, :line), tab(opts(opts, :indent), depth), byte]
     pp_iodata(rest, [output, out], depth, empty, opts)

[Killed] Arithmetic
lib/formatter.ex:190:19
   end
 
   defp pp_byte(byte, rest, output, depth, false = empty, opts) when byte in ~c'}]' do
-    depth = depth - 1
+    depth = depth depth * 1- 1
     out = [opts(opts, :line), tab(opts(opts, :indent), depth), byte]
     pp_iodata(rest, [output, out], depth, empty, opts)

[Killed] BooleanLiteral
lib/formatter.ex:196:13
   end
 
   defp pp_byte(byte, rest, output, depth, _empty, opts) when byte in ~c',' do
-    empty = false
+    empty = true
     out = [byte, opts(opts, :line), tab(opts(opts, :indent), depth)]
     pp_iodata(rest, [output, out], depth, empty, opts)

[Killed] BooleanLiteral
lib/formatter.ex:208:13
 
   defp pp_byte(byte, rest, output, depth, empty, opts) do
     out = if empty, do: [opts(opts, :line), tab(opts(opts, :indent), depth), byte], else: byte
-    empty = false
+    empty = true
 
     if byte == ?" do

[Killed] IntegerLiteral
lib/formatter.ex:210:16
     out = if empty, do: [opts(opts, :line), tab(opts(opts, :indent), depth), byte], else: byte
     empty = false
 
-    if byte == ?" do
+    if byte == 0 do
       pp_string(rest, [output, out], _in_bs = false, &pp_iodata(&1, &2, depth, empty, opts))
     else

[Killed] IntegerLiteral
lib/formatter.ex:210:16
     out = if empty, do: [opts(opts, :line), tab(opts(opts, :indent), depth), byte], else: byte
     empty = false
 
-    if byte == ?" do
+    if byte == 35 do
       pp_string(rest, [output, out], _in_bs = false, &pp_iodata(&1, &2, depth, empty, opts))
     else

[Killed] BooleanLiteral
lib/formatter.ex:211:47
     empty = false
 
     if byte == ?" do
-      pp_string(rest, [output, out], _in_bs = false, &pp_iodata(&1, &2, depth, empty, opts))
+      pp_string(rest, [output, out], _in_bs = true, &pp_iodata(&1, &2, depth, empty, opts))
     else
       pp_iodata(rest, [output, out], depth, empty, opts)

[Killed] BooleanLiteral
lib/formatter.ex:223:41
 
   defp pp_string(binary, output_acc, true = _in_bs, cont) when is_binary(binary) do
     <<byte, rest::binary>> = binary
-    pp_string(rest, [output_acc, byte], false, cont)
+    pp_string(rest, [output_acc, byte], true, cont)
   end
 

[Killed] IntegerLiteral
lib/formatter.ex:230:13
     case :binary.match(binary, ["\"", "\\"]) do
       :nomatch ->
         {[output_acc | binary], &pp_string(&1, &2, false, cont)}
-      {pos, 1} ->
+      {pos, 0} ->
         {head, tail} = :erlang.split_binary(binary, pos + 1)
         case :binary.at(binary, pos) do

[Killed] Arithmetic
lib/formatter.ex:231:57
       :nomatch ->
         {[output_acc | binary], &pp_string(&1, &2, false, cont)}
       {pos, 1} ->
-        {head, tail} = :erlang.split_binary(binary, pos + 1)
+        {head, tail} = :erlang.split_binary(binary, pos pos - 1+ 1)
         case :binary.at(binary, pos) do
           ?\\ -> pp_string(tail, [output_acc | head], true, cont)

[Killed] Arithmetic
lib/formatter.ex:231:57
       :nomatch ->
         {[output_acc | binary], &pp_string(&1, &2, false, cont)}
       {pos, 1} ->
-        {head, tail} = :erlang.split_binary(binary, pos + 1)
+        {head, tail} = :erlang.split_binary(binary, pos pos * 1+ 1)
         case :binary.at(binary, pos) do
           ?\\ -> pp_string(tail, [output_acc | head], true, cont)

[Killed] BooleanLiteral
lib/formatter.ex:233:55
       {pos, 1} ->
         {head, tail} = :erlang.split_binary(binary, pos + 1)
         case :binary.at(binary, pos) do
-          ?\\ -> pp_string(tail, [output_acc | head], true, cont)
+          ?\\ -> pp_string(tail, [output_acc | head], false, cont)
           ?" -> cont.(tail, [output_acc | head])
         end

[Killed] IntegerLiteral
lib/formatter.ex:233:11
       {pos, 1} ->
         {head, tail} = :erlang.split_binary(binary, pos + 1)
         case :binary.at(binary, pos) do
-          ?\\ -> pp_string(tail, [output_acc | head], true, cont)
+          0 -> pp_string(tail, [output_acc | head], true, cont)
           ?" -> cont.(tail, [output_acc | head])
         end

[Killed] IntegerLiteral
lib/formatter.ex:234:11
         {head, tail} = :erlang.split_binary(binary, pos + 1)
         case :binary.at(binary, pos) do
           ?\\ -> pp_string(tail, [output_acc | head], true, cont)
-          ?" -> cont.(tail, [output_acc | head])
+          35 -> cont.(tail, [output_acc | head])
         end
     end

[Killed] IntegerLiteral
lib/formatter.ex:234:11
         {head, tail} = :erlang.split_binary(binary, pos + 1)
         case :binary.at(binary, pos) do
           ?\\ -> pp_string(tail, [output_acc | head], true, cont)
-          ?" -> cont.(tail, [output_acc | head])
+          0 -> cont.(tail, [output_acc | head])
         end
     end

[Killed] GuardTypeTest
lib/formatter.ex:243:63
     {output_acc, &pp_string(&1, &2, in_bs, cont)}
   end
 
-  defp pp_string([byte | rest], output_acc, in_bs, cont) when is_integer(byte) do
+  defp pp_string([byte | rest], output_acc, in_bs, cont) when is_float(byte) do
     cond do
       in_bs -> pp_string(rest, [output_acc, byte], false, cont)

[Survived] GuardTypeTest
lib/formatter.ex:243:63
     {output_acc, &pp_string(&1, &2, in_bs, cont)}
   end
 
-  defp pp_string([byte | rest], output_acc, in_bs, cont) when is_integer(byte) do
+  defp pp_string([byte | rest], output_acc, in_bs, cont) when is_number(byte) do
     cond do
       in_bs -> pp_string(rest, [output_acc, byte], false, cont)

[Survived] BooleanLiteral
lib/formatter.ex:245:52
 
   defp pp_string([byte | rest], output_acc, in_bs, cont) when is_integer(byte) do
     cond do
-      in_bs -> pp_string(rest, [output_acc, byte], false, cont)
+      in_bs -> pp_string(rest, [output_acc, byte], true, cont)
       byte == ?" -> cont.(rest, [output_acc, byte])
       true -> pp_string(rest, [output_acc, byte], byte == ?\\, cont)

[Killed] ComparisonNegation
lib/formatter.ex:246:12
   defp pp_string([byte | rest], output_acc, in_bs, cont) when is_integer(byte) do
     cond do
       in_bs -> pp_string(rest, [output_acc, byte], false, cont)
-      byte == ?" -> cont.(rest, [output_acc, byte])
+      byte byte != 34== ?" -> cont.(rest, [output_acc, byte])
       true -> pp_string(rest, [output_acc, byte], byte == ?\\, cont)
     end

[Killed] IntegerLiteral
lib/formatter.ex:246:15
   defp pp_string([byte | rest], output_acc, in_bs, cont) when is_integer(byte) do
     cond do
       in_bs -> pp_string(rest, [output_acc, byte], false, cont)
-      byte == ?" -> cont.(rest, [output_acc, byte])
+      byte == 35 -> cont.(rest, [output_acc, byte])
       true -> pp_string(rest, [output_acc, byte], byte == ?\\, cont)
     end

[Killed] ComparisonNegation
lib/formatter.ex:247:56
     cond do
       in_bs -> pp_string(rest, [output_acc, byte], false, cont)
       byte == ?" -> cont.(rest, [output_acc, byte])
-      true -> pp_string(rest, [output_acc, byte], byte == ?\\, cont)
+      true -> pp_string(rest, [output_acc, byte], byte byte != 92== ?\\, cont)
     end
   end

[Killed] BooleanLiteral
lib/formatter.ex:247:7
     cond do
       in_bs -> pp_string(rest, [output_acc, byte], false, cont)
       byte == ?" -> cont.(rest, [output_acc, byte])
-      true -> pp_string(rest, [output_acc, byte], byte == ?\\, cont)
+      false -> pp_string(rest, [output_acc, byte], byte == ?\\, cont)
     end
   end
