[Survived] GuardTypeTest
lib/fragment.ex:14:24
 
   defstruct [:encode]
 
-  def new(iodata) when is_list(iodata) or is_binary(iodata) do
+  def new(iodata) when is_tuple(iodata) or is_binary(iodata) do
     %__MODULE__{encode: fn _ -> iodata end}
   end
