[Survived] BooleanLiteral
lib/helpers.ex:96:24
 
   # The same as Macro.var/2 except it sets generated: true
   defp generated_var(name, context) do
-    {name, [generated: true], context}
+    {name, [generated: false], context}
   end
 end
