[Killed] GuardTypeTest
lib/ordered_object.ex:30:24
       "{\"a\":1,\"b\":2,\"c\":3}"
 
   """
-  def new(values) when is_list(values) do
+  def new(values) when is_tuple(values) do
     %__MODULE__{values: values}
   end

[Killed] IntegerLiteral
lib/ordered_object.ex:36:30
 
   @impl Access
   def fetch(%__MODULE__{values: values}, key) do
-    case :lists.keyfind(key, 1, values) do
+    case :lists.keyfind(key, 0, values) do
       {_, value} -> {:ok, value}
       false -> :error

[Survived] BooleanLiteral
lib/ordered_object.ex:38:7
   def fetch(%__MODULE__{values: values}, key) do
     case :lists.keyfind(key, 1, values) do
       {_, value} -> {:ok, value}
-      false -> :error
+      true -> :error
     end
   end

[Killed] IntegerLiteral
lib/ordered_object.ex:50:30
 
   @impl Access
   def pop(%__MODULE__{values: values} = obj, key, default \\ nil) do
-    case :lists.keyfind(key, 1, values) do
+    case :lists.keyfind(key, 0, values) do
       {_, value} -> {value, %{obj | values: delete_key(values, key)}}
       false -> {default, obj}

[Survived] BooleanLiteral
lib/ordered_object.ex:52:7
   def pop(%__MODULE__{values: values} = obj, key, default \\ nil) do
     case :lists.keyfind(key, 1, values) do
       {_, value} -> {value, %{obj | values: delete_key(values, key)}}
-      false -> {default, obj}
+      true -> {default, obj}
     end
   end

[Survived] IntegerLiteral
lib/ordered_object.ex:90:39
 end
 
 defimpl Enumerable, for: Jason.OrderedObject do
-  def count(%{values: []}), do: {:ok, 0}
+  def count(%{values: []}), do: {:ok, 1}
   def count(_obj), do: {:error, __MODULE__}
 

[Survived] BooleanLiteral
lib/ordered_object.ex:93:49
   def count(%{values: []}), do: {:ok, 0}
   def count(_obj), do: {:error, __MODULE__}
 
-  def member?(%{values: []}, _value), do: {:ok, false}
+  def member?(%{values: []}, _value), do: {:ok, true}
   def member?(_obj, _value), do: {:error, __MODULE__}
 

[Survived] IntegerLiteral
lib/ordered_object.ex:96:39
   def member?(%{values: []}, _value), do: {:ok, false}
   def member?(_obj, _value), do: {:error, __MODULE__}
 
-  def slice(%{values: []}), do: {:ok, 0, fn _, _ -> [] end}
+  def slice(%{values: []}), do: {:ok, 1, fn _, _ -> [] end}
   def slice(_obj), do: {:error, __MODULE__}
 
