[Survived] IntegerLiteral
lib/sigil.ex:77:7
   defp mods_to_opts(modifiers) do
     modifiers
     |> Enum.map(fn
-      ?a -> {:keys, :atoms}
+      0 -> {:keys, :atoms}
       ?A -> {:keys, :atoms!}
       ?r -> {:strings, :reference}

[Survived] IntegerLiteral
lib/sigil.ex:77:7
   defp mods_to_opts(modifiers) do
     modifiers
     |> Enum.map(fn
-      ?a -> {:keys, :atoms}
+      98 -> {:keys, :atoms}
       ?A -> {:keys, :atoms!}
       ?r -> {:strings, :reference}

[Survived] IntegerLiteral
lib/sigil.ex:78:7
     modifiers
     |> Enum.map(fn
       ?a -> {:keys, :atoms}
-      ?A -> {:keys, :atoms!}
+      0 -> {:keys, :atoms!}
       ?r -> {:strings, :reference}
       ?c -> {:strings, :copy}

[Survived] IntegerLiteral
lib/sigil.ex:78:7
     modifiers
     |> Enum.map(fn
       ?a -> {:keys, :atoms}
-      ?A -> {:keys, :atoms!}
+      66 -> {:keys, :atoms!}
       ?r -> {:strings, :reference}
       ?c -> {:strings, :copy}

[Survived] IntegerLiteral
lib/sigil.ex:79:7
     |> Enum.map(fn
       ?a -> {:keys, :atoms}
       ?A -> {:keys, :atoms!}
-      ?r -> {:strings, :reference}
+      0 -> {:strings, :reference}
       ?c -> {:strings, :copy}
       m -> raise ArgumentError, "unknown sigil modifier #{<<?", m, ?">>}"

[Survived] IntegerLiteral
lib/sigil.ex:79:7
     |> Enum.map(fn
       ?a -> {:keys, :atoms}
       ?A -> {:keys, :atoms!}
-      ?r -> {:strings, :reference}
+      115 -> {:strings, :reference}
       ?c -> {:strings, :copy}
       m -> raise ArgumentError, "unknown sigil modifier #{<<?", m, ?">>}"

[Survived] IntegerLiteral
lib/sigil.ex:80:7
       ?a -> {:keys, :atoms}
       ?A -> {:keys, :atoms!}
       ?r -> {:strings, :reference}
-      ?c -> {:strings, :copy}
+      100 -> {:strings, :copy}
       m -> raise ArgumentError, "unknown sigil modifier #{<<?", m, ?">>}"
     end)

[Survived] IntegerLiteral
lib/sigil.ex:80:7
       ?a -> {:keys, :atoms}
       ?A -> {:keys, :atoms!}
       ?r -> {:strings, :reference}
-      ?c -> {:strings, :copy}
+      0 -> {:strings, :copy}
       m -> raise ArgumentError, "unknown sigil modifier #{<<?", m, ?">>}"
     end)

[Survived] IntegerLiteral
lib/sigil.ex:81:68
       ?A -> {:keys, :atoms!}
       ?r -> {:strings, :reference}
       ?c -> {:strings, :copy}
-      m -> raise ArgumentError, "unknown sigil modifier #{<<?", m, ?">>}"
+      m -> raise ArgumentError, "unknown sigil modifier #{<<?", m, 0>>}"
     end)
   end

[Survived] IntegerLiteral
lib/sigil.ex:81:68
       ?A -> {:keys, :atoms!}
       ?r -> {:strings, :reference}
       ?c -> {:strings, :copy}
-      m -> raise ArgumentError, "unknown sigil modifier #{<<?", m, ?">>}"
+      m -> raise ArgumentError, "unknown sigil modifier #{<<?", m, 35>>}"
     end)
   end
