[Killed] GuardTypeTest
lib/mint/core/util.ex:7:36
   alias Mint.Types
 
   @spec hostname(keyword(), String.t()) :: String.t()
-  def hostname(opts, address) when is_list(opts) do
+  def hostname(opts, address) when is_tuple(opts) do
     case Keyword.fetch(opts, :hostname) do
       {:ok, hostname} ->

[Killed] GuardTypeTest
lib/mint/core/util.ex:32:40
   @spec scheme_to_transport(atom()) :: module()
   def scheme_to_transport(:http), do: Mint.Core.Transport.TCP
   def scheme_to_transport(:https), do: Mint.Core.Transport.SSL
-  def scheme_to_transport(module) when is_atom(module), do: module
+  def scheme_to_transport(module) when is_nil(module), do: module
 
   defp calculate_buffer(opts) do
