[Killed] GuardComparisonNegation
lib/mint/http.ex:132:55
   @type t() :: Mint.HTTP1.t() | Mint.HTTP2.t() | Mint.UnsafeProxy.t()
 
   defguardp is_data_message(message)
-            when elem(message, 0) in [:ssl, :tcp] and tuple_size(message) == 3
+            when elem(message, 0) in [:ssl, :tcp] and tuple_size(message) != 3
 
   defguardp is_closed_message(message)

[Killed] GuardComparisonNegation
lib/mint/http.ex:135:69
             when elem(message, 0) in [:ssl, :tcp] and tuple_size(message) == 3
 
   defguardp is_closed_message(message)
-            when elem(message, 0) in [:ssl_closed, :tcp_closed] and tuple_size(message) == 2
+            when elem(message, 0) in [:ssl_closed, :tcp_closed] and tuple_size(message) != 2
 
   defguardp is_error_message(message)

[Killed] GuardComparisonNegation
lib/mint/http.ex:138:67
             when elem(message, 0) in [:ssl_closed, :tcp_closed] and tuple_size(message) == 2
 
   defguardp is_error_message(message)
-            when elem(message, 0) in [:ssl_error, :tcp_error] and tuple_size(message) == 3
+            when elem(message, 0) in [:ssl_error, :tcp_error] and tuple_size(message) != 3
 
   defguardp is_non_proxy_connection_message(conn, message)

[Killed] GuardTypeTest
lib/mint/http.ex:142:20
 
   defguardp is_non_proxy_connection_message(conn, message)
             when is_struct(conn) and
-                   is_tuple(message) and
+                   is_list(message) and
                    is_map_key(conn, :socket) and
                    elem(message, 1) == :erlang.map_get(:socket, conn) and

[Killed] GuardComparisonNegation
lib/mint/http.ex:144:20
             when is_struct(conn) and
                    is_tuple(message) and
                    is_map_key(conn, :socket) and
-                   elem(message, 1) == :erlang.map_get(:socket, conn) and
+                   elem(message, 1) != :erlang.map_get(:socket, conn) and
                    (is_data_message(message) or is_closed_message(message) or
                       is_error_message(message))
