[Killed] ComparisonNegation
lib/mint/http1.ex:207:25
     end
 
     with :ok <- Util.inet_opts(transport, socket),
-         :ok <- if(mode == :active, do: transport.setopts(socket, active: :once), else: :ok) do
+         :ok <- if(mode mode != :active== :active, do: transport.setopts(socket, active: :once), else: :ok) do
       conn = %__MODULE__{
         transport: transport,

[Killed] UnaryNot
lib/mint/http1.ex:234:14
     opts
     |> Keyword.get(:optional_responses, [])
     |> Enum.map(fn opt ->
-      if opt not in @optional_responses_opts do
+      if opt opt in @optional_responses_optsnot in @optional_responses_opts do
         raise ArgumentError, """
         invalid :optional_responses value #{inspect(opt)}, the allowed values are: \

[Killed] ComparisonNegation
lib/mint/http1.ex:270:11
 
   # TODO: hard-deprecate :read_write in 1.7.
   def open?(%__MODULE__{state: state}, type) when type in [:read, :write, :read_write] do
-    state == :open
+    state state != :open== :open
   end
 

[Killed] ComparisonNegation
lib/mint/http1.ex:456:32
   end
 
   defp validate_chunk(_conn, chunk) do
-    if IO.iodata_length(chunk) == 0 do
+    if IO.iodata_length(chunk) IO.iodata_length(chunk) != 0== 0 do
       :empty_chunk
     else

[Killed] ComparisonNegation
lib/mint/http1.ex:524:32
     conn = put_in(conn.state, :closed)
     conn = request_done(conn)
 
-    if request && request.body == :until_closed do
+    if request && request.body request.body != :until_closed== :until_closed do
       conn = put_in(conn.state, :closed)
       {:ok, conn, [{:done, request.ref}]}

[Killed] Boolean
lib/mint/http1.ex:524:16
     conn = put_in(conn.state, :closed)
     conn = request_done(conn)
 
-    if request && request.body == :until_closed do
+    if request request || request.body == :until_closed&& request.body == :until_closed do
       conn = put_in(conn.state, :closed)
       {:ok, conn, [{:done, request.ref}]}

[Killed] Arithmetic
lib/mint/http1.ex:603:38
     case conn do
       %{request: nil, streaming_request: nil} -> 0
       %{request: nil} -> 1
-      %{streaming_request: nil} -> 1 + :queue.len(conn.requests)
+      %{streaming_request: nil} -> 1 1 * :queue.len(conn.requests)+ :queue.len(conn.requests)
       _ -> 2 + :queue.len(conn.requests)
     end

[Killed] Arithmetic
lib/mint/http1.ex:603:38
     case conn do
       %{request: nil, streaming_request: nil} -> 0
       %{request: nil} -> 1
-      %{streaming_request: nil} -> 1 + :queue.len(conn.requests)
+      %{streaming_request: nil} -> 1 1 - :queue.len(conn.requests)+ :queue.len(conn.requests)
       _ -> 2 + :queue.len(conn.requests)
     end

[Survived] Arithmetic
lib/mint/http1.ex:604:14
       %{request: nil, streaming_request: nil} -> 0
       %{request: nil} -> 1
       %{streaming_request: nil} -> 1 + :queue.len(conn.requests)
-      _ -> 2 + :queue.len(conn.requests)
+      _ -> 2 2 - :queue.len(conn.requests)+ :queue.len(conn.requests)
     end
   end

[Survived] Arithmetic
lib/mint/http1.ex:604:14
       %{request: nil, streaming_request: nil} -> 0
       %{request: nil} -> 1
       %{streaming_request: nil} -> 1 + :queue.len(conn.requests)
-      _ -> 2 + :queue.len(conn.requests)
+      _ -> 2 2 * :queue.len(conn.requests)+ :queue.len(conn.requests)
     end
   end

[Killed] ComparisonNegation
lib/mint/http1.ex:792:14
 
   defp decode_body({:content_length, length}, conn, data, request_ref, responses) do
     cond do
-      length > byte_size(data) ->
+      length length <= byte_size(data)> byte_size(data) ->
         conn = put_in(conn.request.body, {:content_length, length - byte_size(data)})
         {conn, responses} = add_body(conn, data, responses)

[Killed] ComparisonBoundary
lib/mint/http1.ex:792:14
 
   defp decode_body({:content_length, length}, conn, data, request_ref, responses) do
     cond do
-      length > byte_size(data) ->
+      length length >= byte_size(data)> byte_size(data) ->
         conn = put_in(conn.request.body, {:content_length, length - byte_size(data)})
         {conn, responses} = add_body(conn, data, responses)

[Killed] Arithmetic
lib/mint/http1.ex:793:67
   defp decode_body({:content_length, length}, conn, data, request_ref, responses) do
     cond do
       length > byte_size(data) ->
-        conn = put_in(conn.request.body, {:content_length, length - byte_size(data)})
+        conn = put_in(conn.request.body, {:content_length, length length + byte_size(data)- byte_size(data)})
         {conn, responses} = add_body(conn, data, responses)
         {:ok, conn, responses}

[Killed] Arithmetic
lib/mint/http1.ex:793:67
   defp decode_body({:content_length, length}, conn, data, request_ref, responses) do
     cond do
       length > byte_size(data) ->
-        conn = put_in(conn.request.body, {:content_length, length - byte_size(data)})
+        conn = put_in(conn.request.body, {:content_length, length length * byte_size(data)- byte_size(data)})
         {conn, responses} = add_body(conn, data, responses)
         {:ok, conn, responses}

[Killed] ComparisonBoundary
lib/mint/http1.ex:797:14
         {conn, responses} = add_body(conn, data, responses)
         {:ok, conn, responses}
 
-      length <= byte_size(data) ->
+      length length < byte_size(data)<= byte_size(data) ->
         {body, rest} = :erlang.split_binary(data, length)
         {conn, responses} = add_body(conn, body, responses)

[Killed] ComparisonNegation
lib/mint/http1.ex:797:14
         {conn, responses} = add_body(conn, data, responses)
         {:ok, conn, responses}
 
-      length <= byte_size(data) ->
+      length length > byte_size(data)<= byte_size(data) ->
         {body, rest} = :erlang.split_binary(data, length)
         {conn, responses} = add_body(conn, body, responses)

[Killed] Arithmetic
lib/mint/http1.ex:867:60
     cond do
       length > byte_size(data) ->
         conn = put_in(conn.buffer, "")
-        conn = put_in(conn.request.body, {:chunked, length - byte_size(data)})
+        conn = put_in(conn.request.body, {:chunked, length length + byte_size(data)- byte_size(data)})
         conn = add_body_to_buffer(conn, data)
         {:ok, conn, responses}

[Killed] Arithmetic
lib/mint/http1.ex:867:60
     cond do
       length > byte_size(data) ->
         conn = put_in(conn.buffer, "")
-        conn = put_in(conn.request.body, {:chunked, length - byte_size(data)})
+        conn = put_in(conn.request.body, {:chunked, length length * byte_size(data)- byte_size(data)})
         conn = add_body_to_buffer(conn, data)
         {:ok, conn, responses}

[Killed] UnaryNot
lib/mint/http1.ex:968:7
     conn = pop_request(conn)
 
     cond do
-      !request -> conn
+      request!request -> conn
       "close" in request.connection -> internal_close(conn)
       request.version >= {1, 1} -> conn

[Killed] ComparisonBoundary
lib/mint/http1.ex:970:23
     cond do
       !request -> conn
       "close" in request.connection -> internal_close(conn)
-      request.version >= {1, 1} -> conn
+      request.version request.version > {1, 1}>= {1, 1} -> conn
       "keep-alive" in request.connection -> conn
       true -> internal_close(conn)

[Killed] ComparisonNegation
lib/mint/http1.ex:970:23
     cond do
       !request -> conn
       "close" in request.connection -> internal_close(conn)
-      request.version >= {1, 1} -> conn
+      request.version request.version < {1, 1}>= {1, 1} -> conn
       "keep-alive" in request.connection -> conn
       true -> internal_close(conn)

[Survived] ComparisonNegation
lib/mint/http1.ex:996:20
   end
 
   defp internal_close(conn) do
-    if conn.buffer != "" do
+    if conn.buffer conn.buffer == ""!= "" do
       log(conn, :debug, ["Connection closed with data left in the buffer: ", inspect(conn.buffer)])
     end

[Killed] ComparisonNegation
lib/mint/http1.ex:1014:14
   # > a message downstream.
   defp message_body(%{body: nil, method: method, status: status} = request) do
     cond do
-      status == 101 ->
+      status status != 101== 101 ->
         {:ok, :single}
 

[Killed] ComparisonNegation
lib/mint/http1.ex:1020:14
       status in 100..199 ->
         {:ok, :informational}
 
-      method == "HEAD" or status in [204, 304] ->
+      method method != "HEAD"== "HEAD" or status in [204, 304] ->
         {:ok, :none}
 

[Killed] Boolean
lib/mint/http1.ex:1020:24
       status in 100..199 ->
         {:ok, :informational}
 
-      method == "HEAD" or status in [204, 304] ->
+      method == "HEAD" method == "HEAD" and status in [204, 304]or status in [204, 304] ->
         {:ok, :none}
 

[Killed] ComparisonNegation
lib/mint/http1.ex:1025:33
 
       # method == "CONNECT" and status in 200..299 -> nil
 
-      request.transfer_encoding != [] && request.content_length ->
+      request.transfer_encoding request.transfer_encoding == []!= [] && request.content_length ->
         {:error, :transfer_encoding_and_content_length}
 

[Killed] Boolean
lib/mint/http1.ex:1025:39
 
       # method == "CONNECT" and status in 200..299 -> nil
 
-      request.transfer_encoding != [] && request.content_length ->
+      request.transfer_encoding != [] request.transfer_encoding != [] || request.content_length&& request.content_length ->
         {:error, :transfer_encoding_and_content_length}
 

[Killed] ComparisonNegation
lib/mint/http1.ex:1028:17
       request.transfer_encoding != [] && request.content_length ->
         {:error, :transfer_encoding_and_content_length}
 
-      "chunked" == List.first(request.transfer_encoding) ->
+      "chunked" "chunked" != List.first(request.transfer_encoding)== List.first(request.transfer_encoding) ->
         {:ok, {:chunked, nil}}
 

[Killed] ComparisonNegation
lib/mint/http1.ex:1072:15
 
   defp new_request(ref, method, body, encoding) do
     state =
-      if body == :stream do
+      if body body != :stream== :stream do
         {:stream_request, encoding}
       else

[Killed] ComparisonNegation
lib/mint/http1.ex:1101:33
 
   # If the port is the default for the scheme, don't add it to the host header
   defp default_host_header(%__MODULE__{scheme_as_string: scheme, host: host, port: port}) do
-    if URI.default_port(scheme) == port do
+    if URI.default_port(scheme) URI.default_port(scheme) != port== port do
       host
     else

[Killed] Boolean
lib/mint/http1.ex:1117:34
         {raw_name, value} = found
 
         with {:ok, tokens} <- Parse.transfer_encoding_header(value) do
-          if "chunked" in tokens or "identity" in tokens do
+          if "chunked" in tokens "chunked" in tokens and "identity" in tokensor "identity" in tokens do
             {:ok, headers, :identity}
           else
