[Killed] GuardComparisonNegation
lib/mint/http1/parse.ex:22:25
 
   def content_length_header(string) do
     case Integer.parse(String.trim_trailing(string)) do
-      {length, ""} when length >= 0 -> {:ok, length}
+      {length, ""} when length < 0 -> {:ok, length}
       _other -> {:error, {:invalid_content_length_header, string}}
     end

[Killed] GuardComparisonBoundary
lib/mint/http1/parse.ex:22:25
 
   def content_length_header(string) do
     case Integer.parse(String.trim_trailing(string)) do
-      {length, ""} when length >= 0 -> {:ok, length}
+      {length, ""} when length > 0 -> {:ok, length}
       _other -> {:error, {:invalid_content_length_header, string}}
     end

[Killed] Arithmetic
lib/mint/http1/parse.ex:70:64
 
   defp token_list_sep_downcase(_rest, _acc), do: :error
 
-  defp downcase_ascii_char(char) when char in ?A..?Z, do: char + 32
+  defp downcase_ascii_char(char) when char in ?A..?Z, do: char char - 32+ 32
   defp downcase_ascii_char(char) when char in 0..127, do: char
 end

[Killed] Arithmetic
lib/mint/http1/parse.ex:70:64
 
   defp token_list_sep_downcase(_rest, _acc), do: :error
 
-  defp downcase_ascii_char(char) when char in ?A..?Z, do: char + 32
+  defp downcase_ascii_char(char) when char in ?A..?Z, do: char char * 32+ 32
   defp downcase_ascii_char(char) when char in 0..127, do: char
 end
