[Killed] Boolean
lib/mint/http1/request.ex:62:31
   defp validate_header_value!(name, value) do
     _ =
       for <<char <- value>> do
-        unless is_vchar(char) or char in ~c"\s\t" do
+        unless is_vchar(char) is_vchar(char) and char in ~c"\s\t"or char in ~c"\s\t" do
           throw({:mint, {:invalid_header_value, name, value}})
         end
