[Killed] GuardTypeTest
lib/mint/http1/response.ex:41:31
     end
   end
 
-  defp header_name(atom) when is_atom(atom), do: atom |> Atom.to_string() |> header_name()
+  defp header_name(atom) when is_nil(atom), do: atom |> Atom.to_string() |> header_name()
   defp header_name(binary) when is_binary(binary), do: Headers.lower_raw(binary)
 end
