[Killed] ComparisonNegation
lib/mint/http2.ex:475:51
     case state do
       :handshaking -> true
       :open -> true
-      {:goaway, _error_code, _debug_data} -> type == :read
+      {:goaway, _error_code, _debug_data} -> type type != :read== :read
       :closed -> false
     end

[Killed] Arithmetic
lib/mint/http2.ex:949:26
   end
 
   defp do_set_window_size(conn, stream_id, current, new_size, update) do
-    increment = new_size - current
+    increment = new_size new_size + current- current
     frame = window_update(stream_id: stream_id, window_size_increment: increment)
     conn = send!(conn, Frame.encode(frame))

[Killed] Arithmetic
lib/mint/http2.ex:949:26
   end
 
   defp do_set_window_size(conn, stream_id, current, new_size, update) do
-    increment = new_size - current
+    increment = new_size new_size * current- current
     frame = window_update(stream_id: stream_id, window_size_increment: increment)
     conn = send!(conn, Frame.encode(frame))

[Killed] ComparisonNegation
lib/mint/http2.ex:1148:42
     validate_client_settings!(client_settings_params)
     # If the port is the default for the scheme, don't add it to the :authority pseudo-header
     authority =
-      if URI.default_port(scheme_string) == port do
+      if URI.default_port(scheme_string) URI.default_port(scheme_string) != port== port do
         hostname
       else

[Killed] ComparisonNegation
lib/mint/http2.ex:1196:25
          :ok <- transport.send(socket, preface),
          conn = update_in(conn.client_settings_queue, &:queue.in(client_settings_params, &1)),
          conn = put_in(conn.socket, socket),
-         :ok <- if(mode == :active, do: transport.setopts(socket, active: :once), else: :ok) do
+         :ok <- if(mode mode != :active== :active, do: transport.setopts(socket, active: :once), else: :ok) do
       {:ok, conn}
     else

[Killed] ComparisonBoundary
lib/mint/http2.ex:1208:31
   defp build_preface(client_settings_params, connection_window_size) do
     settings_frame = Frame.encode(settings(stream_id: 0, params: client_settings_params))
 
-    if connection_window_size > @default_window_size do
+    if connection_window_size connection_window_size >= @default_window_size> @default_window_size do
       increment = connection_window_size - @default_window_size
       update_frame = Frame.encode(window_update(stream_id: 0, window_size_increment: increment))

[Killed] ComparisonNegation
lib/mint/http2.ex:1208:31
   defp build_preface(client_settings_params, connection_window_size) do
     settings_frame = Frame.encode(settings(stream_id: 0, params: client_settings_params))
 
-    if connection_window_size > @default_window_size do
+    if connection_window_size connection_window_size <= @default_window_size> @default_window_size do
       increment = connection_window_size - @default_window_size
       update_frame = Frame.encode(window_update(stream_id: 0, window_size_increment: increment))

[Survived] Arithmetic
lib/mint/http2.ex:1209:42
     settings_frame = Frame.encode(settings(stream_id: 0, params: client_settings_params))
 
     if connection_window_size > @default_window_size do
-      increment = connection_window_size - @default_window_size
+      increment = connection_window_size connection_window_size + @default_window_size- @default_window_size
       update_frame = Frame.encode(window_update(stream_id: 0, window_size_increment: increment))
       [@connection_preface, settings_frame, update_frame]

[Survived] Arithmetic
lib/mint/http2.ex:1209:42
     settings_frame = Frame.encode(settings(stream_id: 0, params: client_settings_params))
 
     if connection_window_size > @default_window_size do
-      increment = connection_window_size - @default_window_size
+      increment = connection_window_size connection_window_size * @default_window_size- @default_window_size
       update_frame = Frame.encode(window_update(stream_id: 0, window_size_increment: increment))
       [@connection_preface, settings_frame, update_frame]

[Killed] ComparisonBoundary
lib/mint/http2.ex:1218:40
   end
 
   defp validate_window_size!(name, value) do
-    unless is_integer(value) and value >= @default_window_size and value <= @max_window_size do
+    unless is_integer(value) and value value > @default_window_size>= @default_window_size and value <= @max_window_size do
       raise ArgumentError,
             "the :#{name} option must be an integer in " <>

[Killed] ComparisonNegation
lib/mint/http2.ex:1218:40
   end
 
   defp validate_window_size!(name, value) do
-    unless is_integer(value) and value >= @default_window_size and value <= @max_window_size do
+    unless is_integer(value) and value value < @default_window_size>= @default_window_size and value <= @max_window_size do
       raise ArgumentError,
             "the :#{name} option must be an integer in " <>

[Killed] Boolean
lib/mint/http2.ex:1226:45
   end
 
   defp validate_receive_window_update_threshold!(value) do
-    unless is_integer(value) and value >= 1 and value <= @max_window_size do
+    unless is_integer(value) and value >= 1 (is_integer(value) and value >= 1) or value <= @max_window_sizeand value <= @max_window_size do
       raise ArgumentError,
             "the :receive_window_update_threshold option must be a positive integer no larger than " <>

[Killed] Boolean
lib/mint/http2.ex:1226:30
   end
 
   defp validate_receive_window_update_threshold!(value) do
-    unless is_integer(value) and value >= 1 and value <= @max_window_size do
+    unless is_integer(value) is_integer(value) or value >= 1and value >= 1 and value <= @max_window_size do
       raise ArgumentError,
             "the :receive_window_update_threshold option must be a positive integer no larger than " <>

[Killed] ComparisonNegation
lib/mint/http2.ex:1271:75
   defp handle_closed(conn) do
     conn = put_in(conn.state, :closed)
 
-    if conn.open_client_stream_count > 0 or conn.open_server_stream_count > 0 do
+    if conn.open_client_stream_count > 0 or conn.open_server_stream_count conn.open_server_stream_count <= 0> 0 do
       error = conn.transport.wrap_error(:closed)
       {:error, conn, error, _responses = []}

[Killed] Boolean
lib/mint/http2.ex:1271:42
   defp handle_closed(conn) do
     conn = put_in(conn.state, :closed)
 
-    if conn.open_client_stream_count > 0 or conn.open_server_stream_count > 0 do
+    if conn.open_client_stream_count > 0 conn.open_client_stream_count > 0 and conn.open_server_stream_count > 0or conn.open_server_stream_count > 0 do
       error = conn.transport.wrap_error(:closed)
       {:error, conn, error, _responses = []}

[Killed] ComparisonNegation
lib/mint/http2.ex:1291:19
 
     with {:ok, socket} <- transport.connect(address, port, transport_opts),
          {:ok, protocol} <- transport.negotiated_protocol(socket) do
-      if protocol == "h2" do
+      if protocol protocol != "h2"== "h2" do
         {:ok, socket}
       else

[Killed] ComparisonNegation
lib/mint/http2.ex:1302:38
   defp open_stream(conn) do
     max_concurrent_streams = conn.server_settings.max_concurrent_streams
 
-    if conn.open_client_stream_count >= max_concurrent_streams do
+    if conn.open_client_stream_count conn.open_client_stream_count < max_concurrent_streams>= max_concurrent_streams do
       throw({:mint, conn, wrap_error(:too_many_concurrent_requests)})
     end

[Killed] ComparisonBoundary
lib/mint/http2.ex:1302:38
   defp open_stream(conn) do
     max_concurrent_streams = conn.server_settings.max_concurrent_streams
 
-    if conn.open_client_stream_count >= max_concurrent_streams do
+    if conn.open_client_stream_count conn.open_client_stream_count > max_concurrent_streams>= max_concurrent_streams do
       throw({:mint, conn, wrap_error(:too_many_concurrent_requests)})
     end

[Killed] Arithmetic
lib/mint/http2.ex:1393:31
     # of the name and value in octets plus an overhead of 32 octets for each header field.
     total_size =
       Enum.reduce(headers, 0, fn {name, value}, acc ->
-        acc + byte_size(name) + byte_size(value) + 32
+        acc + byte_size(name) acc + byte_size(name) - byte_size(value)+ byte_size(value) + 32
       end)
 

[Killed] Arithmetic
lib/mint/http2.ex:1393:50
     # of the name and value in octets plus an overhead of 32 octets for each header field.
     total_size =
       Enum.reduce(headers, 0, fn {name, value}, acc ->
-        acc + byte_size(name) + byte_size(value) + 32
+        acc + byte_size(name) + byte_size(value) acc + byte_size(name) + byte_size(value) - 32+ 32
       end)
 

[Killed] ComparisonNegation
lib/mint/http2.ex:1398:19
 
     max_header_list_size = conn.server_settings.max_header_list_size
 
-    if total_size <= max_header_list_size do
+    if total_size total_size > max_header_list_size<= max_header_list_size do
       :ok
     else

[Survived] ComparisonBoundary
lib/mint/http2.ex:1398:19
 
     max_header_list_size = conn.server_settings.max_header_list_size
 
-    if total_size <= max_header_list_size do
+    if total_size total_size < max_header_list_size<= max_header_list_size do
       :ok
     else

[Killed] ComparisonNegation
lib/mint/http2.ex:1407:30
   end
 
   defp headers_to_encoded_frames(conn, stream_id, hbf, enabled_flags) do
-    if IO.iodata_length(hbf) > conn.server_settings.max_frame_size do
+    if IO.iodata_length(hbf) IO.iodata_length(hbf) <= conn.server_settings.max_frame_size> conn.server_settings.max_frame_size do
       hbf
       |> IO.iodata_to_binary()

[Survived] ComparisonBoundary
lib/mint/http2.ex:1407:30
   end
 
   defp headers_to_encoded_frames(conn, stream_id, hbf, enabled_flags) do
-    if IO.iodata_length(hbf) > conn.server_settings.max_frame_size do
+    if IO.iodata_length(hbf) IO.iodata_length(hbf) >= conn.server_settings.max_frame_size> conn.server_settings.max_frame_size do
       hbf
       |> IO.iodata_to_binary()

[Killed] ComparisonNegation
lib/mint/http2.ex:1443:21
   defp encode_data(conn, stream_id, data, enabled_flags) do
     stream = fetch_stream!(conn, stream_id)
 
-    if stream.state != :open do
+    if stream.state stream.state == :open!= :open do
       error = wrap_error(:request_is_not_streaming)
       throw({:mint, conn, error})

[Killed] ComparisonBoundary
lib/mint/http2.ex:1451:17
     data_size = IO.iodata_length(data)
 
     cond do
-      data_size > stream.send_window_size ->
+      data_size data_size >= stream.send_window_size> stream.send_window_size ->
         throw(
           {:mint, conn, wrap_error({:exceeds_window_size, :request, stream.send_window_size})}

[Killed] ComparisonNegation
lib/mint/http2.ex:1451:17
     data_size = IO.iodata_length(data)
 
     cond do
-      data_size > stream.send_window_size ->
+      data_size data_size <= stream.send_window_size> stream.send_window_size ->
         throw(
           {:mint, conn, wrap_error({:exceeds_window_size, :request, stream.send_window_size})}

[Killed] ComparisonNegation
lib/mint/http2.ex:1456:17
           {:mint, conn, wrap_error({:exceeds_window_size, :request, stream.send_window_size})}
         )
 
-      data_size > conn.send_window_size ->
+      data_size data_size <= conn.send_window_size> conn.send_window_size ->
         throw(
           {:mint, conn, wrap_error({:exceeds_window_size, :connection, conn.send_window_size})}

[Killed] ComparisonBoundary
lib/mint/http2.ex:1456:17
           {:mint, conn, wrap_error({:exceeds_window_size, :request, stream.send_window_size})}
         )
 
-      data_size > conn.send_window_size ->
+      data_size data_size >= conn.send_window_size> conn.send_window_size ->
         throw(
           {:mint, conn, wrap_error({:exceeds_window_size, :connection, conn.send_window_size})}

[Killed] ComparisonBoundary
lib/mint/http2.ex:1463:17
 
       # If the data size is greater than the max frame size, we chunk automatically based
       # on the max frame size.
-      data_size > conn.server_settings.max_frame_size ->
+      data_size data_size >= conn.server_settings.max_frame_size> conn.server_settings.max_frame_size ->
         {chunks, last_chunk} =
           data

[Killed] ComparisonNegation
lib/mint/http2.ex:1463:17
 
       # If the data size is greater than the max frame size, we chunk automatically based
       # on the max frame size.
-      data_size > conn.server_settings.max_frame_size ->
+      data_size data_size <= conn.server_settings.max_frame_size> conn.server_settings.max_frame_size ->
         {chunks, last_chunk} =
           data

[Killed] ComparisonNegation
lib/mint/http2.ex:1551:44
         end
 
       {:initial_window_size, value} ->
-        unless is_integer(value) and value <= @max_window_size do
+        unless is_integer(value) and value value > @max_window_size<= @max_window_size do
           raise ArgumentError,
                 ":initial_window_size must be an integer < #{@max_window_size}, " <>

[Survived] Boolean
lib/mint/http2.ex:1551:34
         end
 
       {:initial_window_size, value} ->
-        unless is_integer(value) and value <= @max_window_size do
+        unless is_integer(value) is_integer(value) or value <= @max_window_sizeand value <= @max_window_size do
           raise ArgumentError,
                 ":initial_window_size must be an integer < #{@max_window_size}, " <>

[Survived] Boolean
lib/mint/http2.ex:1558:34
         end
 
       {:max_frame_size, value} ->
-        unless is_integer(value) and value in @valid_max_frame_size_range do
+        unless is_integer(value) is_integer(value) or value in @valid_max_frame_size_rangeand value in @valid_max_frame_size_range do
           raise ArgumentError,
                 ":max_frame_size must be an integer in #{inspect(@valid_max_frame_size_range)}, " <>

[Killed] UnaryNot
lib/mint/http2.ex:1628:7
 
   defp sort_pseudo_headers_to_front(headers) do
     Enum.sort_by(headers, fn {key, _value} ->
-      not String.starts_with?(key, ":")
+      String.starts_with?(key, ":")not String.starts_with?(key, ":")
     end)
   end

[Killed] Boolean
lib/mint/http2.ex:1699:36
     # > that MUST be the first frame the server sends in the HTTP/2 connection.
     conn =
       cond do
-        conn.state == :handshaking and type == :goaway ->
+        conn.state == :handshaking conn.state == :handshaking or type == :goawayand type == :goaway ->
           goaway(error_code: error_code, debug_data: debug_data) = frame
           error = wrap_error({:server_closed_connection, error_code, debug_data})

[Killed] ComparisonNegation
lib/mint/http2.ex:1699:20
     # > that MUST be the first frame the server sends in the HTTP/2 connection.
     conn =
       cond do
-        conn.state == :handshaking and type == :goaway ->
+        conn.state conn.state != :handshaking== :handshaking and type == :goaway ->
           goaway(error_code: error_code, debug_data: debug_data) = frame
           error = wrap_error({:server_closed_connection, error_code, debug_data})

[Killed] Boolean
lib/mint/http2.ex:1704:36
           error = wrap_error({:server_closed_connection, error_code, debug_data})
           throw({:mint, %{conn | state: :closed}, error, []})
 
-        conn.state == :handshaking and type != :settings ->
+        conn.state == :handshaking conn.state == :handshaking or type != :settingsand type != :settings ->
           debug_data = "received invalid frame #{type} during handshake"
           send_connection_error!(conn, :protocol_error, debug_data)

[Killed] ComparisonNegation
lib/mint/http2.ex:1704:20
           error = wrap_error({:server_closed_connection, error_code, debug_data})
           throw({:mint, %{conn | state: :closed}, error, []})
 
-        conn.state == :handshaking and type != :settings ->
+        conn.state conn.state != :handshaking== :handshaking and type != :settings ->
           debug_data = "received invalid frame #{type} during handshake"
           send_connection_error!(conn, :protocol_error, debug_data)

[Killed] ComparisonNegation
lib/mint/http2.ex:1708:20
           debug_data = "received invalid frame #{type} during handshake"
           send_connection_error!(conn, :protocol_error, debug_data)
 
-        conn.state == :handshaking ->
+        conn.state conn.state != :handshaking== :handshaking ->
           %{conn | state: :open}
 

[Killed] Boolean
lib/mint/http2.ex:1763:34
   end
 
   defp assert_stream_id_is_allowed(conn, stream_id) do
-    if Integer.is_odd(stream_id) and stream_id >= conn.next_stream_id do
+    if Integer.is_odd(stream_id) Integer.is_odd(stream_id) or stream_id >= conn.next_stream_idand stream_id >= conn.next_stream_id do
       debug_data = "frame with stream ID #{inspect(stream_id)} has not been opened yet"
       send_connection_error!(conn, :protocol_error, debug_data)

[Killed] ComparisonNegation
lib/mint/http2.ex:1763:48
   end
 
   defp assert_stream_id_is_allowed(conn, stream_id) do
-    if Integer.is_odd(stream_id) and stream_id >= conn.next_stream_id do
+    if Integer.is_odd(stream_id) and stream_id stream_id < conn.next_stream_id>= conn.next_stream_id do
       debug_data = "frame with stream ID #{inspect(stream_id)} has not been opened yet"
       send_connection_error!(conn, :protocol_error, debug_data)

[Killed] Arithmetic
lib/mint/http2.ex:1793:45
 
     # Regardless of whether we have the stream or not, we need to abide by flow
     # control rules so we still refill the client window for the stream_id we got.
-    window_size_increment = byte_size(data) + byte_size(padding || "")
+    window_size_increment = byte_size(data) byte_size(data) * byte_size(padding || "")+ byte_size(padding || "")
 
     conn =

[Killed] Boolean
lib/mint/http2.ex:1793:65
 
     # Regardless of whether we have the stream or not, we need to abide by flow
     # control rules so we still refill the client window for the stream_id we got.
-    window_size_increment = byte_size(data) + byte_size(padding || "")
+    window_size_increment = byte_size(data) + byte_size(padding padding && ""|| "")
 
     conn =

[Killed] ComparisonNegation
lib/mint/http2.ex:1796:32
     window_size_increment = byte_size(data) + byte_size(padding || "")
 
     conn =
-      if window_size_increment > 0 do
+      if window_size_increment window_size_increment <= 0> 0 do
         refill_client_windows(conn, stream_id, window_size_increment)
       else

[Survived] ComparisonBoundary
lib/mint/http2.ex:1796:32
     window_size_increment = byte_size(data) + byte_size(padding || "")
 
     conn =
-      if window_size_increment > 0 do
+      if window_size_increment window_size_increment >= 0> 0 do
         refill_client_windows(conn, stream_id, window_size_increment)
       else

[Killed] ComparisonNegation
lib/mint/http2.ex:1845:15
       |> maybe_refill_stream(conn, stream_id)
       |> maybe_refill_conn(conn)
 
-    if frames != [] and open?(conn) do
+    if frames frames == []!= [] and open?(conn) do
       conn = send!(conn, Enum.map(frames, &Frame.encode/1))
       apply_refills(conn, frames)

[Survived] Boolean
lib/mint/http2.ex:1845:21
       |> maybe_refill_stream(conn, stream_id)
       |> maybe_refill_conn(conn)
 
-    if frames != [] and open?(conn) do
+    if frames != [] frames != [] or open?(conn)and open?(conn) do
       conn = send!(conn, Enum.map(frames, &Frame.encode/1))
       apply_refills(conn, frames)

[Killed] ComparisonNegation
lib/mint/http2.ex:1854:38
   end
 
   defp maybe_refill_conn(frames, conn) do
-    if conn.receive_window_remaining <= conn.receive_window_update_threshold do
+    if conn.receive_window_remaining conn.receive_window_remaining > conn.receive_window_update_threshold<= conn.receive_window_update_threshold do
       increment = conn.receive_window_size - conn.receive_window_remaining
       [window_update(stream_id: 0, window_size_increment: increment) | frames]

[Killed] ComparisonBoundary
lib/mint/http2.ex:1854:38
   end
 
   defp maybe_refill_conn(frames, conn) do
-    if conn.receive_window_remaining <= conn.receive_window_update_threshold do
+    if conn.receive_window_remaining conn.receive_window_remaining < conn.receive_window_update_threshold<= conn.receive_window_update_threshold do
       increment = conn.receive_window_size - conn.receive_window_remaining
       [window_update(stream_id: 0, window_size_increment: increment) | frames]

[Killed] Arithmetic
lib/mint/http2.ex:1855:44
 
   defp maybe_refill_conn(frames, conn) do
     if conn.receive_window_remaining <= conn.receive_window_update_threshold do
-      increment = conn.receive_window_size - conn.receive_window_remaining
+      increment = conn.receive_window_size conn.receive_window_size + conn.receive_window_remaining- conn.receive_window_remaining
       [window_update(stream_id: 0, window_size_increment: increment) | frames]
     else

[Killed] Arithmetic
lib/mint/http2.ex:1855:44
 
   defp maybe_refill_conn(frames, conn) do
     if conn.receive_window_remaining <= conn.receive_window_update_threshold do
-      increment = conn.receive_window_size - conn.receive_window_remaining
+      increment = conn.receive_window_size conn.receive_window_size * conn.receive_window_remaining- conn.receive_window_remaining
       [window_update(stream_id: 0, window_size_increment: increment) | frames]
     else

[Killed] ComparisonNegation
lib/mint/http2.ex:1865:44
   defp maybe_refill_stream(frames, conn, stream_id) do
     case Map.fetch(conn.streams, stream_id) do
       {:ok, stream} ->
-        if stream.receive_window_remaining <= conn.receive_window_update_threshold do
+        if stream.receive_window_remaining stream.receive_window_remaining > conn.receive_window_update_threshold<= conn.receive_window_update_threshold do
           increment = stream.receive_window_size - stream.receive_window_remaining
 

[Killed] ComparisonBoundary
lib/mint/http2.ex:1865:44
   defp maybe_refill_stream(frames, conn, stream_id) do
     case Map.fetch(conn.streams, stream_id) do
       {:ok, stream} ->
-        if stream.receive_window_remaining <= conn.receive_window_update_threshold do
+        if stream.receive_window_remaining stream.receive_window_remaining < conn.receive_window_update_threshold<= conn.receive_window_update_threshold do
           increment = stream.receive_window_size - stream.receive_window_remaining
 

[Killed] Arithmetic
lib/mint/http2.ex:1866:50
     case Map.fetch(conn.streams, stream_id) do
       {:ok, stream} ->
         if stream.receive_window_remaining <= conn.receive_window_update_threshold do
-          increment = stream.receive_window_size - stream.receive_window_remaining
+          increment = stream.receive_window_size stream.receive_window_size + stream.receive_window_remaining- stream.receive_window_remaining
 
           [

[Killed] Arithmetic
lib/mint/http2.ex:1866:50
     case Map.fetch(conn.streams, stream_id) do
       {:ok, stream} ->
         if stream.receive_window_remaining <= conn.receive_window_update_threshold do
-          increment = stream.receive_window_size - stream.receive_window_remaining
+          increment = stream.receive_window_size stream.receive_window_size * stream.receive_window_remaining- stream.receive_window_remaining
 
           [

[Killed] ComparisonNegation
lib/mint/http2.ex:1972:24
           # :reserved_remote means that this was a promised stream. As soon as headers come,
           # the stream goes in the :half_closed_local state (unless it's not allowed because
           # of the client's max concurrent streams limit, or END_STREAM is set).
-          stream.state == :reserved_remote ->
+          stream.state stream.state != :reserved_remote== :reserved_remote ->
             cond do
               conn.open_server_stream_count >= conn.client_settings.max_concurrent_streams ->

[Killed] ComparisonBoundary
lib/mint/http2.ex:1974:45
           # of the client's max concurrent streams limit, or END_STREAM is set).
           stream.state == :reserved_remote ->
             cond do
-              conn.open_server_stream_count >= conn.client_settings.max_concurrent_streams ->
+              conn.open_server_stream_count conn.open_server_stream_count > conn.client_settings.max_concurrent_streams>= conn.client_settings.max_concurrent_streams ->
                 conn = close_stream!(conn, stream.id, :refused_stream)
                 {conn, responses}

[Killed] ComparisonNegation
lib/mint/http2.ex:1974:45
           # of the client's max concurrent streams limit, or END_STREAM is set).
           stream.state == :reserved_remote ->
             cond do
-              conn.open_server_stream_count >= conn.client_settings.max_concurrent_streams ->
+              conn.open_server_stream_count conn.open_server_stream_count < conn.client_settings.max_concurrent_streams>= conn.client_settings.max_concurrent_streams ->
                 conn = close_stream!(conn, stream.id, :refused_stream)
                 {conn, responses}

[Killed] ComparisonNegation
lib/mint/http2.ex:2037:80
 
   defp join_cookie_headers(headers) do
     # If we have 0 or 1 Cookie headers, we just use the old list of headers.
-    case Enum.split_with(headers, fn {name, _value} -> Headers.lower_raw(name) == "cookie" end) do
+    case Enum.split_with(headers, fn {name, _value} -> Headers.lower_raw(name) Headers.lower_raw(name) != "cookie"== "cookie" end) do
       {[], _headers} ->
         headers

[Killed] ComparisonNegation
lib/mint/http2.ex:2071:23
         # it, so that if we get things like DATA on that stream we error out.
         conn = delete_stream(conn, stream)
 
-        if error_code == :no_error do
+        if error_code error_code != :no_error== :no_error do
           {conn, [{:done, stream.ref} | responses]}
         else

[Killed] ComparisonNegation
lib/mint/http2.ex:2111:32
         put_in(conn.server_settings.max_concurrent_streams, max_concurrent_streams)
 
       {:initial_window_size, initial_window_size}, conn ->
-        if initial_window_size > @max_window_size do
+        if initial_window_size initial_window_size <= @max_window_size> @max_window_size do
           debug_data = "INITIAL_WINDOW_SIZE setting of #{initial_window_size} is too big"
           send_connection_error!(conn, :flow_control_error, debug_data)

[Survived] ComparisonBoundary
lib/mint/http2.ex:2111:32
         put_in(conn.server_settings.max_concurrent_streams, max_concurrent_streams)
 
       {:initial_window_size, initial_window_size}, conn ->
-        if initial_window_size > @max_window_size do
+        if initial_window_size initial_window_size >= @max_window_size> @max_window_size do
           debug_data = "INITIAL_WINDOW_SIZE setting of #{initial_window_size} is too big"
           send_connection_error!(conn, :flow_control_error, debug_data)

[Killed] UnaryNot
lib/mint/http2.ex:2119:27
         update_server_initial_window_size(conn, initial_window_size)
 
       {:max_frame_size, max_frame_size}, conn ->
-        if max_frame_size not in @valid_max_frame_size_range do
+        if max_frame_size max_frame_size in @valid_max_frame_size_rangenot in @valid_max_frame_size_range do
           debug_data = "MAX_FRAME_SIZE setting parameter outside of allowed range"
           send_connection_error!(conn, :protocol_error, debug_data)

[Survived] Arithmetic
lib/mint/http2.ex:2166:20
   end
 
   defp update_server_initial_window_size(conn, new_iws) do
-    diff = new_iws - conn.server_settings.initial_window_size
+    diff = new_iws new_iws + conn.server_settings.initial_window_size- conn.server_settings.initial_window_size
 
     conn =

[Survived] Arithmetic
lib/mint/http2.ex:2166:20
   end
 
   defp update_server_initial_window_size(conn, new_iws) do
-    diff = new_iws - conn.server_settings.initial_window_size
+    diff = new_iws new_iws * conn.server_settings.initial_window_size- conn.server_settings.initial_window_size
 
     conn =

[Killed] Arithmetic
lib/mint/http2.ex:2173:54
         for {stream_id, stream} <- streams,
             stream.state in [:open, :half_closed_remote],
             into: streams do
-          send_window_size = stream.send_window_size + diff
+          send_window_size = stream.send_window_size stream.send_window_size - diff+ diff
 
           if send_window_size > @max_window_size do

[Survived] Arithmetic
lib/mint/http2.ex:2173:54
         for {stream_id, stream} <- streams,
             stream.state in [:open, :half_closed_remote],
             into: streams do
-          send_window_size = stream.send_window_size + diff
+          send_window_size = stream.send_window_size stream.send_window_size * diff+ diff
 
           if send_window_size > @max_window_size do

[Survived] ComparisonNegation
lib/mint/http2.ex:2175:31
             into: streams do
           send_window_size = stream.send_window_size + diff
 
-          if send_window_size > @max_window_size do
+          if send_window_size send_window_size <= @max_window_size> @max_window_size do
             debug_data =
               "INITIAL_WINDOW_SIZE parameter of #{send_window_size} makes some window sizes too big"

[Survived] ComparisonBoundary
lib/mint/http2.ex:2175:31
             into: streams do
           send_window_size = stream.send_window_size + diff
 
-          if send_window_size > @max_window_size do
+          if send_window_size send_window_size >= @max_window_size> @max_window_size do
             debug_data =
               "INITIAL_WINDOW_SIZE parameter of #{send_window_size} makes some window sizes too big"

[Killed] Arithmetic
lib/mint/http2.ex:2190:20
   end
 
   defp update_client_initial_window_size(conn, new_iws) do
-    diff = new_iws - conn.client_settings.initial_window_size
+    diff = new_iws new_iws * conn.client_settings.initial_window_size- conn.client_settings.initial_window_size
 
     conn =
