[Killed] Arithmetic
lib/mint/http2.ex:2190:20
   end
 
   defp update_client_initial_window_size(conn, new_iws) do
-    diff = new_iws - conn.client_settings.initial_window_size
+    diff = new_iws new_iws + conn.client_settings.initial_window_size- conn.client_settings.initial_window_size
 
     conn =

[Killed] Arithmetic
lib/mint/http2.ex:2197:60
         for {stream_id, stream} <- streams,
             stream.state in [:open, :half_closed_local, :reserved_remote],
             into: streams do
-          receive_window_size = stream.receive_window_size + diff
+          receive_window_size = stream.receive_window_size stream.receive_window_size - diff+ diff
 
           {stream_id, %{stream | receive_window_size: receive_window_size}}

[Killed] Arithmetic
lib/mint/http2.ex:2197:60
         for {stream_id, stream} <- streams,
             stream.state in [:open, :half_closed_local, :reserved_remote],
             into: streams do
-          receive_window_size = stream.receive_window_size + diff
+          receive_window_size = stream.receive_window_size stream.receive_window_size * diff+ diff
 
           {stream_id, %{stream | receive_window_size: receive_window_size}}

[Killed] UnaryNot
lib/mint/http2.ex:2271:7
 
   defp assert_valid_promised_stream_id(conn, promised_stream_id) do
     cond do
-      not is_integer(promised_stream_id) or Integer.is_odd(promised_stream_id) ->
+      is_integer(promised_stream_id)not is_integer(promised_stream_id) or Integer.is_odd(promised_stream_id) ->
         debug_data = "invalid promised stream ID: #{inspect(promised_stream_id)}"
         send_connection_error!(conn, :protocol_error, debug_data)

[Survived] Boolean
lib/mint/http2.ex:2271:42
 
   defp assert_valid_promised_stream_id(conn, promised_stream_id) do
     cond do
-      not is_integer(promised_stream_id) or Integer.is_odd(promised_stream_id) ->
+      not is_integer(promised_stream_id) not is_integer(promised_stream_id) and Integer.is_odd(promised_stream_id)or Integer.is_odd(promised_stream_id) ->
         debug_data = "invalid promised stream ID: #{inspect(promised_stream_id)}"
         send_connection_error!(conn, :protocol_error, debug_data)

[Killed] Arithmetic
lib/mint/http2.ex:2357:45
          window_update(stream_id: 0, window_size_increment: wsi),
          responses
        ) do
-    new_window_size = conn.send_window_size + wsi
+    new_window_size = conn.send_window_size conn.send_window_size - wsi+ wsi
 
     if new_window_size > @max_window_size do

[Survived] Arithmetic
lib/mint/http2.ex:2357:45
          window_update(stream_id: 0, window_size_increment: wsi),
          responses
        ) do
-    new_window_size = conn.send_window_size + wsi
+    new_window_size = conn.send_window_size conn.send_window_size * wsi+ wsi
 
     if new_window_size > @max_window_size do

[Killed] ComparisonNegation
lib/mint/http2.ex:2359:24
        ) do
     new_window_size = conn.send_window_size + wsi
 
-    if new_window_size > @max_window_size do
+    if new_window_size new_window_size <= @max_window_size> @max_window_size do
       send_connection_error!(conn, :flow_control_error, "window size too big")
     else

[Survived] ComparisonBoundary
lib/mint/http2.ex:2359:24
        ) do
     new_window_size = conn.send_window_size + wsi
 
-    if new_window_size > @max_window_size do
+    if new_window_size new_window_size >= @max_window_size> @max_window_size do
       send_connection_error!(conn, :flow_control_error, "window size too big")
     else

[Killed] Arithmetic
lib/mint/http2.ex:2373:64
          responses
        ) do
     stream = fetch_stream!(conn, stream_id)
-    new_window_size = conn.streams[stream_id].send_window_size + wsi
+    new_window_size = conn.streams[stream_id].send_window_size conn.streams[stream_id].send_window_size - wsi+ wsi
 
     if new_window_size > @max_window_size do

[Killed] Arithmetic
lib/mint/http2.ex:2373:64
          responses
        ) do
     stream = fetch_stream!(conn, stream_id)
-    new_window_size = conn.streams[stream_id].send_window_size + wsi
+    new_window_size = conn.streams[stream_id].send_window_size conn.streams[stream_id].send_window_size * wsi+ wsi
 
     if new_window_size > @max_window_size do

[Killed] ComparisonNegation
lib/mint/http2.ex:2430:16
       cond do
         # If the stream is ended on both sides, it is already deemed closed and
         # there's no need to send a RST_STREAM frame
-        reason == :remote_end_stream and stream.state == :half_closed_local ->
+        reason reason != :remote_end_stream== :remote_end_stream and stream.state == :half_closed_local ->
           conn
 

[Killed] Boolean
lib/mint/http2.ex:2430:38
       cond do
         # If the stream is ended on both sides, it is already deemed closed and
         # there's no need to send a RST_STREAM frame
-        reason == :remote_end_stream and stream.state == :half_closed_local ->
+        reason == :remote_end_stream reason == :remote_end_stream or stream.state == :half_closed_localand stream.state == :half_closed_local ->
           conn
 

[Killed] ComparisonNegation
lib/mint/http2.ex:2436:34
         # We send a RST_STREAM with the given error code so that we move the
         # stream to the :closed state (that is, we remove it).
         open?(conn) ->
-          error_code = if reason == :remote_end_stream, do: :no_error, else: reason
+          error_code = if reason reason != :remote_end_stream== :remote_end_stream, do: :no_error, else: reason
           rst_stream_frame = rst_stream(stream_id: stream_id, error_code: error_code)
           send!(conn, Frame.encode(rst_stream_frame))

[Survived] Boolean
lib/mint/http2.ex:2457:22
     conn =
       cond do
         # Stream initiated by the client.
-        stream_open? and Integer.is_odd(stream.id) ->
+        stream_open? stream_open? or Integer.is_odd(stream.id)and Integer.is_odd(stream.id) ->
           update_in(conn.open_client_stream_count, &(&1 - 1))
 

[Survived] Boolean
lib/mint/http2.ex:2461:22
           update_in(conn.open_client_stream_count, &(&1 - 1))
 
         # Stream initiated by the server.
-        stream_open? and Integer.is_even(stream.id) ->
+        stream_open? stream_open? or Integer.is_even(stream.id)and Integer.is_even(stream.id) ->
           update_in(conn.open_server_stream_count, &(&1 - 1))
 

[Killed] UnaryNot
lib/mint/http2.ex:2479:14
   end
 
   defp assert_stream_in_state(conn, %{state: state}, expected_states) do
-    if state not in expected_states do
+    if state state in expected_statesnot in expected_states do
       debug_data =
         "stream was in state #{inspect(state)} and not in one of the expected states: " <>
