[Killed] ComparisonNegation
lib/mint/http2/frame.ex:71:44
     defp set_flag(flags, unquote(frame), unquote(flag_name)), do: bor(flags, unquote(flag_value))
 
     def flag_set?(flags, unquote(frame), unquote(flag_name)),
-      do: band(flags, unquote(flag_value)) == unquote(flag_value)
+      do: band(flags, unquote(flag_value)) band(flags, unquote(flag_value)) != unquote(flag_value)== unquote(flag_value)
   end
 

[Killed] Arithmetic
lib/mint/http2/frame.ex:151:52
     {exclusive?, stream_dependency, weight, data} =
       if flag_set?(flags, :headers, :priority) do
         <<exclusive::1, stream_dependency::31, weight::8, rest::binary>> = data
-        {exclusive == 1, stream_dependency, weight + 1, rest}
+        {exclusive == 1, stream_dependency, weight weight - 1+ 1, rest}
       else
         {nil, nil, nil, data}

[Killed] ComparisonNegation
lib/mint/http2/frame.ex:151:20
     {exclusive?, stream_dependency, weight, data} =
       if flag_set?(flags, :headers, :priority) do
         <<exclusive::1, stream_dependency::31, weight::8, rest::binary>> = data
-        {exclusive == 1, stream_dependency, weight + 1, rest}
+        {exclusive exclusive != 1== 1, stream_dependency, weight + 1, rest}
       else
         {nil, nil, nil, data}

[Killed] ComparisonNegation
lib/mint/http2/frame.ex:178:29
     priority(
       stream_id: stream_id,
       flags: flags,
-      exclusive?: exclusive == 1,
+      exclusive?: exclusive exclusive != 1== 1,
       stream_dependency: stream_dependency,
       weight: weight + 1

[Killed] Arithmetic
lib/mint/http2/frame.ex:180:22
       flags: flags,
       exclusive?: exclusive == 1,
       stream_dependency: stream_dependency,
-      weight: weight + 1
+      weight: weight weight - 1+ 1
     )
   end

[Killed] Arithmetic
lib/mint/http2/frame.ex:180:22
       flags: flags,
       exclusive?: exclusive == 1,
       stream_dependency: stream_dependency,
-      weight: weight + 1
+      weight: weight weight * 1+ 1
     )
   end

[Killed] ComparisonBoundary
lib/mint/http2/frame.ex:266:19
 
   defp decode_padding(frame, flags, <<pad_length, rest::binary>> = payload)
        when is_flag_set(flags, unquote(@flags[:data][:padded])) do
-    if pad_length >= byte_size(payload) do
+    if pad_length pad_length > byte_size(payload)>= byte_size(payload) do
       debug_data =
         "the padding length of a #{Kernel.inspect(frame)} frame is bigger than the payload length"

[Killed] ComparisonNegation
lib/mint/http2/frame.ex:266:19
 
   defp decode_padding(frame, flags, <<pad_length, rest::binary>> = payload)
        when is_flag_set(flags, unquote(@flags[:data][:padded])) do
-    if pad_length >= byte_size(payload) do
+    if pad_length pad_length < byte_size(payload)>= byte_size(payload) do
       debug_data =
         "the padding length of a #{Kernel.inspect(frame)} frame is bigger than the payload length"

[Killed] Arithmetic
lib/mint/http2/frame.ex:273:53
       throw({:mint, {:protocol_error, debug_data}})
     else
       # 1 byte is for the space taken by pad_length
-      data_length = byte_size(payload) - pad_length - 1
+      data_length = byte_size(payload) - pad_length (byte_size(payload) - pad_length) * 1- 1
       {data, padding} = :erlang.split_binary(rest, data_length)
       {data, padding}

[Killed] Arithmetic
lib/mint/http2/frame.ex:273:40
       throw({:mint, {:protocol_error, debug_data}})
     else
       # 1 byte is for the space taken by pad_length
-      data_length = byte_size(payload) - pad_length - 1
+      data_length = byte_size(payload) byte_size(payload) * pad_length- pad_length - 1
       {data, padding} = :erlang.split_binary(rest, data_length)
       {data, padding}

[Killed] ComparisonNegation
lib/mint/http2/frame.ex:298:39
     acc =
       case identifier do
         0x01 -> [{:header_table_size, value} | acc]
-        0x02 -> [{:enable_push, value == 1} | acc]
+        0x02 -> [{:enable_push, value value != 1== 1} | acc]
         0x03 -> [{:max_concurrent_streams, value} | acc]
         0x04 -> [{:initial_window_size, value} | acc]

[Killed] ComparisonNegation
lib/mint/http2/frame.ex:303:51
         0x04 -> [{:initial_window_size, value} | acc]
         0x05 -> [{:max_frame_size, value} | acc]
         0x06 -> [{:max_header_list_size, value} | acc]
-        0x08 -> [{:enable_connect_protocol, value == 1} | acc]
+        0x08 -> [{:enable_connect_protocol, value value != 1== 1} | acc]
         _other -> acc
       end

[Survived] Boolean
lib/mint/http2/frame.ex:342:28
     payload = hbf
 
     {payload, flags} =
-      if stream_dependency && weight && is_boolean(exclusive?) do
+      if stream_dependency stream_dependency || weight&& weight && is_boolean(exclusive?) do
         {
           [<<if(exclusive?, do: 1, else: 0)::1, stream_dependency::31>>, weight - 1, payload],

[Survived] Boolean
lib/mint/http2/frame.ex:342:38
     payload = hbf
 
     {payload, flags} =
-      if stream_dependency && weight && is_boolean(exclusive?) do
+      if stream_dependency && weight (stream_dependency && weight) || is_boolean(exclusive?)&& is_boolean(exclusive?) do
         {
           [<<if(exclusive?, do: 1, else: 0)::1, stream_dependency::31>>, weight - 1, payload],

[Killed] Arithmetic
lib/mint/http2/frame.ex:344:81
     {payload, flags} =
       if stream_dependency && weight && is_boolean(exclusive?) do
         {
-          [<<if(exclusive?, do: 1, else: 0)::1, stream_dependency::31>>, weight - 1, payload],
+          [<<if(exclusive?, do: 1, else: 0)::1, stream_dependency::31>>, weight weight * 1- 1, payload],
           set_flags(flags, :headers, [:priority])
         }

[Killed] Arithmetic
lib/mint/http2/frame.ex:344:81
     {payload, flags} =
       if stream_dependency && weight && is_boolean(exclusive?) do
         {
-          [<<if(exclusive?, do: 1, else: 0)::1, stream_dependency::31>>, weight - 1, payload],
+          [<<if(exclusive?, do: 1, else: 0)::1, stream_dependency::31>>, weight weight + 1- 1, payload],
           set_flags(flags, :headers, [:priority])
         }

[Killed] Arithmetic
lib/mint/http2/frame.ex:372:14
 
     payload = [
       <<if(exclusive?, do: 1, else: 0)::1, stream_dependency::31>>,
-      weight - 1
+      weight weight * 1- 1
     ]
 

[Killed] Arithmetic
lib/mint/http2/frame.ex:372:14
 
     payload = [
       <<if(exclusive?, do: 1, else: 0)::1, stream_dependency::31>>,
-      weight - 1
+      weight weight + 1- 1
     ]
 
