[Survived] ComparisonBoundary
lib/mint/transport_error.ex:52:29
     end
 
   reason_type =
-    if System.otp_release() >= "21" do
+    if System.otp_release() System.otp_release() > "21">= "21" do
       quote do: unquote(reason_type) | :ssl.error_alert()
     else

[Survived] ComparisonNegation
lib/mint/transport_error.ex:52:29
     end
 
   reason_type =
-    if System.otp_release() >= "21" do
+    if System.otp_release() System.otp_release() < "21">= "21" do
       quote do: unquote(reason_type) | :ssl.error_alert()
     else
