[Survived] Arithmetic
lib/mint/tunnel_proxy.ex:55:32
   end
 
   defp receive_response(conn, ref, timeout_deadline) do
-    timeout = timeout_deadline - System.monotonic_time(:millisecond)
+    timeout = timeout_deadline timeout_deadline + System.monotonic_time(:millisecond)- System.monotonic_time(:millisecond)
     socket = HTTP1.get_socket(conn)
 

[Survived] Arithmetic
lib/mint/tunnel_proxy.ex:55:32
   end
 
   defp receive_response(conn, ref, timeout_deadline) do
-    timeout = timeout_deadline - System.monotonic_time(:millisecond)
+    timeout = timeout_deadline timeout_deadline * System.monotonic_time(:millisecond)- System.monotonic_time(:millisecond)
     socket = HTTP1.get_socket(conn)
 

[Killed] GuardComparisonNegation
lib/mint/tunnel_proxy.ex:95:38
       {:status, ^ref, status} ->
         {:error, wrap_error({:proxy, {:unexpected_status, status}})}
 
-      {:headers, ^ref, headers} when responses == [] ->
+      {:headers, ^ref, headers} when responses != [] ->
         {:done, headers}
 

[Survived] Arithmetic
lib/mint/tunnel_proxy.ex:112:41
 
   defp timeout_deadline(opts) do
     timeout = Keyword.get(opts, :tunnel_timeout, @tunnel_timeout)
-    System.monotonic_time(:millisecond) + timeout
+    System.monotonic_time(:millisecond) System.monotonic_time(:millisecond) * timeout+ timeout
   end
 

[Survived] Arithmetic
lib/mint/tunnel_proxy.ex:112:41
 
   defp timeout_deadline(opts) do
     timeout = Keyword.get(opts, :tunnel_timeout, @tunnel_timeout)
-    System.monotonic_time(:millisecond) + timeout
+    System.monotonic_time(:millisecond) System.monotonic_time(:millisecond) - timeout+ timeout
   end
 
