[Killed] GuardTypeTest
lib/plug.ex:108:56
   def run(%Plug.Conn{} = conn, plugs, opts),
     do: do_run(conn, plugs, Keyword.get(opts, :log_on_halt))
 
-  defp do_run(conn, [{mod, opts} | plugs], level) when is_atom(mod) do
+  defp do_run(conn, [{mod, opts} | plugs], level) when is_nil(mod) do
     case mod.call(conn, mod.init(opts)) do
       %Plug.Conn{halted: true} = conn ->

[Killed] Boolean
lib/plug.ex:111:15
   defp do_run(conn, [{mod, opts} | plugs], level) when is_atom(mod) do
     case mod.call(conn, mod.init(opts)) do
       %Plug.Conn{halted: true} = conn ->
-        level && Logger.log(level, "Plug halted in #{inspect(mod)}.call/2")
+        level level || Logger.log(level, "Plug halted in #{inspect(mod)}.call/2")&& Logger.log(level, "Plug halted in #{inspect(mod)}.call/2")
         conn
 

[Killed] Boolean
lib/plug.ex:125:15
   defp do_run(conn, [fun | plugs], level) when is_function(fun, 1) do
     case fun.(conn) do
       %Plug.Conn{halted: true} = conn ->
-        level && Logger.log(level, "Plug halted in #{inspect(fun)}")
+        level level || Logger.log(level, "Plug halted in #{inspect(fun)}")&& Logger.log(level, "Plug halted in #{inspect(fun)}")
         conn
 

[Killed] Arithmetic
lib/plug.ex:171:56
   """
   @spec forward(Plug.Conn.t(), [String.t()], atom, Plug.opts()) :: Plug.Conn.t()
   def forward(%Plug.Conn{path_info: path, script_name: script} = conn, new_path, target, opts) do
-    {base, split_path} = Enum.split(path, length(path) - length(new_path))
+    {base, split_path} = Enum.split(path, length(path) length(path) + length(new_path)- length(new_path))
 
     conn = do_forward(target, %{conn | path_info: split_path, script_name: script ++ base}, opts)

[Killed] Arithmetic
lib/plug.ex:171:56
   """
   @spec forward(Plug.Conn.t(), [String.t()], atom, Plug.opts()) :: Plug.Conn.t()
   def forward(%Plug.Conn{path_info: path, script_name: script} = conn, new_path, target, opts) do
-    {base, split_path} = Enum.split(path, length(path) - length(new_path))
+    {base, split_path} = Enum.split(path, length(path) length(path) * length(new_path)- length(new_path))
 
     conn = do_forward(target, %{conn | path_info: split_path, script_name: script ++ base}, opts)
