[Killed] GuardTypeTest
lib/plug/builder.ex:199:34
     end
   end
 
-  defp traverse(tuple, ref) when is_tuple(tuple) do
+  defp traverse(tuple, ref) when is_list(tuple) do
     tuple |> Tuple.to_list() |> traverse(ref) |> List.to_tuple()
   end

[Killed] GuardTypeTest
lib/plug/builder.ex:203:32
     tuple |> Tuple.to_list() |> traverse(ref) |> List.to_tuple()
   end
 
-  defp traverse(map, ref) when is_map(map) do
+  defp traverse(map, ref) when is_list(map) do
     map |> Map.to_list() |> traverse(ref) |> Map.new()
   end

[Killed] GuardTypeTest
lib/plug/builder.ex:207:33
     map |> Map.to_list() |> traverse(ref) |> Map.new()
   end
 
-  defp traverse(list, ref) when is_list(list) do
+  defp traverse(list, ref) when is_tuple(list) do
     Enum.map(list, &traverse(&1, ref))
   end

[Killed] Boolean
lib/plug/builder.ex:270:34
 
   @doc false
   def __builder_opts__(module) do
-    get_plug_builder_ref(module) || generate_plug_builder_ref(module)
+    get_plug_builder_ref(module) get_plug_builder_ref(module) && generate_plug_builder_ref(module)|| generate_plug_builder_ref(module)
   end
 

[Killed] Boolean
lib/plug/builder.ex:309:42
           {Macro.t(), Macro.t()}
   def compile(env, pipeline, builder_opts) do
     conn = quote do: conn
-    init_mode = builder_opts[:init_mode] || :compile
+    init_mode = builder_opts[:init_mode] builder_opts[:init_mode] && :compile|| :compile
 
     unless init_mode in [:compile, :runtime] do
