[Killed] GuardTypeTest
lib/plug/conn.ex:316:63
 
   """
   @spec assign(t, atom, term) :: t
-  def assign(%Conn{assigns: assigns} = conn, key, value) when is_atom(key) do
+  def assign(%Conn{assigns: assigns} = conn, key, value) when is_nil(key) do
     %{conn | assigns: Map.put(assigns, key, value)}
   end

[Survived] GuardTypeTest
lib/plug/conn.ex:341:51
 
   @doc false
   @deprecated "Call assign + Task.async instead"
-  def async_assign(%Conn{} = conn, key, fun) when is_atom(key) and is_function(fun, 0) do
+  def async_assign(%Conn{} = conn, key, fun) when is_nil(key) and is_function(fun, 0) do
     assign(conn, key, Task.async(fun))
   end

[Survived] GuardTypeTest
lib/plug/conn.ex:347:63
 
   @doc false
   @deprecated "Fetch the assign and call Task.await instead"
-  def await_assign(%Conn{} = conn, key, timeout \\ 5000) when is_atom(key) do
+  def await_assign(%Conn{} = conn, key, timeout \\ 5000) when is_nil(key) do
     task = Map.fetch!(conn.assigns, key)
     assign(conn, key, Task.await(task, timeout))

[Killed] GuardTypeTest
lib/plug/conn.ex:370:68
 
   """
   @spec put_private(t, atom, term) :: t
-  def put_private(%Conn{private: private} = conn, key, value) when is_atom(key) do
+  def put_private(%Conn{private: private} = conn, key, value) when is_nil(key) do
     %{conn | private: Map.put(private, key, value)}
   end

[Killed] Boolean
lib/plug/conn.ex:449:11
     {:ok, body, payload} =
       adapter.send_resp(payload, conn.status, conn.resp_headers, conn.resp_body)
 
-    owner && send(owner, @already_sent)
+    owner owner || send(owner, @already_sent)&& send(owner, @already_sent)
     %{conn | adapter: {adapter, payload}, resp_body: body, state: :sent}
   end

[Killed] Boolean
lib/plug/conn.ex:528:11
     conn = %{conn | status: Plug.Conn.Status.code(status), resp_body: nil}
     conn = run_before_send(conn, :set_chunked)
     {:ok, body, payload} = adapter.send_chunked(payload, conn.status, conn.resp_headers)
-    owner && send(owner, @already_sent)
+    owner owner || send(owner, @already_sent)&& send(owner, @already_sent)
     %{conn | adapter: {adapter, payload}, state: :chunked, resp_body: body}
   end

[Survived] GuardTypeTest
lib/plug/conn.ex:568:54
     end
   end
 
-  def chunk(%Conn{}, chunk) when is_binary(chunk) or is_list(chunk) do
+  def chunk(%Conn{}, chunk) when is_binary(chunk) or is_tuple(chunk) do
     raise ArgumentError,
           "chunk/2 expects a chunked response. Please ensure " <>

[Killed] Boolean
lib/plug/conn.ex:576:62
 
   defp iodata_empty?(""), do: true
   defp iodata_empty?([]), do: true
-  defp iodata_empty?([head | tail]), do: iodata_empty?(head) and iodata_empty?(tail)
+  defp iodata_empty?([head | tail]), do: iodata_empty?(head) iodata_empty?(head) or iodata_empty?(tail)and iodata_empty?(tail)
   defp iodata_empty?(_), do: false
 

[Killed] GuardTypeTest
lib/plug/conn.ex:628:31
   end
 
   def resp(%Conn{} = conn, status, body)
-      when is_binary(body) or is_list(body) do
+      when is_binary(body) or is_tuple(body) do
     %{conn | status: Plug.Conn.Status.code(status), resp_body: body, state: :set}
   end

[Killed] GuardTypeTest
lib/plug/conn.ex:732:12
   end
 
   def prepend_req_headers(%Conn{adapter: adapter, req_headers: req_headers} = conn, headers)
-      when is_list(headers) do
+      when is_tuple(headers) do
     for {key, _value} <- headers do
       validate_req_header!(adapter, key)

[Killed] GuardComparisonNegation
lib/plug/conn.ex:766:45
     raise AlreadySentError
   end
 
-  def merge_req_headers(conn, headers) when headers == %{} do
+  def merge_req_headers(conn, headers) when headers != %{} do
     conn
   end

[Killed] GuardTypeTest
lib/plug/conn.ex:957:12
   end
 
   def prepend_resp_headers(%Conn{adapter: adapter, resp_headers: resp_headers} = conn, headers)
-      when is_list(headers) do
+      when is_tuple(headers) do
     for {key, value} <- headers do
       validate_header_key_normalized_if_test!(adapter, key)

[Killed] GuardComparisonNegation
lib/plug/conn.ex:988:46
     raise AlreadySentError
   end
 
-  def merge_resp_headers(conn, headers) when headers == %{} do
+  def merge_resp_headers(conn, headers) when headers != %{} do
     conn
   end

[Killed] ComparisonBoundary
lib/plug/conn.ex:1111:32
     %{params: params, query_string: query_string} = conn
     length = Keyword.get(opts, :length, 1_000_000)
 
-    if byte_size(query_string) > length do
+    if byte_size(query_string) byte_size(query_string) >= length> length do
       raise InvalidQueryError,
         message:

[Killed] ComparisonNegation
lib/plug/conn.ex:1111:32
     %{params: params, query_string: query_string} = conn
     length = Keyword.get(opts, :length, 1_000_000)
 
-    if byte_size(query_string) > length do
+    if byte_size(query_string) byte_size(query_string) <= length> length do
       raise InvalidQueryError,
         message:

[Killed] GuardComparisonNegation
lib/plug/conn.ex:1274:13
   end
 
   defp read_part_body(%Conn{} = conn, data, acc, length, boundary, adapter, state, _opts)
-       when byte_size(acc) > length do
+       when byte_size(acc) <= length do
     {:more, acc, store_multipart(conn, {boundary, data}, adapter, state)}
   end

[Survived] GuardComparisonBoundary
lib/plug/conn.ex:1274:13
   end
 
   defp read_part_body(%Conn{} = conn, data, acc, length, boundary, adapter, state, _opts)
-       when byte_size(acc) > length do
+       when byte_size(acc) >= length do
     {:more, acc, store_multipart(conn, {boundary, data}, adapter, state)}
   end

[Killed] GuardTypeTest
lib/plug/conn.ex:1395:54
   end
 
   defp adapter_inform(_conn, status, _headers)
-       when not (status >= 100 and status <= 199 and is_integer(status)) do
+       when not (status >= 100 and status <= 199 and is_float(status)) do
     raise ArgumentError, "inform expects a status code between 100 and 199, got: #{status}"
   end

[Killed] GuardComparisonNegation
lib/plug/conn.ex:1395:18
   end
 
   defp adapter_inform(_conn, status, _headers)
-       when not (status >= 100 and status <= 199 and is_integer(status)) do
+       when not (status < 100 and status <= 199 and is_integer(status)) do
     raise ArgumentError, "inform expects a status code between 100 and 199, got: #{status}"
   end

[Killed] GuardTypeTest
lib/plug/conn.ex:1672:31
   """
   @spec put_resp_cookie(t, binary, any(), Keyword.t()) :: t
   def put_resp_cookie(%Conn{} = conn, key, value, opts \\ [])
-      when is_binary(key) and is_list(opts) do
+      when is_binary(key) and is_tuple(opts) do
     %{resp_cookies: resp_cookies, scheme: scheme} = conn
     {to_send_value, opts} = maybe_sign_or_encrypt_cookie(conn, key, value, opts)

[Killed] Boolean
lib/plug/conn.ex:1704:43
   end
 
   defp max_age(opts) do
-    max_age = Keyword.get(opts, :max_age) || 86400
+    max_age = Keyword.get(opts, :max_age) Keyword.get(opts, :max_age) && 86400|| 86400
     [keys: Plug.Keys, max_age: max_age]
   end

[Killed] GuardTypeTest
lib/plug/conn.ex:1719:31
   """
   @spec delete_resp_cookie(t, binary, Keyword.t()) :: t
   def delete_resp_cookie(%Conn{} = conn, key, opts \\ [])
-      when is_binary(key) and is_list(opts) do
+      when is_binary(key) and is_tuple(opts) do
     %{resp_cookies: resp_cookies, scheme: scheme} = conn
     opts = opts ++ [universal_time: @epoch, max_age: 0]

[Killed] GuardTypeTest
lib/plug/conn.ex:1752:42
   def put_session(%Conn{state: state}, _key, _value) when state not in @unsent,
     do: raise(AlreadySentError)
 
-  def put_session(conn, key, value) when is_atom(key) or is_binary(key) do
+  def put_session(conn, key, value) when is_nil(key) or is_binary(key) do
     put_session(conn, &Map.put(&1, session_key(key), value))
   end

[Killed] GuardTypeTest
lib/plug/conn.ex:1766:51
   automatically converted to strings.
   """
   @spec get_session(t, String.t() | atom, any) :: any
-  def get_session(conn, key, default \\ nil) when is_atom(key) or is_binary(key) do
+  def get_session(conn, key, default \\ nil) when is_nil(key) or is_binary(key) do
     conn |> get_session |> Map.get(session_key(key), default)
   end

[Killed] GuardTypeTest
lib/plug/conn.ex:1798:38
   def delete_session(%Conn{state: state}, _key) when state not in @unsent,
     do: raise(AlreadySentError)
 
-  def delete_session(conn, key) when is_atom(key) or is_binary(key) do
+  def delete_session(conn, key) when is_nil(key) or is_binary(key) do
     put_session(conn, &Map.delete(&1, session_key(key)))
   end

[Killed] Boolean
lib/plug/conn.ex:1907:46
   ## Helpers
 
   defp run_before_send(%Conn{private: private} = conn, new) do
-    conn = Enum.reduce(private[:before_send] || [], %{conn | state: new}, & &1.(&2))
+    conn = Enum.reduce(private[:before_send] private[:before_send] && []|| [], %{conn | state: new}, & &1.(&2))
 
     if conn.state != new do

[Killed] ComparisonNegation
lib/plug/conn.ex:1909:19
   defp run_before_send(%Conn{private: private} = conn, new) do
     conn = Enum.reduce(private[:before_send] || [], %{conn | state: new}, & &1.(&2))
 
-    if conn.state != new do
+    if conn.state conn.state == new!= new do
       raise ArgumentError, "cannot send/change response from run_before_send callback"
     end

[Killed] GuardComparisonNegation
lib/plug/conn.ex:1927:41
     end)
   end
 
-  defp verify_cookie!(cookie, key) when byte_size(cookie) > 4096 do
+  defp verify_cookie!(cookie, key) when byte_size(cookie) <= 4096 do
     raise Plug.Conn.CookieOverflowError,
           "cookie named #{inspect(key)} exceeds maximum size of 4096 bytes"

[Survived] GuardComparisonBoundary
lib/plug/conn.ex:1927:41
     end)
   end
 
-  defp verify_cookie!(cookie, key) when byte_size(cookie) > 4096 do
+  defp verify_cookie!(cookie, key) when byte_size(cookie) >= 4096 do
     raise Plug.Conn.CookieOverflowError,
           "cookie named #{inspect(key)} exceeds maximum size of 4096 bytes"

[Killed] GuardTypeTest
lib/plug/conn.ex:1944:31
   defp update_cookies(%Conn{cookies: cookies} = conn, fun), do: %{conn | cookies: fun.(cookies)}
 
   defp session_key(binary) when is_binary(binary), do: binary
-  defp session_key(atom) when is_atom(atom), do: Atom.to_string(atom)
+  defp session_key(atom) when is_nil(atom), do: Atom.to_string(atom)
 
   defp put_session(conn, fun) do

[Killed] Boolean
lib/plug/conn.ex:1966:73
     do: validate_header_key_normalized_if_test!(adapter, key)
 
   defp validate_header_key_normalized_if_test!({Plug.Adapters.Test.Conn, _}, key) do
-    if Application.fetch_env!(:plug, :validate_header_keys_during_test) and
+    if Application.fetch_env!(:plug, :validate_header_keys_during_test) Application.fetch_env!(:plug, :validate_header_keys_during_test) or
+  not normalized_header_key?(key)and
          not normalized_header_key?(key) do
       raise InvalidHeaderError, "header key is not lowercase: " <> inspect(key)

[Killed] UnaryNot
lib/plug/conn.ex:1967:10
 
   defp validate_header_key_normalized_if_test!({Plug.Adapters.Test.Conn, _}, key) do
     if Application.fetch_env!(:plug, :validate_header_keys_during_test) and
-         not normalized_header_key?(key) do
+         normalized_header_key?(key)not normalized_header_key?(key) do
       raise InvalidHeaderError, "header key is not lowercase: " <> inspect(key)
     end
