[Killed] Boolean
lib/plug/conn/adapter.ex:47:24
       path_info: split_path(path),
       port: port,
       remote_ip: remote_ip,
-      query_string: qs || "",
+      query_string: qs qs && ""|| "",
       req_headers: req_headers,
       request_path: path,

[Killed] ComparisonNegation
lib/plug/conn/adapter.ex:56:38
 
   defp split_path(path) do
     segments = :binary.split(path, "/", [:global])
-    for segment <- segments, segment != "", do: segment
+    for segment <- segments, segment segment == ""!= "", do: segment
   end
 
