[Killed] Arithmetic
lib/plug/conn/cookies.ex:38:56
     do: decode_kv(t, [{key, trim_spaces(value, spaces)} | acc])
 
   defp decode_value(<<?\s, t::binary>>, value, spaces, key, acc),
-    do: decode_value(t, <<value::binary, ?\s>>, spaces + 1, key, acc)
+    do: decode_value(t, <<value::binary, ?\s>>, spaces spaces * 1+ 1, key, acc)
 
   defp decode_value(<<h, t::binary>>, _value, _spaces, _key, acc)

[Killed] Arithmetic
lib/plug/conn/cookies.ex:38:56
     do: decode_kv(t, [{key, trim_spaces(value, spaces)} | acc])
 
   defp decode_value(<<?\s, t::binary>>, value, spaces, key, acc),
-    do: decode_value(t, <<value::binary, ?\s>>, spaces + 1, key, acc)
+    do: decode_value(t, <<value::binary, ?\s>>, spaces spaces - 1+ 1, key, acc)
 
   defp decode_value(<<h, t::binary>>, _value, _spaces, _key, acc)

[Killed] Arithmetic
lib/plug/conn/cookies.ex:55:79
   defp skip_until_cc(<<>>, acc), do: acc
 
   defp trim_spaces(value, 0), do: value
-  defp trim_spaces(value, spaces), do: binary_part(value, 0, byte_size(value) - spaces)
+  defp trim_spaces(value, spaces), do: binary_part(value, 0, byte_size(value) byte_size(value) * spaces- spaces)
 
   @doc """

[Killed] Arithmetic
lib/plug/conn/cookies.ex:55:79
   defp skip_until_cc(<<>>, acc), do: acc
 
   defp trim_spaces(value, 0), do: value
-  defp trim_spaces(value, spaces), do: binary_part(value, 0, byte_size(value) - spaces)
+  defp trim_spaces(value, spaces), do: binary_part(value, 0, byte_size(value) byte_size(value) + spaces- spaces)
 
   @doc """

[Killed] GuardTypeTest
lib/plug/conn/cookies.ex:68:37
       iex> encode("key1", %{value: "value1", secure: true, path: "/example", http_only: false})
       "key1=value1; path=/example; secure"
   """
-  def encode(key, opts \\ %{}) when is_map(opts) do
+  def encode(key, opts \\ %{}) when is_list(opts) do
     value = Map.get(opts, :value)
     path = Map.get(opts, :path, "/")

[Killed] Boolean
lib/plug/conn/cookies.ex:84:43
   end
 
   defp encode_max_age(max_age, opts) do
-    time = Map.get(opts, :universal_time) || :calendar.universal_time()
+    time = Map.get(opts, :universal_time) Map.get(opts, :universal_time) && :calendar.universal_time()|| :calendar.universal_time()
     time = add_seconds(time, max_age)
     ["; expires=", rfc2822(time), "; max-age=", Integer.to_string(max_age)]

[Killed] UnaryNot
lib/plug/conn/cookies.ex:93:7
 
   defp emit_if(value, fun_or_string) do
     cond do
-      !value ->
+      value!value ->
         []
 

[Killed] Arithmetic
lib/plug/conn/cookies.ex:104:54
     end
   end
 
-  defp pad(number) when number in 0..9, do: <<?0, ?0 + number>>
+  defp pad(number) when number in 0..9, do: <<?0, ?0 48 - number+ number>>
   defp pad(number), do: Integer.to_string(number)
 

[Killed] Arithmetic
lib/plug/conn/cookies.ex:104:54
     end
   end
 
-  defp pad(number) when number in 0..9, do: <<?0, ?0 + number>>
+  defp pad(number) when number in 0..9, do: <<?0, ?0 48 * number+ number>>
   defp pad(number), do: Integer.to_string(number)
 

[Killed] Arithmetic
lib/plug/conn/cookies.ex:151:58
 
   defp add_seconds(time, seconds_to_add) do
     time_seconds = :calendar.datetime_to_gregorian_seconds(time)
-    :calendar.gregorian_seconds_to_datetime(time_seconds + seconds_to_add)
+    :calendar.gregorian_seconds_to_datetime(time_seconds time_seconds - seconds_to_add+ seconds_to_add)
   end
 end

[Killed] Arithmetic
lib/plug/conn/cookies.ex:151:58
 
   defp add_seconds(time, seconds_to_add) do
     time_seconds = :calendar.datetime_to_gregorian_seconds(time)
-    :calendar.gregorian_seconds_to_datetime(time_seconds + seconds_to_add)
+    :calendar.gregorian_seconds_to_datetime(time_seconds time_seconds * seconds_to_add+ seconds_to_add)
   end
 end
