[Killed] ComparisonNegation
lib/plug/conn/status.ex:96:24
   end
 
   custom_status_doc =
-    if custom_statuses != %{} do
+    if custom_statuses custom_statuses == %{}!= %{} do
       """
       ## Custom status codes
