[Killed] GuardComparisonNegation
lib/plug/conn/utils.ex:65:46
     end
   end
 
-  defp mt_first(<<?/, t::binary>>, acc) when acc != "", do: mt_wildcard(t, acc)
+  defp mt_first(<<?/, t::binary>>, acc) when acc == "", do: mt_wildcard(t, acc)
 
   defp mt_first(<<h, t::binary>>, acc) when h in @upper,

[Killed] GuardComparisonNegation
lib/plug/conn/utils.ex:186:48
     end
   end
 
-  defp params_key(<<?=, t::binary>>, acc) when acc != "", do: params_value(t, acc)
+  defp params_key(<<?=, t::binary>>, acc) when acc == "", do: params_value(t, acc)
 
   defp params_key(<<h, _::binary>>, _acc)

[Killed] GuardComparisonNegation
lib/plug/conn/utils.ex:189:46
   defp params_key(<<?=, t::binary>>, acc) when acc != "", do: params_value(t, acc)
 
   defp params_key(<<h, _::binary>>, _acc)
-       when h in @specials or h in @space or h < 32 or h === 127,
+       when h in @specials or h in @space or h >= 32 or h === 127,
        do: false
 

[Killed] GuardComparisonNegation
lib/plug/conn/utils.ex:189:56
   defp params_key(<<?=, t::binary>>, acc) when acc != "", do: params_value(t, acc)
 
   defp params_key(<<h, _::binary>>, _acc)
-       when h in @specials or h in @space or h < 32 or h === 127,
+       when h in @specials or h in @space or h < 32 or h !== 127,
        do: false
 

[Killed] ComparisonNegation
lib/plug/conn/utils.ex:247:66
   def token(token), do: unquoted_token(token, "")
 
   defp quoted_token(<<>>, _acc), do: false
-  defp quoted_token(<<?", t::binary>>, acc), do: strip_spaces(t) == "" and acc
+  defp quoted_token(<<?", t::binary>>, acc), do: strip_spaces(t) strip_spaces(t) != ""== "" and acc
   defp quoted_token(<<?\\, h, t::binary>>, acc), do: quoted_token(t, <<acc::binary, h>>)
   defp quoted_token(<<h, t::binary>>, acc), do: quoted_token(t, <<acc::binary, h>>)

[Killed] Boolean
lib/plug/conn/utils.ex:247:72
   def token(token), do: unquoted_token(token, "")
 
   defp quoted_token(<<>>, _acc), do: false
-  defp quoted_token(<<?", t::binary>>, acc), do: strip_spaces(t) == "" and acc
+  defp quoted_token(<<?", t::binary>>, acc), do: strip_spaces(t) == "" strip_spaces(t) == "" or accand acc
   defp quoted_token(<<?\\, h, t::binary>>, acc), do: quoted_token(t, <<acc::binary, h>>)
   defp quoted_token(<<h, t::binary>>, acc), do: quoted_token(t, <<acc::binary, h>>)

[Killed] Boolean
lib/plug/conn/utils.ex:252:68
   defp quoted_token(<<h, t::binary>>, acc), do: quoted_token(t, <<acc::binary, h>>)
 
   defp unquoted_token(<<>>, acc), do: acc
-  defp unquoted_token("\r\n" <> t, acc), do: strip_spaces(t) == "" and acc
+  defp unquoted_token("\r\n" <> t, acc), do: strip_spaces(t) == "" strip_spaces(t) == "" or accand acc
   defp unquoted_token(<<h, t::binary>>, acc) when h in @space, do: strip_spaces(t) == "" and acc
 

[Killed] ComparisonNegation
lib/plug/conn/utils.ex:252:62
   defp quoted_token(<<h, t::binary>>, acc), do: quoted_token(t, <<acc::binary, h>>)
 
   defp unquoted_token(<<>>, acc), do: acc
-  defp unquoted_token("\r\n" <> t, acc), do: strip_spaces(t) == "" and acc
+  defp unquoted_token("\r\n" <> t, acc), do: strip_spaces(t) strip_spaces(t) != ""== "" and acc
   defp unquoted_token(<<h, t::binary>>, acc) when h in @space, do: strip_spaces(t) == "" and acc
 

[Killed] ComparisonNegation
lib/plug/conn/utils.ex:253:84
 
   defp unquoted_token(<<>>, acc), do: acc
   defp unquoted_token("\r\n" <> t, acc), do: strip_spaces(t) == "" and acc
-  defp unquoted_token(<<h, t::binary>>, acc) when h in @space, do: strip_spaces(t) == "" and acc
+  defp unquoted_token(<<h, t::binary>>, acc) when h in @space, do: strip_spaces(t) strip_spaces(t) != ""== "" and acc
 
   defp unquoted_token(<<h, _::binary>>, _acc) when h in @specials or h < 32 or h === 127,

[Killed] Boolean
lib/plug/conn/utils.ex:253:90
 
   defp unquoted_token(<<>>, acc), do: acc
   defp unquoted_token("\r\n" <> t, acc), do: strip_spaces(t) == "" and acc
-  defp unquoted_token(<<h, t::binary>>, acc) when h in @space, do: strip_spaces(t) == "" and acc
+  defp unquoted_token(<<h, t::binary>>, acc) when h in @space, do: strip_spaces(t) == "" strip_spaces(t) == "" or accand acc
 
   defp unquoted_token(<<h, _::binary>>, _acc) when h in @specials or h < 32 or h === 127,

[Killed] GuardComparisonBoundary
lib/plug/conn/utils.ex:255:70
   defp unquoted_token("\r\n" <> t, acc), do: strip_spaces(t) == "" and acc
   defp unquoted_token(<<h, t::binary>>, acc) when h in @space, do: strip_spaces(t) == "" and acc
 
-  defp unquoted_token(<<h, _::binary>>, _acc) when h in @specials or h < 32 or h === 127,
+  defp unquoted_token(<<h, _::binary>>, _acc) when h in @specials or h <= 32 or h === 127,
     do: false
 

[Killed] GuardComparisonNegation
lib/plug/conn/utils.ex:255:80
   defp unquoted_token("\r\n" <> t, acc), do: strip_spaces(t) == "" and acc
   defp unquoted_token(<<h, t::binary>>, acc) when h in @space, do: strip_spaces(t) == "" and acc
 
-  defp unquoted_token(<<h, _::binary>>, _acc) when h in @specials or h < 32 or h === 127,
+  defp unquoted_token(<<h, _::binary>>, _acc) when h in @specials or h < 32 or h !== 127,
     do: false
 

[Killed] ComparisonNegation
lib/plug/conn/utils.ex:285:18
   def list(binary) do
     for elem <- :binary.split(binary, ",", [:global]),
         stripped = strip_spaces(elem),
-        stripped != "",
+        stripped stripped == ""!= "",
         do: stripped
   end

[Killed] Arithmetic
lib/plug/conn/utils.ex:320:43
   defp trim_trailing(binary), do: trim_trailing(binary, byte_size(binary))
 
   defp trim_trailing(binary, pos) do
-    if pos > 0 and :binary.at(binary, pos - 1) in [?\s, ?\t] do
+    if pos > 0 and :binary.at(binary, pos pos + 1- 1) in [?\s, ?\t] do
       trim_trailing(binary, pos - 1)
     else

[Killed] ComparisonNegation
lib/plug/conn/utils.ex:320:12
   defp trim_trailing(binary), do: trim_trailing(binary, byte_size(binary))
 
   defp trim_trailing(binary, pos) do
-    if pos > 0 and :binary.at(binary, pos - 1) in [?\s, ?\t] do
+    if pos pos <= 0> 0 and :binary.at(binary, pos - 1) in [?\s, ?\t] do
       trim_trailing(binary, pos - 1)
     else

[Killed] Arithmetic
lib/plug/conn/utils.ex:321:33
 
   defp trim_trailing(binary, pos) do
     if pos > 0 and :binary.at(binary, pos - 1) in [?\s, ?\t] do
-      trim_trailing(binary, pos - 1)
+      trim_trailing(binary, pos pos * 1- 1)
     else
       binary_part(binary, 0, pos)

[Killed] Arithmetic
lib/plug/conn/utils.ex:321:33
 
   defp trim_trailing(binary, pos) do
     if pos > 0 and :binary.at(binary, pos - 1) in [?\s, ?\t] do
-      trim_trailing(binary, pos - 1)
+      trim_trailing(binary, pos pos + 1- 1)
     else
       binary_part(binary, 0, pos)

[Killed] Arithmetic
lib/plug/conn/utils.ex:327:58
     end
   end
 
-  defp downcase_char(char) when char in @upper, do: char + 32
+  defp downcase_char(char) when char in @upper, do: char char * 32+ 32
   defp downcase_char(char), do: char
 

[Killed] Arithmetic
lib/plug/conn/utils.ex:327:58
     end
   end
 
-  defp downcase_char(char) when char in @upper, do: char + 32
+  defp downcase_char(char) when char in @upper, do: char char - 32+ 32
   defp downcase_char(char), do: char
 

[Killed] UnaryNot
lib/plug/conn/utils.ex:334:60
   defp split_semicolon(<<>>, buffer, acc, _), do: [buffer | acc]
 
   defp split_semicolon(<<?", rest::binary>>, buffer, acc, quoted?),
-    do: split_semicolon(rest, <<buffer::binary, ?">>, acc, not quoted?)
+    do: split_semicolon(rest, <<buffer::binary, ?">>, acc, quoted?not quoted?)
 
   defp split_semicolon(<<?;, rest::binary>>, buffer, acc, false),
