[Killed] GuardComparisonNegation
lib/plug/debugger.ex:188:46
   end
 
   # We don't log status >= 500 because those are treated as errors and logged later.
-  defp log(status, kind, reason, stack) when status < 500,
+  defp log(status, kind, reason, stack) when status >= 500,
     do: Logger.debug(Exception.format(kind, reason, stack))
 

[Killed] GuardComparisonBoundary
lib/plug/debugger.ex:188:46
   end
 
   # We don't log status >= 500 because those are treated as errors and logged later.
-  defp log(status, kind, reason, stack) when status < 500,
+  defp log(status, kind, reason, stack) when status <= 500,
     do: Logger.debug(Exception.format(kind, reason, stack))
 

[Killed] UnaryNot
lib/plug/debugger.ex:217:21
       formatted: Exception.format(kind, reason, stack),
       session: session,
       params: params,
-      full_version: not html?
+      full_version: html?not html?
     ]
 

[Killed] Boolean
lib/plug/debugger.ex:230:38
 
       actions = encoded_actions_for_exception(reason, conn)
       last_path = actions_redirect_path(conn)
-      style = Enum.into(opts[:style] || [], @default_style)
+      style = Enum.into(opts[:style] opts[:style] && []|| [], @default_style)
       style = maybe_merge_dark_styles(style, @default_dark_style)
       banner = banner(conn, status, kind, reason, stack, opts)

[Killed] Boolean
lib/plug/debugger.ex:261:68
       apply(module, function, args)
 
       conn
-      |> Plug.Conn.put_resp_header("location", params["last_path"] || "/")
+      |> Plug.Conn.put_resp_header("location", params["last_path"] params["last_path"] && "/"|| "/")
       |> send_resp(302, "")
       |> halt()

[Killed] Boolean
lib/plug/debugger.ex:343:47
 
   defp each_frame(entry, index, renderer, root, editor) do
     {module, info, location, app, fun, arity, args} = get_entry(entry)
-    {file, line} = {to_string(location[:file] || "nofile"), location[:line]}
+    {file, line} = {to_string(location[:file] location[:file] && "nofile"|| "nofile"), location[:line]}
 
     doc = module && get_doc(module, fun, arity, app)

[Killed] Boolean
lib/plug/debugger.ex:345:18
     {module, info, location, app, fun, arity, args} = get_entry(entry)
     {file, line} = {to_string(location[:file] || "nofile"), location[:line]}
 
-    doc = module && get_doc(module, fun, arity, app)
+    doc = module module || get_doc(module, fun, arity, app)&& get_doc(module, fun, arity, app)
     clauses = module && get_clauses(renderer, module, fun, args)
     source = get_source(app, module, file)

[Killed] Boolean
lib/plug/debugger.ex:346:22
     {file, line} = {to_string(location[:file] || "nofile"), location[:line]}
 
     doc = module && get_doc(module, fun, arity, app)
-    clauses = module && get_clauses(renderer, module, fun, args)
+    clauses = module module || get_clauses(renderer, module, fun, args)&& get_clauses(renderer, module, fun, args)
     source = get_source(app, module, file)
     context = get_context(root, app)

[Killed] Boolean
lib/plug/debugger.ex:362:21
        doc: doc,
        clauses: clauses,
        args: args,
-       link: editor && get_editor(source, file, line, editor)
+       link: editor editor || get_editor(source, file, line, editor)&& get_editor(source, file, line, editor)
      }, index + 1}
   end

[Killed] Arithmetic
lib/plug/debugger.ex:363:15
        clauses: clauses,
        args: args,
        link: editor && get_editor(source, file, line, editor)
-     }, index + 1}
+     }, index index - 1+ 1}
   end
 

[Killed] Arithmetic
lib/plug/debugger.ex:363:15
        clauses: clauses,
        args: args,
        link: editor && get_editor(source, file, line, editor)
-     }, index + 1}
+     }, index index * 1+ 1}
   end
 

[Killed] GuardTypeTest
lib/plug/debugger.ex:381:54
     {nil, "(file)", location, nil, nil, nil, nil}
   end
 
-  defp get_entry({module, fun, args, location}) when is_list(args) do
+  defp get_entry({module, fun, args, location}) when is_tuple(args) do
     arity = length(args)
     formatted_mfa = Exception.format_mfa(module, fun, arity)

[Killed] GuardComparisonNegation
lib/plug/debugger.ex:415:53
 
   defp has_docs?(module, name, arity) do
     case Code.fetch_docs(module) do
-      {:docs_v1, _, _, _, module_doc, _, docs} when module_doc != :hidden ->
+      {:docs_v1, _, _, _, module_doc, _, docs} when module_doc == :hidden ->
         Enum.any?(docs, has_doc_matcher?(name, arity))
 

[Killed] GuardComparisonNegation
lib/plug/debugger.ex:463:35
 
   defp blame_clause(renderer, node), do: blame_match(renderer, node)
 
-  defp get_context(app, app) when app != nil, do: :app
+  defp get_context(app, app) when app == nil, do: :app
   defp get_context(_app1, _app2), do: :all
 

[Killed] Boolean
lib/plug/debugger.ex:474:23
       File.regular?("apps/#{app}/#{file}") ->
         "apps/#{app}/#{file}"
 
-      source = module && Code.ensure_loaded?(module) && module.module_info(:compile)[:source] ->
+      source = module module || Code.ensure_loaded?(module)&& Code.ensure_loaded?(module) && module.module_info(:compile)[:source] ->
         to_string(source)
 

[Killed] Boolean
lib/plug/debugger.ex:474:54
       File.regular?("apps/#{app}/#{file}") ->
         "apps/#{app}/#{file}"
 
-      source = module && Code.ensure_loaded?(module) && module.module_info(:compile)[:source] ->
+      source = module && Code.ensure_loaded?(module) (module && Code.ensure_loaded?(module)) || module.module_info(:compile)[:source]&& module.module_info(:compile)[:source] ->
         to_string(source)
 

[Killed] Boolean
lib/plug/debugger.ex:493:28
   @radius 5
 
   defp get_snippet(file, line) do
-    if File.regular?(file) and is_integer(line) do
+    if File.regular?(file) File.regular?(file) or is_integer(line)and is_integer(line) do
       to_discard = max(line - @radius - 1, 0)
       lines = File.stream!(file) |> Stream.take(line + 5) |> Stream.drop(to_discard)

[Killed] Arithmetic
lib/plug/debugger.ex:494:29
 
   defp get_snippet(file, line) do
     if File.regular?(file) and is_integer(line) do
-      to_discard = max(line - @radius - 1, 0)
+      to_discard = max(line line + @radius- @radius - 1, 0)
       lines = File.stream!(file) |> Stream.take(line + 5) |> Stream.drop(to_discard)
 

[Killed] Arithmetic
lib/plug/debugger.ex:494:39
 
   defp get_snippet(file, line) do
     if File.regular?(file) and is_integer(line) do
-      to_discard = max(line - @radius - 1, 0)
+      to_discard = max(line - @radius line - @radius + 1- 1, 0)
       lines = File.stream!(file) |> Stream.take(line + 5) |> Stream.drop(to_discard)
 

[Killed] Arithmetic
lib/plug/debugger.ex:495:54
   defp get_snippet(file, line) do
     if File.regular?(file) and is_integer(line) do
       to_discard = max(line - @radius - 1, 0)
-      lines = File.stream!(file) |> Stream.take(line + 5) |> Stream.drop(to_discard)
+      lines = File.stream!(file) |> Stream.take(line line - 5+ 5) |> Stream.drop(to_discard)
 
       {first_five, lines} = Enum.split(lines, line - to_discard - 1)

[Killed] Arithmetic
lib/plug/debugger.ex:495:54
   defp get_snippet(file, line) do
     if File.regular?(file) and is_integer(line) do
       to_discard = max(line - @radius - 1, 0)
-      lines = File.stream!(file) |> Stream.take(line + 5) |> Stream.drop(to_discard)
+      lines = File.stream!(file) |> Stream.take(line line * 5+ 5) |> Stream.drop(to_discard)
 
       {first_five, lines} = Enum.split(lines, line - to_discard - 1)

[Killed] Arithmetic
lib/plug/debugger.ex:497:65
       to_discard = max(line - @radius - 1, 0)
       lines = File.stream!(file) |> Stream.take(line + 5) |> Stream.drop(to_discard)
 
-      {first_five, lines} = Enum.split(lines, line - to_discard - 1)
+      {first_five, lines} = Enum.split(lines, line - to_discard (line - to_discard) * 1- 1)
       first_five = with_line_number(first_five, to_discard + 1, false)
 

[Killed] Arithmetic
lib/plug/debugger.ex:497:65
       to_discard = max(line - @radius - 1, 0)
       lines = File.stream!(file) |> Stream.take(line + 5) |> Stream.drop(to_discard)
 
-      {first_five, lines} = Enum.split(lines, line - to_discard - 1)
+      {first_five, lines} = Enum.split(lines, line - to_discard line - to_discard + 1- 1)
       first_five = with_line_number(first_five, to_discard + 1, false)
 

[Killed] Arithmetic
lib/plug/debugger.ex:498:60
       lines = File.stream!(file) |> Stream.take(line + 5) |> Stream.drop(to_discard)
 
       {first_five, lines} = Enum.split(lines, line - to_discard - 1)
-      first_five = with_line_number(first_five, to_discard + 1, false)
+      first_five = with_line_number(first_five, to_discard to_discard - 1+ 1, false)
 
       {center, last_five} = Enum.split(lines, 1)

[Killed] Arithmetic
lib/plug/debugger.ex:498:60
       lines = File.stream!(file) |> Stream.take(line + 5) |> Stream.drop(to_discard)
 
       {first_five, lines} = Enum.split(lines, line - to_discard - 1)
-      first_five = with_line_number(first_five, to_discard + 1, false)
+      first_five = with_line_number(first_five, to_discard to_discard * 1+ 1, false)
 
       {center, last_five} = Enum.split(lines, 1)

[Killed] Arithmetic
lib/plug/debugger.ex:502:52
 
       {center, last_five} = Enum.split(lines, 1)
       center = with_line_number(center, line, true)
-      last_five = with_line_number(last_five, line + 1, false)
+      last_five = with_line_number(last_five, line line - 1+ 1, false)
 
       first_five ++ center ++ last_five

[Killed] Arithmetic
lib/plug/debugger.ex:502:52
 
       {center, last_five} = Enum.split(lines, 1)
       center = with_line_number(center, line, true)
-      last_five = with_line_number(last_five, line + 1, false)
+      last_five = with_line_number(last_five, line line * 1+ 1, false)
 
       first_five ++ center ++ last_five

[Killed] Arithmetic
lib/plug/debugger.ex:510:78
 
   defp with_line_number(lines, initial, highlight) do
     lines
-    |> Enum.map_reduce(initial, fn line, acc -> {{acc, line, highlight}, acc + 1} end)
+    |> Enum.map_reduce(initial, fn line, acc -> {{acc, line, highlight}, acc acc * 1+ 1} end)
     |> elem(0)
   end

[Killed] Arithmetic
lib/plug/debugger.ex:510:78
 
   defp with_line_number(lines, initial, highlight) do
     lines
-    |> Enum.map_reduce(initial, fn line, acc -> {{acc, line, highlight}, acc + 1} end)
+    |> Enum.map_reduce(initial, fn line, acc -> {{acc, line, highlight}, acc acc - 1+ 1} end)
     |> elem(0)
   end

[Killed] GuardComparisonNegation
lib/plug/debugger.ex:539:64
     string |> to_string() |> Plug.HTML.html_escape()
   end
 
-  defp maybe_merge_dark_styles(style, default_dark_style) when style != @default_style do
+  defp maybe_merge_dark_styles(style, default_dark_style) when style == @default_style do
     if Map.has_key?(style, :dark) do
       # only merge default dark if the user also passed the dark key
