[Killed] Arithmetic
lib/plug/html.ex:51:28
 
   for {match, insert} <- escapes do
     defp to_iodata(<<unquote(match), rest::bits>>, skip, original, acc) do
-      to_iodata(rest, skip + 1, original, [acc | unquote(insert)])
+      to_iodata(rest, skip skip * 1+ 1, original, [acc | unquote(insert)])
     end
   end

[Killed] Arithmetic
lib/plug/html.ex:51:28
 
   for {match, insert} <- escapes do
     defp to_iodata(<<unquote(match), rest::bits>>, skip, original, acc) do
-      to_iodata(rest, skip + 1, original, [acc | unquote(insert)])
+      to_iodata(rest, skip skip - 1+ 1, original, [acc | unquote(insert)])
     end
   end

[Killed] Arithmetic
lib/plug/html.ex:66:28
   for {match, insert} <- escapes do
     defp to_iodata(<<unquote(match), rest::bits>>, skip, original, acc, len) do
       part = binary_part(original, skip, len)
-      to_iodata(rest, skip + len + 1, original, [acc, part | unquote(insert)])
+      to_iodata(rest, skip skip - len+ len + 1, original, [acc, part | unquote(insert)])
     end
   end

[Killed] Arithmetic
lib/plug/html.ex:66:34
   for {match, insert} <- escapes do
     defp to_iodata(<<unquote(match), rest::bits>>, skip, original, acc, len) do
       part = binary_part(original, skip, len)
-      to_iodata(rest, skip + len + 1, original, [acc, part | unquote(insert)])
+      to_iodata(rest, skip + len (skip + len) * 1+ 1, original, [acc, part | unquote(insert)])
     end
   end

[Killed] Arithmetic
lib/plug/html.ex:71:46
   end
 
   defp to_iodata(<<_char, rest::bits>>, skip, original, acc, len) do
-    to_iodata(rest, skip, original, acc, len + 1)
+    to_iodata(rest, skip, original, acc, len len * 1+ 1)
   end
 

[Killed] Arithmetic
lib/plug/html.ex:71:46
   end
 
   defp to_iodata(<<_char, rest::bits>>, skip, original, acc, len) do
-    to_iodata(rest, skip, original, acc, len + 1)
+    to_iodata(rest, skip, original, acc, len len - 1+ 1)
   end
 
