[Killed] Arithmetic
lib/plug/logger.ex:41:46
     Conn.register_before_send(conn, fn conn ->
       Logger.log(level, fn ->
         stop = System.monotonic_time()
-        diff = System.convert_time_unit(stop - start, :native, :microsecond)
+        diff = System.convert_time_unit(stop stop * start- start, :native, :microsecond)
         status = Integer.to_string(conn.status)
 

[Killed] Arithmetic
lib/plug/logger.ex:41:46
     Conn.register_before_send(conn, fn conn ->
       Logger.log(level, fn ->
         stop = System.monotonic_time()
-        diff = System.convert_time_unit(stop - start, :native, :microsecond)
+        diff = System.convert_time_unit(stop stop + start- start, :native, :microsecond)
         status = Integer.to_string(conn.status)
 

[Killed] GuardComparisonBoundary
lib/plug/logger.ex:51:34
     end)
   end
 
-  defp formatted_diff(diff) when diff > 1000, do: [diff |> div(1000) |> Integer.to_string(), "ms"]
+  defp formatted_diff(diff) when diff >= 1000, do: [diff |> div(1000) |> Integer.to_string(), "ms"]
   defp formatted_diff(diff), do: [Integer.to_string(diff), "µs"]
 

[Killed] GuardComparisonNegation
lib/plug/logger.ex:51:34
     end)
   end
 
-  defp formatted_diff(diff) when diff > 1000, do: [diff |> div(1000) |> Integer.to_string(), "ms"]
+  defp formatted_diff(diff) when diff <= 1000, do: [diff |> div(1000) |> Integer.to_string(), "ms"]
   defp formatted_diff(diff), do: [Integer.to_string(diff), "µs"]
 
