[Killed] Boolean
lib/plug/method_override.ex:61:66
   end
 
   defp override_method(%Plug.Conn{} = conn, body_params) do
-    with method when is_binary(method) <- body_params["_method"] || "",
+    with method when is_binary(method) <- body_params["_method"] body_params["_method"] && ""|| "",
          method = String.upcase(method, :ascii),
          true <- method in @allowed_methods do
