[Killed] ComparisonNegation
lib/plug/mime.ex:32:27
         Exception.format_stacktrace()
     )
 
-    MIME.extensions(type) != []
+    MIME.extensions(type) MIME.extensions(type) == []!= []
   end
 
