[Killed] GuardTypeTest
lib/plug/parsers.ex:270:51
     for parser <- parsers do
       {parser, opts} =
         case parser do
-          {parser, opts} when is_atom(parser) and is_list(opts) ->
+          {parser, opts} when is_atom(parser) and is_tuple(opts) ->
             {parser, Keyword.merge(root_opts, opts)}
 

[Killed] GuardTypeTest
lib/plug/parsers.ex:270:31
     for parser <- parsers do
       {parser, opts} =
         case parser do
-          {parser, opts} when is_atom(parser) and is_list(opts) ->
+          {parser, opts} when is_nil(parser) and is_list(opts) ->
             {parser, Keyword.merge(root_opts, opts)}
 

[Killed] Boolean
lib/plug/parsers.ex:367:38
     do: true
 
   defp accepted_mime?(type, subtype, pass),
-    do: "#{type}/#{subtype}" in pass || "#{type}/*" in pass
+    do: "#{type}/#{subtype}" in pass "#{type}/#{subtype}" in pass && "#{type}/*" in pass|| "#{type}/*" in pass
 
   defp merge_params(conn, body_params, query_string_length, validate_utf8) do
