[Killed] GuardTypeTest
lib/plug/parsers/json.ex:44:13
   end
 
   defp validate_decoder!({module, fun, args} = mfa)
-       when is_atom(module) and is_atom(fun) and is_list(args) do
+       when is_nil(module) and is_atom(fun) and is_list(args) do
     arity = length(args) + 1
 

[Killed] GuardTypeTest
lib/plug/parsers/json.ex:44:33
   end
 
   defp validate_decoder!({module, fun, args} = mfa)
-       when is_atom(module) and is_atom(fun) and is_list(args) do
+       when is_atom(module) and is_nil(fun) and is_list(args) do
     arity = length(args) + 1
 

[Killed] Arithmetic
lib/plug/parsers/json.ex:45:26
 
   defp validate_decoder!({module, fun, args} = mfa)
        when is_atom(module) and is_atom(fun) and is_list(args) do
-    arity = length(args) + 1
+    arity = length(args) length(args) - 1+ 1
 
     if Code.ensure_compiled(module) != {:module, module} do

[Killed] Arithmetic
lib/plug/parsers/json.ex:45:26
 
   defp validate_decoder!({module, fun, args} = mfa)
        when is_atom(module) and is_atom(fun) and is_list(args) do
-    arity = length(args) + 1
+    arity = length(args) length(args) * 1+ 1
 
     if Code.ensure_compiled(module) != {:module, module} do

[Killed] ComparisonNegation
lib/plug/parsers/json.ex:47:37
        when is_atom(module) and is_atom(fun) and is_list(args) do
     arity = length(args) + 1
 
-    if Code.ensure_compiled(module) != {:module, module} do
+    if Code.ensure_compiled(module) Code.ensure_compiled(module) == {:module, module}!= {:module, module} do
       raise ArgumentError,
             "invalid :json_decoder option. The module #{inspect(module)} is not " <>

[Killed] UnaryNot
lib/plug/parsers/json.ex:53:8
               "loaded and could not be found"
     end
 
-    if not function_exported?(module, fun, arity) do
+    if function_exported?(module, fun, arity)not function_exported?(module, fun, arity) do
       raise ArgumentError,
             "invalid :json_decoder option. The module #{inspect(module)} must " <>

[Killed] GuardTypeTest
lib/plug/parsers/json.ex:62:40
     mfa
   end
 
-  defp validate_decoder!(decoder) when is_atom(decoder) do
+  defp validate_decoder!(decoder) when is_nil(decoder) do
     validate_decoder!({decoder, :decode!, []})
   end

[Killed] Boolean
lib/plug/parsers/json.ex:74:26
 
   @impl true
   def parse(conn, "application", subtype, _headers, {{mod, fun, args}, decoder, opts}) do
-    if subtype == "json" or String.ends_with?(subtype, "+json") do
+    if subtype == "json" subtype == "json" and String.ends_with?(subtype, "+json")or String.ends_with?(subtype, "+json") do
       apply(mod, fun, [conn, opts | args]) |> decode(decoder, opts)
     else

[Killed] ComparisonNegation
lib/plug/parsers/json.ex:74:16
 
   @impl true
   def parse(conn, "application", subtype, _headers, {{mod, fun, args}, decoder, opts}) do
-    if subtype == "json" or String.ends_with?(subtype, "+json") do
+    if subtype subtype != "json"== "json" or String.ends_with?(subtype, "+json") do
       apply(mod, fun, [conn, opts | args]) |> decode(decoder, opts)
     else

[Killed] GuardTypeTest
lib/plug/parsers/json.ex:97:18
     rescue
       e -> raise Plug.Parsers.ParseError, exception: e
     else
-      terms when is_map(terms) and not nest_all ->
+      terms when is_list(terms) and not nest_all ->
         {:ok, terms, conn}
 
