[Killed] Boolean
lib/plug/parsers/multipart.ex:112:38
       raise ":length option for Plug.Parsers.MULTIPART must be an integer"
     end
 
-    m2p = opts[:multipart_to_params] || {__MODULE__, :multipart_to_params, [opts]}
+    m2p = opts[:multipart_to_params] opts[:multipart_to_params] && {__MODULE__, :multipart_to_params, [opts]}|| {__MODULE__, :multipart_to_params, [opts]}
     {m2p, limit, headers_opts, opts}
   end

[Killed] ComparisonNegation
lib/plug/parsers/multipart.ex:153:14
     read_result = Plug.Conn.read_part_headers(conn, headers_opts)
     {:ok, limit, acc, conn} = parse_multipart(read_result, limit, opts, headers_opts, [])
 
-    if limit > 0 do
+    if limit limit <= 0> 0 do
       {mod, fun, args} = m2p
       apply(mod, fun, [acc, conn | args])

[Killed] ComparisonBoundary
lib/plug/parsers/multipart.ex:153:14
     read_result = Plug.Conn.read_part_headers(conn, headers_opts)
     {:ok, limit, acc, conn} = parse_multipart(read_result, limit, opts, headers_opts, [])
 
-    if limit > 0 do
+    if limit limit >= 0> 0 do
       {mod, fun, args} = m2p
       apply(mod, fun, [acc, conn | args])

[Killed] GuardComparisonBoundary
lib/plug/parsers/multipart.ex:161:83
     end
   end
 
-  defp parse_multipart({:ok, headers, conn}, limit, opts, headers_opts, acc) when limit >= 0 do
+  defp parse_multipart({:ok, headers, conn}, limit, opts, headers_opts, acc) when limit > 0 do
     {conn, limit, acc} = parse_multipart_headers(headers, conn, limit, opts, acc)
     read_result = Plug.Conn.read_part_headers(conn, headers_opts)

[Killed] GuardComparisonNegation
lib/plug/parsers/multipart.ex:161:83
     end
   end
 
-  defp parse_multipart({:ok, headers, conn}, limit, opts, headers_opts, acc) when limit >= 0 do
+  defp parse_multipart({:ok, headers, conn}, limit, opts, headers_opts, acc) when limit < 0 do
     {conn, limit, acc} = parse_multipart_headers(headers, conn, limit, opts, acc)
     read_result = Plug.Conn.read_part_headers(conn, headers_opts)

[Killed] GuardComparisonNegation
lib/plug/parsers/multipart.ex:209:13
   end
 
   defp parse_multipart_body({:more, tail, conn}, limit, opts, body)
-       when limit >= byte_size(tail) do
+       when limit < byte_size(tail) do
     read_result = Plug.Conn.read_part_body(conn, opts)
     parse_multipart_body(read_result, limit - byte_size(tail), opts, body <> tail)

[Killed] GuardComparisonBoundary
lib/plug/parsers/multipart.ex:209:13
   end
 
   defp parse_multipart_body({:more, tail, conn}, limit, opts, body)
-       when limit >= byte_size(tail) do
+       when limit > byte_size(tail) do
     read_result = Plug.Conn.read_part_body(conn, opts)
     parse_multipart_body(read_result, limit - byte_size(tail), opts, body <> tail)

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:211:45
   defp parse_multipart_body({:more, tail, conn}, limit, opts, body)
        when limit >= byte_size(tail) do
     read_result = Plug.Conn.read_part_body(conn, opts)
-    parse_multipart_body(read_result, limit - byte_size(tail), opts, body <> tail)
+    parse_multipart_body(read_result, limit limit + byte_size(tail)- byte_size(tail), opts, body <> tail)
   end
 

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:211:45
   defp parse_multipart_body({:more, tail, conn}, limit, opts, body)
        when limit >= byte_size(tail) do
     read_result = Plug.Conn.read_part_body(conn, opts)
-    parse_multipart_body(read_result, limit - byte_size(tail), opts, body <> tail)
+    parse_multipart_body(read_result, limit limit * byte_size(tail)- byte_size(tail), opts, body <> tail)
   end
 

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:215:17
   end
 
   defp parse_multipart_body({:more, tail, conn}, limit, _opts, body) do
-    {:ok, limit - byte_size(tail), body, conn}
+    {:ok, limit limit * byte_size(tail)- byte_size(tail), body, conn}
   end
 

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:215:17
   end
 
   defp parse_multipart_body({:more, tail, conn}, limit, _opts, body) do
-    {:ok, limit - byte_size(tail), body, conn}
+    {:ok, limit limit + byte_size(tail)- byte_size(tail), body, conn}
   end
 

[Killed] GuardComparisonNegation
lib/plug/parsers/multipart.ex:219:13
   end
 
   defp parse_multipart_body({:ok, tail, conn}, limit, _opts, body)
-       when limit >= byte_size(tail) do
+       when limit < byte_size(tail) do
     {:ok, limit - byte_size(tail), body <> tail, conn}
   end

[Killed] GuardComparisonBoundary
lib/plug/parsers/multipart.ex:219:13
   end
 
   defp parse_multipart_body({:ok, tail, conn}, limit, _opts, body)
-       when limit >= byte_size(tail) do
+       when limit > byte_size(tail) do
     {:ok, limit - byte_size(tail), body <> tail, conn}
   end

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:220:17
 
   defp parse_multipart_body({:ok, tail, conn}, limit, _opts, body)
        when limit >= byte_size(tail) do
-    {:ok, limit - byte_size(tail), body <> tail, conn}
+    {:ok, limit limit * byte_size(tail)- byte_size(tail), body <> tail, conn}
   end
 

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:220:17
 
   defp parse_multipart_body({:ok, tail, conn}, limit, _opts, body)
        when limit >= byte_size(tail) do
-    {:ok, limit - byte_size(tail), body <> tail, conn}
+    {:ok, limit limit + byte_size(tail)- byte_size(tail), body <> tail, conn}
   end
 

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:224:17
   end
 
   defp parse_multipart_body({:ok, tail, conn}, limit, _opts, body) do
-    {:ok, limit - byte_size(tail), body, conn}
+    {:ok, limit limit + byte_size(tail)- byte_size(tail), body, conn}
   end
 

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:224:17
   end
 
   defp parse_multipart_body({:ok, tail, conn}, limit, _opts, body) do
-    {:ok, limit - byte_size(tail), body, conn}
+    {:ok, limit limit * byte_size(tail)- byte_size(tail), body, conn}
   end
 

[Killed] GuardComparisonBoundary
lib/plug/parsers/multipart.ex:228:13
   end
 
   defp parse_multipart_file({:more, tail, conn}, limit, opts, file)
-       when limit >= byte_size(tail) do
+       when limit > byte_size(tail) do
     binwrite!(file, tail)
     read_result = Plug.Conn.read_part_body(conn, opts)

[Killed] GuardComparisonNegation
lib/plug/parsers/multipart.ex:228:13
   end
 
   defp parse_multipart_file({:more, tail, conn}, limit, opts, file)
-       when limit >= byte_size(tail) do
+       when limit < byte_size(tail) do
     binwrite!(file, tail)
     read_result = Plug.Conn.read_part_body(conn, opts)

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:231:45
        when limit >= byte_size(tail) do
     binwrite!(file, tail)
     read_result = Plug.Conn.read_part_body(conn, opts)
-    parse_multipart_file(read_result, limit - byte_size(tail), opts, file)
+    parse_multipart_file(read_result, limit limit * byte_size(tail)- byte_size(tail), opts, file)
   end
 

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:231:45
        when limit >= byte_size(tail) do
     binwrite!(file, tail)
     read_result = Plug.Conn.read_part_body(conn, opts)
-    parse_multipart_file(read_result, limit - byte_size(tail), opts, file)
+    parse_multipart_file(read_result, limit limit + byte_size(tail)- byte_size(tail), opts, file)
   end
 

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:235:17
   end
 
   defp parse_multipart_file({:more, tail, conn}, limit, _opts, _file) do
-    {:ok, limit - byte_size(tail), conn}
+    {:ok, limit limit * byte_size(tail)- byte_size(tail), conn}
   end
 

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:235:17
   end
 
   defp parse_multipart_file({:more, tail, conn}, limit, _opts, _file) do
-    {:ok, limit - byte_size(tail), conn}
+    {:ok, limit limit + byte_size(tail)- byte_size(tail), conn}
   end
 

[Killed] GuardComparisonNegation
lib/plug/parsers/multipart.ex:239:13
   end
 
   defp parse_multipart_file({:ok, tail, conn}, limit, _opts, file)
-       when limit >= byte_size(tail) do
+       when limit < byte_size(tail) do
     binwrite!(file, tail)
     {:ok, limit - byte_size(tail), conn}

[Killed] GuardComparisonBoundary
lib/plug/parsers/multipart.ex:239:13
   end
 
   defp parse_multipart_file({:ok, tail, conn}, limit, _opts, file)
-       when limit >= byte_size(tail) do
+       when limit > byte_size(tail) do
     binwrite!(file, tail)
     {:ok, limit - byte_size(tail), conn}

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:241:17
   defp parse_multipart_file({:ok, tail, conn}, limit, _opts, file)
        when limit >= byte_size(tail) do
     binwrite!(file, tail)
-    {:ok, limit - byte_size(tail), conn}
+    {:ok, limit limit * byte_size(tail)- byte_size(tail), conn}
   end
 

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:241:17
   defp parse_multipart_file({:ok, tail, conn}, limit, _opts, file)
        when limit >= byte_size(tail) do
     binwrite!(file, tail)
-    {:ok, limit - byte_size(tail), conn}
+    {:ok, limit limit + byte_size(tail)- byte_size(tail), conn}
   end
 

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:245:17
   end
 
   defp parse_multipart_file({:ok, tail, conn}, limit, _opts, _file) do
-    {:ok, limit - byte_size(tail), conn}
+    {:ok, limit limit * byte_size(tail)- byte_size(tail), conn}
   end
 

[Killed] Arithmetic
lib/plug/parsers/multipart.ex:245:17
   end
 
   defp parse_multipart_file({:ok, tail, conn}, limit, _opts, _file) do
-    {:ok, limit - byte_size(tail), conn}
+    {:ok, limit limit + byte_size(tail)- byte_size(tail), conn}
   end
 
