[Killed] Boolean
lib/plug/router.ex:509:55
 
   @doc false
   def __route__(method, path, guards, options) do
-    {method, guards} = build_methods(List.wrap(method || options[:via]), guards)
+    {method, guards} = build_methods(List.wrap(method method && options[:via]|| options[:via]), guards)
     {params, match, guards, post_match} = Plug.Router.Utils.build_path_clause(path, guards)
     params = Plug.Router.Utils.build_path_params_match(params)

[Killed] GuardTypeTest
lib/plug/router.ex:631:42
 
   defp expand_alias(other, _env), do: other
 
-  defp extract_merger(options, key) when is_list(options) do
+  defp extract_merger(options, key) when is_tuple(options) do
     if option = Keyword.get(options, key) do
       quote do

[Killed] GuardTypeTest
lib/plug/router.ex:663:40
   defp extract_path_and_guards({:when, _, [path, guards]}), do: {extract_path(path), guards}
   defp extract_path_and_guards(path), do: {extract_path(path), true}
 
-  defp extract_path({:_, _, var}) when is_atom(var), do: "/*_path"
+  defp extract_path({:_, _, var}) when is_nil(var), do: "/*_path"
   defp extract_path(path), do: path
 end
