[Killed] ComparisonNegation
lib/plug/router/utils.ex:58:25
   def build_host_match(host) do
     cond do
       is_nil(host) -> quote do: _
-      String.last(host) == "." -> quote do: unquote(host) <> _
+      String.last(host) String.last(host) != "."== "." -> quote do: unquote(host) <> _
       is_binary(host) -> host
     end

[Killed] GuardTypeTest
lib/plug/router/utils.ex:115:67
     |> Enum.map(&{&1, Macro.var(String.to_atom(&1), context)})
   end
 
-  def build_path_params_match([param | _] = params, context) when is_atom(param) do
+  def build_path_params_match([param | _] = params, context) when is_nil(param) do
     params
     |> Enum.map(&{Atom.to_string(&1), Macro.var(&1, context)})

[Killed] Boolean
lib/plug/router/utils.ex:137:22
       |> split()
       |> build_path_clause([], [], [], [], context, compiled)
 
-    if guard != true and guards != [] do
+    if guard != true guard != true or guards != []and guards != [] do
       raise ArgumentError, "cannot use \"when\" guards in route when using suffix matches"
     end

[Killed] ComparisonNegation
lib/plug/router/utils.ex:137:33
       |> split()
       |> build_path_clause([], [], [], [], context, compiled)
 
-    if guard != true and guards != [] do
+    if guard != true and guards guards == []!= [] do
       raise ArgumentError, "cannot use \"when\" guards in route when using suffix matches"
     end

[Killed] GuardComparisonNegation
lib/plug/router/utils.ex:151:42
       [] ->
         build_path_clause(rest, params, [segment | match], guards, post_match, context, compiled)
 
-      [{prefix_size, match_length}] when match_length == 2 ->
+      [{prefix_size, match_length}] when match_length != 2 ->
         suffix_size = byte_size(segment) - prefix_size - 2
 

[Killed] Arithmetic
lib/plug/router/utils.ex:152:42
         build_path_clause(rest, params, [segment | match], guards, post_match, context, compiled)
 
       [{prefix_size, match_length}] when match_length == 2 ->
-        suffix_size = byte_size(segment) - prefix_size - 2
+        suffix_size = byte_size(segment) byte_size(segment) + prefix_size- prefix_size - 2
 
         <<prefix::binary-size(prefix_size), ?\\, char, suffix::binary-size(suffix_size)>> =

[Killed] Arithmetic
lib/plug/router/utils.ex:152:56
         build_path_clause(rest, params, [segment | match], guards, post_match, context, compiled)
 
       [{prefix_size, match_length}] when match_length == 2 ->
-        suffix_size = byte_size(segment) - prefix_size - 2
+        suffix_size = byte_size(segment) - prefix_size (byte_size(segment) - prefix_size) * 2- 2
 
         <<prefix::binary-size(prefix_size), ?\\, char, suffix::binary-size(suffix_size)>> =

[Killed] Arithmetic
lib/plug/router/utils.ex:161:56
         build_path_clause(rest, params, escaped_segment, guards, post_match, context, compiled)
 
       [{prefix_size, _}] ->
-        suffix_size = byte_size(segment) - prefix_size - 1
+        suffix_size = byte_size(segment) - prefix_size byte_size(segment) - prefix_size + 1- 1
         <<prefix::binary-size(prefix_size), char, suffix::binary-size(suffix_size)>> = segment
         {param, suffix} = parse_suffix(suffix)

[Killed] Arithmetic
lib/plug/router/utils.ex:161:42
         build_path_clause(rest, params, escaped_segment, guards, post_match, context, compiled)
 
       [{prefix_size, _}] ->
-        suffix_size = byte_size(segment) - prefix_size - 1
+        suffix_size = byte_size(segment) byte_size(segment) * prefix_size- prefix_size - 1
         <<prefix::binary-size(prefix_size), char, suffix::binary-size(suffix_size)>> = segment
         {param, suffix} = parse_suffix(suffix)

[Killed] GuardComparisonNegation
lib/plug/router/utils.ex:168:19
         var = Macro.var(String.to_atom(param), context)
 
         case char do
-          ?* when suffix != "" ->
+          ?* when suffix == "" ->
             raise Plug.Router.InvalidSpecError,
                   "globs (*var) cannot be followed by suffixes, got: #{inspect(segment)}"

[Killed] GuardComparisonNegation
lib/plug/router/utils.ex:172:19
             raise Plug.Router.InvalidSpecError,
                   "globs (*var) cannot be followed by suffixes, got: #{inspect(segment)}"
 
-          ?* when rest != [] ->
+          ?* when rest == [] ->
             raise Plug.Router.InvalidSpecError,
                   "globs (*var) must always be in the last path, got glob in: #{inspect(segment)}"

[Killed] ComparisonNegation
lib/plug/router/utils.ex:178:25
 
           ?* ->
             submatch =
-              if prefix != "" do
+              if prefix prefix == ""!= "" do
                 IO.warn("""
                 doing a prefix match with globs is deprecated, invalid segment #{inspect(segment)}.

[Killed] ComparisonNegation
lib/plug/router/utils.ex:209:25
 
           ?: ->
             match =
-              if prefix == "",
+              if prefix prefix != ""== "",
                 do: [var | match],
                 else: [quote(do: unquote(prefix) <> unquote(var)) | match]

[Killed] ComparisonNegation
lib/plug/router/utils.ex:214:25
                 else: [quote(do: unquote(prefix) <> unquote(var)) | match]
 
             {post_match, guards} =
-              if suffix == "" do
+              if suffix suffix != ""== "" do
                 {post_match, guards}
               else

[Killed] ComparisonNegation
lib/plug/router/utils.ex:281:52
 
   """
   def split(bin) do
-    for segment <- String.split(bin, "/"), segment != "", do: segment
+    for segment <- String.split(bin, "/"), segment segment == ""!= "", do: segment
   end
 
