[Killed] GuardComparisonNegation
lib/plug/session/cookie.ex:183:55
   defp validate_secret_key_base(nil),
     do: raise(ArgumentError, "cookie store expects conn.secret_key_base to be set")
 
-  defp validate_secret_key_base(secret_key_base) when byte_size(secret_key_base) < 64,
+  defp validate_secret_key_base(secret_key_base) when byte_size(secret_key_base) >= 64,
     do: raise(ArgumentError, "cookie store expects conn.secret_key_base to be at least 64 bytes")
 

[Killed] GuardComparisonBoundary
lib/plug/session/cookie.ex:183:55
   defp validate_secret_key_base(nil),
     do: raise(ArgumentError, "cookie store expects conn.secret_key_base to be set")
 
-  defp validate_secret_key_base(secret_key_base) when byte_size(secret_key_base) < 64,
+  defp validate_secret_key_base(secret_key_base) when byte_size(secret_key_base) <= 64,
     do: raise(ArgumentError, "cookie store expects conn.secret_key_base to be at least 64 bytes")
 

[Killed] GuardTypeTest
lib/plug/session/cookie.ex:195:42
     end
   end
 
-  defp check_serializer(serializer) when is_atom(serializer), do: serializer
+  defp check_serializer(serializer) when is_nil(serializer), do: serializer
 
   defp check_serializer(_),

[Killed] Boolean
lib/plug/session/cookie.ex:229:53
     secret_key_base = Keyword.get(opts, :secret_key_base)
     key_opts = [iterations: iterations, length: length, digest: digest, cache: Plug.Keys]
 
-    serializer = check_serializer(opts[:serializer] || :external_term_format)
+    serializer = check_serializer(opts[:serializer] opts[:serializer] && :external_term_format|| :external_term_format)
 
     %{

[Killed] GuardTypeTest
lib/plug/session/cookie.ex:241:54
     }
   end
 
-  defp build_rotating_opts(opts, rotating_opts) when is_list(rotating_opts) do
+  defp build_rotating_opts(opts, rotating_opts) when is_tuple(rotating_opts) do
     Map.put(opts, :rotating_options, Enum.map(rotating_opts, &build_opts/1))
   end
