[Killed] GuardComparisonNegation
lib/plug/session/ets.ex:85:13
   end
 
   defp put_new(data, table, counter \\ 0)
-       when counter < @max_tries do
+       when counter >= @max_tries do
     sid = Base.encode64(:crypto.strong_rand_bytes(96))
 

[Killed] GuardComparisonBoundary
lib/plug/session/ets.ex:85:13
   end
 
   defp put_new(data, table, counter \\ 0)
-       when counter < @max_tries do
+       when counter <= @max_tries do
     sid = Base.encode64(:crypto.strong_rand_bytes(96))
 

[Killed] Arithmetic
lib/plug/session/ets.ex:91:36
     if :ets.insert_new(table, {sid, data, now()}) do
       sid
     else
-      put_new(data, table, counter + 1)
+      put_new(data, table, counter counter - 1+ 1)
     end
   end

[Killed] Arithmetic
lib/plug/session/ets.ex:91:36
     if :ets.insert_new(table, {sid, data, now()}) do
       sid
     else
-      put_new(data, table, counter + 1)
+      put_new(data, table, counter counter * 1+ 1)
     end
   end
