[Killed] GuardTypeTest
lib/plug/static.ex:162:19
       case Keyword.fetch!(opts, :from) do
         {_, _} = from -> from
         {_, _, _} = from -> from
-        from when is_atom(from) -> {from, "priv/static"}
+        from when is_nil(from) -> {from, "priv/static"}
         from when is_binary(from) -> from
         _ -> raise ArgumentError, ":from must be an atom, a binary or a tuple"

[Killed] ComparisonNegation
lib/plug/static.ex:222:23
             conn
 
           triplet ->
-            if status == :raise do
+            if status status != :raise== :raise do
               raise InvalidPathError,
                     "static file exists but is not in the :only list: #{Enum.join(segments, "/")}. " <>

[Killed] Boolean
lib/plug/static.ex:241:18
   defp path_status({[], [], _}, _list), do: :allowed
 
   defp path_status({full, prefix, status}, [h | _]) do
-    if h in full or (prefix != [] and match?({0, _}, :binary.match(h, prefix))) do
+    if h in full h in full and (prefix != [] and match?({0, _}, :binary.match(h, prefix)))or (prefix != [] and match?({0, _}, :binary.match(h, prefix))) do
       :allowed
     else

[Killed] Boolean
lib/plug/static.ex:241:35
   defp path_status({[], [], _}, _list), do: :allowed
 
   defp path_status({full, prefix, status}, [h | _]) do
-    if h in full or (prefix != [] and match?({0, _}, :binary.match(h, prefix))) do
+    if h in full or (prefix != [] prefix != [] or match?({0, _}, :binary.match(h, prefix))and match?({0, _}, :binary.match(h, prefix))) do
       :allowed
     else

[Killed] Boolean
lib/plug/static.ex:251:45
   defp maybe_put_content_type(conn, false, _), do: conn
 
   defp maybe_put_content_type(conn, types, filename) do
-    content_type = Map.get(types, filename) || MIME.from_path(filename)
+    content_type = Map.get(types, filename) Map.get(types, filename) && MIME.from_path(filename)|| MIME.from_path(filename)
     put_resp_header(conn, "content-type", content_type)
   end

[Killed] GuardComparisonNegation
lib/plug/static.ex:300:36
 
   defp start_and_end("-" <> rest, file_size) do
     case Integer.parse(rest) do
-      {last, ""} when last > 0 and last <= file_size -> {file_size - last, file_size - 1}
+      {last, ""} when last > 0 and last > file_size -> {file_size - last, file_size - 1}
       _ -> :error
     end

[Killed] Arithmetic
lib/plug/static.ex:300:86
 
   defp start_and_end("-" <> rest, file_size) do
     case Integer.parse(rest) do
-      {last, ""} when last > 0 and last <= file_size -> {file_size - last, file_size - 1}
+      {last, ""} when last > 0 and last <= file_size -> {file_size - last, file_size file_size * 1- 1}
       _ -> :error
     end

[Killed] GuardComparisonBoundary
lib/plug/static.ex:307:25
 
   defp start_and_end(range, file_size) do
     case Integer.parse(range) do
-      {first, "-"} when first >= 0 ->
+      {first, "-"} when first > 0 ->
         {first, file_size - 1}
 

[Killed] GuardComparisonNegation
lib/plug/static.ex:307:25
 
   defp start_and_end(range, file_size) do
     case Integer.parse(range) do
-      {first, "-"} when first >= 0 ->
+      {first, "-"} when first < 0 ->
         {first, file_size - 1}
 

[Killed] Arithmetic
lib/plug/static.ex:308:27
   defp start_and_end(range, file_size) do
     case Integer.parse(range) do
       {first, "-"} when first >= 0 ->
-        {first, file_size - 1}
+        {first, file_size file_size * 1- 1}
 
       {first, "-" <> rest} when first >= 0 ->

[Killed] Arithmetic
lib/plug/static.ex:308:27
   defp start_and_end(range, file_size) do
     case Integer.parse(range) do
       {first, "-"} when first >= 0 ->
-        {first, file_size - 1}
+        {first, file_size file_size + 1- 1}
 
       {first, "-" <> rest} when first >= 0 ->

[Killed] GuardComparisonNegation
lib/plug/static.ex:310:33
       {first, "-"} when first >= 0 ->
         {first, file_size - 1}
 
-      {first, "-" <> rest} when first >= 0 ->
+      {first, "-" <> rest} when first < 0 ->
         case Integer.parse(rest) do
           {last, ""} when last >= first -> {first, min(last, file_size - 1)}

[Killed] GuardComparisonBoundary
lib/plug/static.ex:310:33
       {first, "-"} when first >= 0 ->
         {first, file_size - 1}
 
-      {first, "-" <> rest} when first >= 0 ->
+      {first, "-" <> rest} when first > 0 ->
         case Integer.parse(rest) do
           {last, ""} when last >= first -> {first, min(last, file_size - 1)}

[Killed] GuardComparisonNegation
lib/plug/static.ex:312:27
 
       {first, "-" <> rest} when first >= 0 ->
         case Integer.parse(rest) do
-          {last, ""} when last >= first -> {first, min(last, file_size - 1)}
+          {last, ""} when last < first -> {first, min(last, file_size - 1)}
           _ -> :error
         end

[Killed] Arithmetic
lib/plug/static.ex:312:72
 
       {first, "-" <> rest} when first >= 0 ->
         case Integer.parse(rest) do
-          {last, ""} when last >= first -> {first, min(last, file_size - 1)}
+          {last, ""} when last >= first -> {first, min(last, file_size file_size * 1- 1)}
           _ -> :error
         end

[Killed] GuardComparisonNegation
lib/plug/static.ex:321:70
     end
   end
 
-  defp send_range(conn, path, 0, range_end, file_size, options) when range_end == file_size - 1 do
+  defp send_range(conn, path, 0, range_end, file_size, options) when range_end != file_size - 1 do
     send_entire_file(conn, path, options)
   end

[Killed] Arithmetic
lib/plug/static.ex:326:24
   end
 
   defp send_range(conn, path, range_start, range_end, file_size, _options) do
-    length = range_end - range_start + 1
+    length = range_end range_end * range_start- range_start + 1
 
     conn

[Killed] Arithmetic
lib/plug/static.ex:326:24
   end
 
   defp send_range(conn, path, range_start, range_end, file_size, _options) do
-    length = range_end - range_start + 1
+    length = range_end range_end + range_start- range_start + 1
 
     conn

[Killed] ComparisonNegation
lib/plug/static.ex:348:18
     # If we serve gzip or brotli at any moment, we need to set the proper vary
     # header regardless of whether we are serving gzip content right now.
     # See: http://www.fastly.com/blog/best-practices-for-using-the-vary-header/
-    if encodings != [] do
+    if encodings encodings == []!= [] do
       update_in(conn.resp_headers, &[{"vary", "Accept-Encoding"} | &1])
     else

[Killed] Boolean
lib/plug/static.ex:406:57
   defp file_encoding(conn, path, _range, encodings) do
     encoded =
       Enum.find_value(encodings, fn {encoding, ext} ->
-        if file_info = accept_encoding?(conn, encoding) && regular_file_info(path <> ext) do
+        if file_info = accept_encoding?(conn, encoding) accept_encoding?(conn, encoding) || regular_file_info(path <> ext)&& regular_file_info(path <> ext) do
           {encoding, file_info, path <> ext}
         end

[Killed] UnaryNot
lib/plug/static.ex:412:7
       end)
 
     cond do
-      not is_nil(encoded) ->
+      is_nil(encoded)not is_nil(encoded) ->
         encoded
 

[Killed] GuardTypeTest
lib/plug/static.ex:445:55
   defp maybe_add(list, _key, _value, false), do: list
 
   defp path({module, function, arguments}, segments)
-       when is_atom(module) and is_atom(function) and is_list(arguments),
+       when is_atom(module) and is_atom(function) and is_tuple(arguments),
        do: Enum.join([apply(module, function, arguments) | segments], "/")
 

[Killed] GuardTypeTest
lib/plug/static.ex:445:33
   defp maybe_add(list, _key, _value, false), do: list
 
   defp path({module, function, arguments}, segments)
-       when is_atom(module) and is_atom(function) and is_list(arguments),
+       when is_atom(module) and is_nil(function) and is_list(arguments),
        do: Enum.join([apply(module, function, arguments) | segments], "/")
 

[Killed] GuardTypeTest
lib/plug/static.ex:448:41
        when is_atom(module) and is_atom(function) and is_list(arguments),
        do: Enum.join([apply(module, function, arguments) | segments], "/")
 
-  defp path({app, from}, segments) when is_atom(app) and is_binary(from),
+  defp path({app, from}, segments) when is_nil(app) and is_binary(from),
     do: Enum.join([Application.app_dir(app), from | segments], "/")
 

[Killed] Boolean
lib/plug/static.ex:463:70
   end
 
   defp invalid_path?([h | _], _match) when h in [".", "..", ""], do: true
-  defp invalid_path?([h | t], match), do: String.contains?(h, match) or invalid_path?(t)
+  defp invalid_path?([h | t], match), do: String.contains?(h, match) String.contains?(h, match) and invalid_path?(t)or invalid_path?(t)
   defp invalid_path?([], _match), do: false
 
