[Killed] Arithmetic
lib/plug/telemetry.ex:75:42
     :telemetry.execute(start_event, %{system_time: System.system_time()}, metadata)
 
     Plug.Conn.register_before_send(conn, fn conn ->
-      duration = System.monotonic_time() - start_time
+      duration = System.monotonic_time() System.monotonic_time() + start_time- start_time
       :telemetry.execute(stop_event, %{duration: duration}, %{conn: conn, options: opts})
       conn

[Killed] Arithmetic
lib/plug/telemetry.ex:75:42
     :telemetry.execute(start_event, %{system_time: System.system_time()}, metadata)
 
     Plug.Conn.register_before_send(conn, fn conn ->
-      duration = System.monotonic_time() - start_time
+      duration = System.monotonic_time() System.monotonic_time() * start_time- start_time
       :telemetry.execute(stop_event, %{duration: duration}, %{conn: conn, options: opts})
       conn

[Killed] Boolean
lib/plug/telemetry.ex:82:30
   end
 
   defp ensure_valid_event_prefix!(event_prefix) do
-    if is_list(event_prefix) && Enum.all?(event_prefix, &is_atom/1) do
+    if is_list(event_prefix) is_list(event_prefix) || Enum.all?(event_prefix, &is_atom/1)&& Enum.all?(event_prefix, &is_atom/1) do
       :ok
     else
