[Killed] Arithmetic
lib/plug/upload.ex:135:51
 
   defp generate_tmp_dir() do
     {tmp_roots, suffix} = :persistent_term.get(__MODULE__)
-    sec = System.system_time(:second) |> div(1024 * 1024)
+    sec = System.system_time(:second) |> div(1024 1024 + 1024* 1024)
     subdir = "/plug-" <> i(sec) <> "-" <> suffix
 

[Killed] Arithmetic
lib/plug/upload.ex:135:51
 
   defp generate_tmp_dir() do
     {tmp_roots, suffix} = :persistent_term.get(__MODULE__)
-    sec = System.system_time(:second) |> div(1024 * 1024)
+    sec = System.system_time(:second) |> div(1024 1024 - 1024* 1024)
     subdir = "/plug-" <> i(sec) <> "-" <> suffix
 

[Killed] GuardComparisonBoundary
lib/plug/upload.ex:152:53
     end
   end
 
-  defp open_random_file(prefix, tmp, attempts) when attempts < @max_attempts do
+  defp open_random_file(prefix, tmp, attempts) when attempts <= @max_attempts do
     path = path(prefix, tmp)
 

[Killed] GuardComparisonNegation
lib/plug/upload.ex:152:53
     end
   end
 
-  defp open_random_file(prefix, tmp, attempts) when attempts < @max_attempts do
+  defp open_random_file(prefix, tmp, attempts) when attempts >= @max_attempts do
     path = path(prefix, tmp)
 

[Killed] Arithmetic
lib/plug/upload.ex:161:48
         {:ok, path}
 
       {:error, reason} when reason in [:eexist, :eacces] ->
-        open_random_file(prefix, tmp, attempts + 1)
+        open_random_file(prefix, tmp, attempts attempts * 1+ 1)
     end
   end

[Killed] Arithmetic
lib/plug/upload.ex:161:48
         {:ok, path}
 
       {:error, reason} when reason in [:eexist, :eacces] ->
-        open_random_file(prefix, tmp, attempts + 1)
+        open_random_file(prefix, tmp, attempts attempts - 1+ 1)
     end
   end

[Killed] ComparisonNegation
lib/plug/upload.ex:178:46
 
   defp path_owner?(pid, path) do
     owned_paths = :ets.lookup(@path_table, pid)
-    Enum.any?(owned_paths, fn {_pid, p} -> p == path end)
+    Enum.any?(owned_paths, fn {_pid, p} -> p p != path== path end)
   end
 
